[
  {
    "구분": "전공필수",
    "학수번호": "BUSS205",
    "교과목명": "마케팅원론",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "현대 기업이 처하고 있는 환경은 갈수록 복잡해지고 다양해지고 있다. 이렇듯 불확실한 환경 내에서 성공적이기 위해서는 마케팅 이론과 실무적 노하우에 대한 이해는 기본적이며 중요하다. 이 과목을 통해 수강생들은 다양한 마케팅 과제를 해결하는데 필요한 기본적인 지식",
    "syllabus_en": "This course is a foundation for marketing curriculum. The interaction with market is important, yet challenging to most companies. Students would learn what marketing is and how to deal with marketing managements. The decision makings in marketing include"
  },
  {
    "구분": "전공필수",
    "학수번호": "BUSS207",
    "교과목명": "재무관리",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": "BUSS152|BUSS154",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기업의 재무관리에 관한 기초적 문제들을 소개하고 자본의 조달과 운용에 따르는 관리문제를 종합적으로 강의한다. 주요 주제로는 운전자본관리, 중장기자금조달, 자본예산, 자본비용, 자본구조, 가치평가 등이 포함된다._x000D_\n",
    "syllabus_en": "An examination of concepts and principles governing the effective management of corporate capita. topics include working capital management, intermediate and long-term finullcing, capital budgeting, cost of capita, finullcial structure, and firm valuation t"
  },
  {
    "구분": "전공필수",
    "학수번호": "BUSS211",
    "교과목명": "오퍼레이션스관리",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기업에 있어서 생산관리의 전략성 중요성을 검토하고, 효과적인 생산 관리를 위한 개념과 기법을 다룬다. 다루어질 주요 주제로는 생산전략, 생산성, 품질관리, 재고관리, 생산계획, 공정계획 등이 있다._x000D_\n",
    "syllabus_en": "This course examines the importance of the production and operations management in the company, and covers the concepts and methodologies for the effective production management. Topics include quality management, demand forecast, aggregate production pla"
  },
  {
    "구분": "전공필수",
    "학수번호": "BUSS213",
    "교과목명": "중급회계I",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "회계원리를 기초로 실무에서 나타나는 다양한 특수문제를 이론적으로 해명하고 처리하는 응용능력을 배양한다._x000D_\n",
    "syllabus_en": "This course starts with a review of finullcial statements, followed by an intensive coverage of revenue recognition principles and the assets and liabilities sections of the statement of finullcial position. It includes the statement of comprehensive income"
  },
  {
    "구분": "전공필수",
    "학수번호": "BUSS215",
    "교과목명": "경영정보시스템",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": "BUSS151",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목에서는 기업경영에 있어서 정보기술의 활용과 관련된 기본개념 및 활용방안에 대해 소개한다. 기업경영을 지원하는 각종 정보시스템, 정보시스템 도입에 따른 경영의 변화, 그리고 정보사회에서의 정보통신기술의 역할 등에 대해 강의한다._x000D_\n",
    "syllabus_en": "The increased application of the information technology (IT) has fundamentally altered the nature of work, business processes and the nature of competition in the past decades.  This course is designed to examine issues surrounding the design, application"
  },
  {
    "구분": "전공필수",
    "학수번호": "BUSS311",
    "교과목명": "조직행동론",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "공감소통",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "시스템 어프로치를 통하여 인간행동의 체계화와 체계적 이해를 제공하고 조직에 있어서의 제반문제를 규명,분석하는 데 중점을 두어 강의한다._x000D_\n",
    "syllabus_en": "This course is an introduction to individual and group behavior in the organizational context. Major topics include personality, motivation, leadership, group dynamics, and decision making theories._x000D_\n"
  },
  {
    "구분": "전공필수",
    "학수번호": "BUSS313",
    "교과목명": "국제경영론",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": "ECON203",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "국제경영분야의 기초 과목으로서 기업의 국제화와 다국적 기업, 그리고 국제사업에 대한 이론과 실제, 해외자회사의 설립과 경영관리, 글로벌 경영환경의 이해, 글로벌 경영전략 및 관리를 다룬다._x000D_\n_x000D_\n",
    "syllabus_en": "Issues and problems arising in international business, with emphasis on decisions facing multinational corporations (MNCs). Topics include environments of international business, strategies for multinational corporations, and functional management of MNCs"
  },
  {
    "구분": "전공필수",
    "학수번호": "BUSS402",
    "교과목명": "경영전략",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "경영전략은 경영학의 종합적인 과목으로서 하위기능별 분야의 이해를 토대로 조직의 기능들을 통합하고, 더 나아가 조직 전체의 방향과 승패를 결정하는 의사결정을 하는, 포괄적이고 중요한 기능이다. 경영전략은 각종 하위 기능들의 단순한 합이나 여분이 아니라 그것을 뛰",
    "syllabus_en": "A study of comprehensive analysis of strategic management process in organizations. This is the capstone course which requires expertise from the functional areas to determine broad concepts, theories, and techniques to develop socially responsibilities a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS003",
    "교과목명": "Topic Course",
    "학년": 3,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "학과에서 중요한 현대 사회의 특정 주제나 그에 대한 새로운 접근 방법을 학습한다. ",
    "syllabus_en": "This course will provide lectures on a new approach or perspective to a specific important topic in department."
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS165",
    "교과목명": "창업가의마인드셋",
    "학년": 1.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "창업가들이 고민하는 문제들은 우리가 일상생활에서 직면하는 다양한 문제들과 본질적으로 크게 다르지 않다. 그렇다면 성공한 창업가들의 문제를 이해하는 마인드셋과 이러한 문제를 해결하는 과정을 관찰해본다면, 우리도 보다 성공적으로 다양한 문제들을 해결할 수 있지 ",
    "syllabus_en": "This course is a comprehensive “deep dive” into the brains of successful entrepreneurs with an objective of understanding how do they think, behave, decide, and consequently, strategize under high levels of environmental uncertainties. We will start the"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS202",
    "교과목명": "사회적가치와지속가능경영",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "사회적책임",
    "필수선수": null,
    "권장선수": "BUSS164",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "이 과목은 기업이 창조하는 사회적 가치와 지속가능경영의 의미와 그 중요성을 논의하고, 그 실행 사례들을 통해 사회적 가치와 지속가능경영을 통해 사회에 가져올 수 있는 긍정적인 변화에 대해 이해 및 파악한다. 또한 기업의 사회적 가치, 사회책임, 기업윤리 등을 토대 ",
    "syllabus_en": "This course discusses the meaning and importance of corporate social responsibility (CSR)/social values (CSV) and sustainablility in business. It also introduces real life cases in CSR/CSV activities to understand and seek improvement of the changes in ou"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS203",
    "교과목명": "경영수학",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "경영학의 연구와 이해에 필요한 기본 수리과학적 방법과 응용을 다룬다. 행렬이론, 미분, 적분, 비선형 및 선형계획법, 게임이론 등의 주제를 강의한다._x000D_\n",
    "syllabus_en": "Basic mathematical concepts and methodologies such as matrix theory, differentiation, integration, nonlinear and linear programming, game theory, and the application of these methodologies to the practical management problems are covered._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS204",
    "교과목명": "세계경제와기업",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "국가간의 경계가 무너지고 있는 무국경시대의 정보화추이, 국제통상 및 금융환경의 변화를 설명하고 국제경영 및 경제에 관한 기초이론과 기업경영의 실제를 배우는 과목으로 강의, 퀴즈, 과제부여, 외부인사 특강, 비디오 시청 등으로 진행된다._x000D_\n",
    "syllabus_en": "Business Management in the world Economy' touches upon basic theories and practices related to international trade, trade environment, international finullce, business strategy. It will also deals with multinational firms' globalization strategies suited t"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS214",
    "교과목명": "중급회계II",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "중급회계 1에서 논의된 내용을 바탕으로 보다 상급의 회계 문제들을 논하게 된다. 리스회계, 외화환산회계, 이연법인세 회계, 연계회계 등이 여기에 포함된다._x000D_\n",
    "syllabus_en": "In addition to the topics covered in Intermediate Accounting I, this course will discuss more advanced accounting topics such as earnings per share, leases, employee benefits, deferred taxes, changes in accounting policies and estimates, changes in foreig"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS216",
    "교과목명": "비즈니스애널리틱스I",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": "BUSS154",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "올바른 의사 결정을 내리기 위한 자료의 분석은 현대의 기업 운영에 필수적이다. 본 과목은 통계 프로그래밍 언어인 R과 비즈니스 애널리틱스에 관련된 수리적 모델을 소개한다. 학생들은 통계 프로그래밍 언어인 R을 이용한 자료의 시각화, 회귀분석을 통한 기업의 운영에  ",
    "syllabus_en": "It is essential for any businesses to analyze data for their effective decision making in a complex business world. In this course, students are introduced to the statistical language R and related quantitative models for business analytics. Students will"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS217",
    "교과목명": "비즈니스애널리틱스II",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": "BUSS154|BUSS215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "데이터는 오늘날의 기업들에게 가장 중요한 자원 중의 하나가 되었습니다. 다양한 소스로부터 다양한 형태의 데이터를 수집하고 이를 분석해 그 결과를 바탕으로 비즈니스 의사결정을 내리는 것은 오늘날의 기업들이 경쟁에서 살아남기 위해 반드시 필요한 비즈니스 활동이  ",
    "syllabus_en": "Data become the most valuable asset for many modern businesses. The ability to obtain and utilize data from a variety of sources and making business decisions based on insights drawn from data become critical. This course is designed to introduce the conc"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS236",
    "교과목명": "ESG경영",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "기업의 지속가능성에 대한 관심의 증대와 함께 구체적 대응방안으로서 ESG 경영의 중요성이 강조되고 있다. 본 과목은 ESG 경영과 관련된 다양한 이슈들을 이해하고 그 시사점을 논의하는데 주요 목적이 있다.",
    "syllabus_en": "The increased interests in corporate sustainability have been emphasizing the importance of ESG management. The main purpose of this course is to understand diverse issues related to ESG management and to discuss their managerial implications."
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS238",
    "교과목명": "광고론",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "현대기업의 마케팅 활동에 있어서 중요한 비중을 차지하고 있는 광고의 이론 및 실무의 고찰을 실습 위주로 강의한다._x000D_\n",
    "syllabus_en": "This course is designed to help students learn how to design an integrated marketing communication plan to build brand values.  Students will learn to develop an effective advertising campaign as part of an integrated marketing communications program and "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS244",
    "교과목명": "관리회계",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "원가회계의 기능, 원가의 개념, 원가계산의 형태 및 계정체계 등 원가의 요소 및 집계와 제품별 원가회계를 이해시키고 개별원가 계산 및 종합원가 계산을 강의한다. 아울러 원가회계를 통해 계산된 원가자료를 활용한 제반 내부의사결정과 성과평가 등에 대하여 논의한다. _x000D_",
    "syllabus_en": "This course focuses on the selection and preparation of information which will serve to support and assist management in planning and controlling firm's operations; includes cost estimation and reporting, cost-volume-profit analysis, budgeting, variance a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS246",
    "교과목명": "경영과학",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "경영문제를 선형계획법, 대기행렬이론, 네트워크 분석, 동태적 계획법, 시뮬레이션 등의 계량적 기법을 적용하여 해결해 나가는 현대적 경영관리 방식을 이수한다._x000D_\n",
    "syllabus_en": "The primary goal of this course is to cultivate analytic skills and a scientific thinking in the problem solving and decision making of management. This course not only shows the techniques for modeling real world decision-making problems, but also demons"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS248",
    "교과목명": "기업경제학",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "기업 경영자의 주요 경영 의사결정에 필요한, 생산?소비이론, 시장경쟁구조와 전략, 정보경제학, 게임이론 등을 강의한다._x000D_\n",
    "syllabus_en": "The course deals with the principles of modern microeconomic theory and its relevance to corporate management decision making. Production & cost functions, market structure, oligopoly theories, information economics(agency theories, adverse selection, mor"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS252",
    "교과목명": "마케팅조사론",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "현대 기업이 효과적인 마케팅전략을 수립, 실행하는 데 필요한 정보를 제공하는 시장조사 이론과 기법을 강의하고 학생들로 하여금 실습을 통하여 실무 경험을 쌓게 한다._x000D_\n",
    "syllabus_en": "This course focuses on understanding the process and outputs of Marketing Research (MR) as well as its applications. After taking this course, students will be able to implement a complete cycle of MR including problem formulation, research design, data c"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS254",
    "교과목명": "투자론",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS207",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기업의 설비투자에 대한 의의, 수요예측, 기술적 타당성분석 및 투자가치의 평가기준을 연구한다. 특히 현금흐름 분석을 중심으로 미래의 위험과 불확실성을 다루며 최적포트폴리오전략, 증권분석 등도 강의에 포함된다._x000D_\n",
    "syllabus_en": "An examination of theory and analytical methods of security enalucation and investment return optimization, including optimal portfolio strategy, risk-return trade-offs, and security analysis._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS256",
    "교과목명": "빅데이터분석과해석의기초",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과정은 다양한 종류의 데이터(예: 기업이나 정부가 인터넷에 공개하는 데이터, 개인이 수집 또는 찾아낸 데이터)를 R를 통해 정리하고 시각화한다. 정리된 데이터는 R이 제공하는 빅데이터 패키지를 사용하여 숨겨진 패턴을 발견하고, 그 의미를 해석하는 실습을 한다. 이",
    "syllabus_en": "This class introduces R and big data analytics in management. Data preprocessed by using R are faded into big data analytic platform to identify hidden patterns. Students then practice interpretations of patterns identified. Students can bring their data "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS259",
    "교과목명": "벤처경영",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "벤처경영의 주요 요소인 ‘창업’과 ‘관리’에 필요한 절차, 즉 사업아이디어    의 개발, 사업계획성의 작성 및 발표, 사업전략의 구체적 평가에 관련된    이론과 방법 등을 공부한다. _x000D_\n",
    "syllabus_en": "This course is designed to provide students with a better understanding of diverse aspects of strategic planning for a new venture. By taking the course focusing on how to prepare for a new venture, students will develop the skills and attitudes required "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS301",
    "교과목명": "사회적가치프로젝트",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "도전적리더",
    "필수선수": null,
    "권장선수": "BUSS164|BUSS202",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 5.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목은 사회적 가치를 창출하는 비즈니스 모델을 학생 스스로 설계하거나 연구하는데 목표가 있다. 프로젝트를 발전시키는 과정에서 학생 스스로 경영학 지식을 활용하고, 사회적 가치를 기반으로 하는 아이디어를 구체화 한다. 또한 팀원 간 상호 존중과 협력을 통해 미 ",
    "syllabus_en": "The objective of this course is to design and study business models that create social value. Especially in the process of developing the project, the students themselves utilize their knowledge from business major courses to embody business ideas based o"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS302",
    "교과목명": "파이낸셜애널리틱스",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS216|BUSS216",
    "권장선수": "BUSS217|BUSS254|BUSS217|BUSS254",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목에서는 비즈니스 애널리틱스 1 과정에서 배운 통계적 분석 도구들을 재무금융 데이터에 적용하고 그 결과를 해석하는 것을 목표로 한다. 전통적인 회계정보부터 비정형의 텍스트 데이터들을 다루는 법을 배우며 그것을 금융시장 분석에 적용하는 실질적 경험을 쌓는  ",
    "syllabus_en": "This course is primarily designed for students who are knowledgeable on tools provided in Business Analytics 1 and have interests in their application to finullcial market analysis. The most important objective of the course is for students to get hands-on"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS303",
    "교과목명": "디자인씽킹과디지털혁신",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": "BUSS215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "디자인 씽킹은 사용자 관점에서 문제를 이해하고 창의적이고 혁신적인 해결책을 찾고자하는 과정입니다. 본 과목에서는 디자인 씽킹을 디지털 혁신 측면에서 살펴보고자 하는데 그 이유는 어떠한 파괴적 혁신도 사용자의 니즈를 이해하지 않고서는 이룰 수 없기 때문입니다. ",
    "syllabus_en": "Design thinking is a creative and collaborative process that focuses on understanding the problem from the customer’s perspective. In this course, the concept of design thinking will be introduced within the context of digital innovation because no disru"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS305",
    "교과목명": "인공지능과비즈니스",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": "BUSS217|BUSS453",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "인공지능과 빅데이터의 활용으로 대표되는 4차 산업혁명 시대에, 대부분의 기업들은 대량의 데이터를 보유하고 있지만 데이터를 활용하여 유익한 정보를 얻고 가치를 찾는데 어려움을 겪고 있다. 특히 인공지능 기술을 활용한 기업데이터의 전략적인 사용은 기업의 경쟁력을 ",
    "syllabus_en": "The main purpose of this course is to introduce students to up-to-date AI applications and the related business topics. The course will cover general concepts in the data science and artificial intelligence fields, along with widely-accepted machine learn"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS306",
    "교과목명": "전략적기술사업화",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": "BUSS165|BUSS259",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "본 과목은 신규 사업, 특히 신기술에 기반한 창업을 시작하기 위한 아이디어 포착 및 구체화, 고객 개발, 사업 모형 개발, 사업성 분석, 위험요인 분석, 스타트업 기업 가치 분석 및 투자 유치의 전략적 기술사업화를 구성하는 전 과정을 학습하고, 이러한 과정을 거쳐 만들 ",
    "syllabus_en": "This course covers the entire process of strategic technology commercialization that consists of identifying the lucrative technology opportunity, developing non-existent customers and subsequent target markets, and developing business models, feasibility"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS307",
    "교과목명": "플랫폼비즈니스모델과디지털대전환",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": "BUSS215|BUSS256",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "카카오, 텐센트, 페이스북, 마이크로소프트, 아마존, 구글, 애플, 넷플릭스, 우버, 에어비앤비, 페이팔. 이 기업들은 기존 전통 시장을 파괴하고 놀라운 변혁을 통해 새로운 시장을 창출하고 있습니다. 특히 이들 테크 기업들은 ‘플랫폼과 양면 시장’을 기초로 한 ‘디지털",
    "syllabus_en": "Kakao, Tencent, Facebook, Microsoft, Amazon, Netflix, Google, Apple, Uber, Airbnb and PayPal. All of these companies digitally transformed their markets when they launched. These cutting-edge digital businesses are built on platforms: two-sided markets th"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS316",
    "교과목명": "오퍼레이션스애널리틱스",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": "BUSS154",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "현대 사회에서 기업 내 오퍼레이션즈 관련 의사 결정의 상당 부분은 자료를 이용한 분석에 기반을 두게 된다. 실무자로서 더 나은 비즈니스 운영 관련 의사 결정을 하기 위한 통계, 시뮬레이션 및 수리 모형을 사례 분석과 연관지어 학습하게 된다. 즉, 비즈니스 오퍼레이션 ",
    "syllabus_en": "The use of business analytics to improve business operations has become pervasive in small and large corporations. In this course, students are introduced to the statistical and mathematical models for business analytics in the context of relevant busines"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS317",
    "교과목명": "소셜미디어애널리틱스",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": "BUSS215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "오늘날의 기업들은 페이스북과 트위터 등의 소셜 네트워크 서비스를 통해 소비자의 의견을 듣고 그들과 소통합니다. 또한, 소비자들은 소셜 네트워크 서비스를 통해 다양한 콘텐츠를 생성하고 공유합니다. 그러나 이러한 소셜 네트워크 서비스 상에 존재하는 다양한 데이터의",
    "syllabus_en": "Social media such as Facebook and Twitter has emerged as a new communication channel that connects firms with their customers. Further, customers create and share various content, including reviews, photos, and videos with each other via social media. How"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS321",
    "교과목명": "지역연구(중국)",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS322",
    "교과목명": "지역연구(일본)",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "  본 과목의 목적은 수강생들에게 일본 비즈니스에 대한 폭넓은 이해를 제공하는 것으로 그 구성은 아래와 같이 세 부분으로 나뉜다. _x000D_\n 첫째, 일본경제의 구조와 세부특성에 대한 전반적인 이해 _x000D_\n 둘째, 일본의 경영환경 및 경영방식에 대해  다양한 각도에서의 논의 _x000D_\n 셋",
    "syllabus_en": "This course aims at providing students with a better understanding of Japanese business and management. It consists of three parts. First, an overview of the structure and specifics of the Japanese economy will be given. Second, various aspects of Japanes"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS325",
    "교과목명": "Korean Business & Management in the Global Context",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 크게 3가지 주제를 다룬다. 첫째, 한국경제의 구조와 발전에 대해 논의한다. 둘째, 한국 기업들의 글로벌화 과정과 국제 경영전략을 분석한다. 셋째, 외국기업들에 대한 한국의 기업활동 환경을 검토한다. _x000D_\n",
    "syllabus_en": "This course covers three main topics. First, the structure and development of the Korean economy is discussed. Second, the globalization process and international business of Korean companies is analyzed. Third, the environment for doing business in Korea"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS328",
    "교과목명": "거시경제와글로벌비즈니스이해",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목은 기업 내, 외부의 수많은 경영 및 투자 결정이 이루어지는 경영환경에 영향을 미치는 거시 경제 상황과 이러한 상황에 중요한 영향을 미치는 거시 경제정책에 대한 이해를 높이기 위해 개설되었다. 본 과목에서는 체계적인 거시경제모형들을 이용하여 정부정책 및  ",
    "syllabus_en": "This course provides a systematic framework to understand the current state of the economy and macroeconomic policy, and evaluating the economic environment within which business and finullcial decisions are made. The course emphasizes the use of theoretic"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS330",
    "교과목명": "중국경제론",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS331",
    "교과목명": "국제무역론",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": "ECON120",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "Adam Smith이래 진전되어온 국제무역과 투자이론의 발전을 고찰한다. 리카도의 비교 우위론, Heckscher-Ohlin이론, 제품주기설, 신무역이론(New trade theory) 등의 무역이론과 다양한 해외직접 투자이론을 소개하는 것이 주요과제가 된다. 또한 이런 이론들을 바탕으로 세계",
    "syllabus_en": "This course covers basic principles and theories of international trade and investment: Ricardian, Neoclassical trade model, New trade theory, other modern theories of international trade and the theories of foreign direct investment. The course also appl"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS335",
    "교과목명": "IT기반비즈니스모델",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "본 과목에서는 IT로 인한 비즈니스 모델의 변화에 대한 이론적 고찰과 사례연구를 다룬다. 이를 위해 (1) 비즈니스 모델의 정의와 유형, (2) 비즈니스 모델의 개발방법, (3) IT로 인한 새로운 비즈니스 모델 등에 대한 개념과 이론을 강의한다. 또한 IT 비즈니스 모델에 대한",
    "syllabus_en": "The objective of the course is to provide students with a basic understanding of what a business model is and how to develop a business model based on IT. The course is designed to get students go through the process of developing a business model by prop"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS340",
    "교과목명": "국제마케팅론",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "국제마케팅의 전개과정, 국제기업활동의 일환인 국제마케팅의 이론과 실무를 중점으로 강의한다._x000D_\n_x000D_\n",
    "syllabus_en": "Examines the development of international marketing programs from the evaluation of international market opportunities through the coordination of international market opportunities. Emphasizes the application of basic marketing principles in the multinat"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS342",
    "교과목명": "소비자행동",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "소비자 행동분석의 중요성을 설명하고, 소비자 행동분석에 있어서 행동과학의 유용성을 강의함과 동시에 소비자 행동분석의 여러 기법을 소개한다. ",
    "syllabus_en": "This course introduces an interdisciplinary approach to analyze and interpret consumer buying behavior. This course provides a basic understanding of the general models of choice behavior as it relates to marketing decision making._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS344",
    "교과목명": "국제금융론",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "국제금융시장의 현재 및 미래 현상을 분석하고, 이를 기업경영에 반영시킬 수 있는 능력개발에 목적을 두고 있다. 국제금융시장의 조직 및 제도에 중점을 두고 국제통화제도, 외환시장, 환율의 결정, 기업의 환위험 관리 등을 강의한다. _x000D_\n_x000D_\n",
    "syllabus_en": "Analyses the current and future situations in international finullcial markets and corporate management strategies. Topics include foreign exchange, international monetary system, finullcial management for MNCs and international banking._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS352",
    "교과목명": "세무회계",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "조세의 개념과 국세기본법을 개괄적으로 다루고 소득세회계, 부가가치세회계, 법인세회계 등 세무회계의 이론과 실무를 체계적으로 강의한다._x000D_\n",
    "syllabus_en": "Study of general principles and practical applications of business tax laws including income tax and value added tax._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS354",
    "교과목명": "회계학이론",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "회계의 원리 및 기본개념의 이해를 통하여 회계현상에 대한 해석과 회계실무의 적용능력을 배양한다._x000D_\n",
    "syllabus_en": "This course covers definitions of accounting principles, concepts of cost revenues and income, surplus, reserves, valuation, depreciation, and interpretation of finullcial statements._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS355",
    "교과목명": "노사관계론",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "공감소통",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "노사관계의 역사적 배경, 기본성격, 형성요인, 단체교섭, 임금문제, 단체협약, 쟁의, 노사협력, 경영참가, 노동자복지 등을 강의한다._x000D_\n",
    "syllabus_en": "Discourse on the emergence and maturation of labor unions with emphasis on collective bargaining, legal issues, labor disputes, employee involvement, and labor-management cooperation._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS356",
    "교과목명": "혁신과전략",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "기술혁신이론의 고찰을 통하여 기업의 경영전략, 조직설계, 인사관리, 마케팅, 세계화 등과 연결되는 연구개발관리, 기술전략, 국가혁신체제 등에 관해 공부하며, 또한 기술집약적 벤처기업의 형성과 관리에 대한 문제들을 분석한다._x000D_\n",
    "syllabus_en": "The goal of this course is to provide students with an understanding of dynamics of technology/industry evolution and its implications for the rules of competition, business models, competitive advantages, firm strategies, and organization design._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS358",
    "교과목명": "인적자원관리",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 현대 기업들의 구성원인 사람을 관리하는 것과 관련된 제반 활동들을 이해하도록 돕는다. 본 강의는 인사부서의 관점에서 인사 전문가로서 어떻게 사람의 확보, 개발 및 유지 등과 관련된 인적자원관리 기능들을 관리할 것인가에 대한 이슈를 다룸과 동시에, 어떻 ",
    "syllabus_en": "This course provides an overview of relevant theory and practice in the macro and micro organizational aspects of human resource management (HRM). The course is designed to give a strategic perspective for the general manager and operational views on the "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS361",
    "교과목명": "고급회계",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "중급회계의 연장으로서 특수한 회계문제와 외환회계, 연결 및 합병회계, 기금회계 등을 강의한다._x000D_\n",
    "syllabus_en": "This course is an extension of Intermediate Accounting I and II. Covers accounting for business combination, consolidation, derivatives, and hedging._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS362",
    "교과목명": "유통관리",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "실증적인 관점에서 유통경로 관리와 연관된 마케팅의 여러 문제점들을 보다 더 포괄적으로 파악할 수 있도록 하며, 그러한 문제점들을 다루는 데 필요한 마케팅 전략을 세우는 데 요구되는 분석적인 기법들을 배양하는 것이 이 강의의 목적이다. 이 강의를 이수함으로써 특정",
    "syllabus_en": "This course is designed to help undergraduate students to broaden their understanding of marketing problems related to distribution channel management from a practical perspective and to develop analytical skills required in developing a set of marketing "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS363",
    "교과목명": "마케팅전략",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "현대 기업의 “마케팅활동”을 4P중심으로 체계적으로 계획, 조직, 집행, 조정 및 통제하는 이론과 기법을 강의한다._x000D_\n",
    "syllabus_en": "This course is designed to provide theories and practical knowhow of marketing strategy including strategy formulation(market attractiveness assessment, competitive boundary recognition) and implementation(product, price, promotion, place). Very often the"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS364",
    "교과목명": "기업윤리",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "사회적책임",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기업행위의 윤리적 차원에 의한 체계화로 기업의 책임론을 주된 내용으로 한다. 기업 의사 결정의 윤리적 딜레마, 기업의 사회적 책임 그리고 이해 관계자의 역할과 관리를 분석한다._x000D_\n",
    "syllabus_en": "An understanding of social responsibility of the business by systematizing it based on the business ethics: Analysis of ethical dilemmas in business decision-making, corporate social responsibility and roles and management of stakeholders._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS365",
    "교과목명": "조직디자인과경쟁우위",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS311",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "조직을 분석의 단위로 하여 환경과 기술 등 상황요인에 따른 조직설계에 관한 종합적 이론을 강의한다._x000D_\n",
    "syllabus_en": "The goal of this course is to provide students with an understanding of principles of organization theory and design, and to enable students to design and lead value-creating organizations._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS367",
    "교과목명": "국제재무관리",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS207",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 과목은 경제개방을 효과적으로 극복하기 위한 필요조건으로 외환시장과 국제금융시장의 기능과 구조를 심도있게 분석한다. 다음 외환 및 국제재무리스크에 대한 최신 관리방법을 소개함으로써 기업과 금융기관들의 국제화 전략 수립에 필요한 이론적 수단을 제공한다. 본 ",
    "syllabus_en": "As an effective academic tool for internationalization of domestic economy, this course provides an in-depth analysis of foreign exchange market. Also this course introduces advanced risk management strategies for the business firms and finullcial institut"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS376",
    "교과목명": "서비스운영관리",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "서비스의 특성을 토대로 서비스 전략, 서비스와 정보기술, 서비스품질, 서비스생산성을 강의와 사례를 병행하여 다룬다._x000D_\n",
    "syllabus_en": "In this course, topics such as service strategy, service innovation and productivity, service quality and customer satisfaction, service process reengineering and service related e-business are covered._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS377",
    "교과목명": "전략적수요및수익관리",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "전략적 수요 및 수익관리는 수요예측에서 시작하는 기업의 수요 측면에 관련한 다양한 의사결정 방법을 다룬다.  이때 제품이나 서비스는 유효기간이 있으며 수익을 극대화 하는 방안을 모색하는 것이 일반적이다. OM/OR 의 중요한 분야의 하나로서 항공사, 호텔 등 다양한  ",
    "syllabus_en": "Strategic Demand & Revenue management (RM hear after) involves managing companies’demand side decisions using a variety of alternative management tool and tactics starting from demand forecasting. In most cases the goal of RM is to maximize revenues (yie"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS382",
    "교과목명": "보험과위험관리",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "사회적책임",
    "필수선수": null,
    "권장선수": "BUSS207",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 강의는 불확실성과 위험에 관한 속성을 파악하고 이에 따른 위험관리 기법들과 보험 기법들을 고찰한다. 또한 기업들이 왜 위험관리를 해야 하며 과거와 현재의 보험 및 위험관리 방법론들은 무엇인지 살펴본다. 강의 내용은 금융자산들과 보험 상품들을 이용하여 위험관 ",
    "syllabus_en": "The course discusses the complex nature of the words 'uncertainty' and 'risk', and how their many definitions and interpretations impact risk management. Subsequent lectures demonstrate why organizations must manage risks and what is different in the way "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS384",
    "교과목명": "기업재무",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS207",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기업재무론은 재무관리 중에서 기업의 재무의사결정과 관련된 문제를 중점적으로 다룬다. 기업재무론의 주요한 내용은 자본구조 결정이론, 자본비용 결정이론, 배당정책 등의 기업가치 결정과 관련된 이론과 실제, 재무분석과 재무계획, 운전자본의 관리 등의 자본운용, 그리",
    "syllabus_en": "The course focuses on areas related to corporate finullcial decision making. Topics covered include capital structure theory, cost of capital, dividend policy, finullcial analysis and planning, working capital management, long-term finullcing including leasi"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS385",
    "교과목명": "정보보안관리",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "사회적책임",
    "필수선수": null,
    "권장선수": "BUSS215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "보안과 프라이버시는 정보기술 최고책임자들을 대상으로 한 설문조사에서 가장 중요한 정보기술 관리 이슈로 조사되었다. 본 과목에서는 보안 위협, 보안 취약점, 위험 산정, 시스템 영속성 등, 정보보안 관리상의 중요한 요소들에 대하여 사회기술적인 접근방식으로 소개한 ",
    "syllabus_en": "'Security and privacy' was ranked as the number two most important IT management issue in a key issue survey of IT executives. The course will introduce students to the basic elements of information security management such as: Security threats and vulner"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS386",
    "교과목명": "선물옵션",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS207|BUSS207",
    "권장선수": "BUSS254|BUSS254",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "선물옵션은 주식과 채권 등의 기초금융상품에 기초하여 발행된 파생금융 상품이다. 선물옵션은 기초자산에 대한 투자로부터 발생하는 투자위험을 헷징하고 관리하는 수단으로 이용될 뿐 아니라 보다 적극적으로 파생상품 자체의 가격변동으로부터 수익을 얻는 것을 목적으로 ",
    "syllabus_en": "The course covers finullcial and commodity futures and option pricing theory. Topics to be included are, for example : hedging strategies with options and futures, investment strategies using arbitrage opportunities, the pricing of bond and stock options, "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS390",
    "교과목명": "Business-to-Business마케팅",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목은 소비자 중심의 마케팅과는 다른 특성을 지닌 기업고객을 대상으로 하는 기업의 마케팅 활동에 초점을 둔다. 이를 위해 소비자 마케팅과 Business 마케팅의 차이점들을 밝히고 이러한 특성이 마케팅 전략에 미치는 영향을 제시한다. 특히 고객가치의 중심의 전략적 ",
    "syllabus_en": "This course focuses on business marketing activities that are different from business-to-consumer marketing. This course(1) highlights the differences between consumer marketing and business marketing, (2) presents influences of such differences on develo"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS392",
    "교과목명": "서비스마케팅",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "제품과는 다른 서비스의 특성에 대한 기본적인 이해를 바탕으로 서비스 산업_x000D_\n(예: 통신, 금융 등)에서 더욱 필요로 하는 고객관리 및 수요관리를 습득하고 서비스 마케팅 활동의 근간이 되는 상품 기획, 가격 설정 및 판매 촉진에 관련된 이론과 사례를 학습. 특히 고객 접 ",
    "syllabus_en": "This course contrasts marketing activities of service firms compared to those of manufacturing firms by focusing on dynamic pricing, one to one promotion. As well it covers issues related to customer satisfaction and loyalty (repeat purchase, referral) in"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS393",
    "교과목명": "현대기아차글로벌마케팅전략",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과정은 현대자동차와 고려대학교 경영대학이 산학협동 철학에 기초하여 개설하는 과정으로 수강 학생들은 담당 임원 및 실무진으로 구성된 강사진으로부터 자동차산업 현황 및 전망, 현대기아자동차의 성공요인과 실패요인 그리고 글로벌 마케팅 전략과 한국, 유럽, 아중 ",
    "syllabus_en": "The objective of the course is to study marketing strategy of Hyundai Motors and to investigate with depth its decision making process. The emphasis will be given to learn how real decision makings are made in practice. Therefore, the class will be offere"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS394",
    "교과목명": "비즈니스협상",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "공감소통",
    "필수선수": "BUSS311",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "협상은 두 사람이나 여러 사람들간에 합의에 이르게 하는 과학(science)이자 예술이다. 협상의 기본적인 개념과 이론들을 공부함으로써 과학적인 접근을 할 뿐만 아니라, 많은 실습을 통하여 체득하게 함으로써, 책 속에 갇혀 있는 협상이론이 아니라 실제 생활에서 활용할  ",
    "syllabus_en": "Negotiation is the art and science of securing agreements between two or more parties who are interdependent and who are seeking to maximize their outcomes. The central issues of this course deal with understanding the behavior of individuals, groups, and"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS395",
    "교과목명": "마케팅애널리틱스",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "마케팅 전략 및 활동에 있어서 의사 결정에 필요한 다양한 종류의 계량 모형을 이해하고, R 그로그래밍과 EXCEL을 이용한 실제 시장자료분석을 통하여, 모형 별 특징을 공부하고 마케팅 의사결정을 내리는 방법을 배운다.",
    "syllabus_en": "This course is aimed at learning quantitative aspect of marketing. The course will cover (1) how to build quantitative models for decision makers, (2) how to analyze the various market data covering both structured and unstructured data, and (3) how to tr"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS397",
    "교과목명": "벤처투자운용론",
    "학년": 3.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "이 과목은 향후 전문 벤처캐피털 투자자 양성을 위한 전공선택 이수과목으로서, 벤처캐피털 환경, 투자, 설립, 운영 등 포괄적인 제반 실무영역을 포함하고 종합하는 강의, 토론, 그리고 실전 훈련 중심으로 진행한다. 벤처캐피털 전문인력 양성 외에도 벤처창업 관련 진로를",
    "syllabus_en": "This course is made of a set of lectures, discussions and clinical sessions that provide practical knowledge foundation to become a venture capitalist. The range of course covers a variety of subjects such as venture capital market landscape, investment m"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS405",
    "교과목명": "마케팅과혁신",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "혁신을 통한 지속적인 성장은 기업 활동에 있어 중요한 이슈가 된다. 이윤을 내는 혁신은 지속적으로 좋은 아이디어를 찾아내고, 고객 서비스를 개선하고, 새로운 시장을 개척하며, 새로운 제품을 출시하는 역동적인 과정이다. 이 과목을 통해 급변하는 경쟁 환경 속에서 마 ",
    "syllabus_en": "Profitable innovation is a dynamic process of continually identifying good ideas, creating new market space, improving customer experiences, opening new markets and launching new products. This course gives you a complete understanding of marketing innova"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS407",
    "교과목명": "신상품개발과마케팅",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "성공적인 신상품 개발과 출시는 기업이 지속적으로 성장, 발전하기 위하여 필수적인 활동이다. 이 과목은 아이디어 창출에서부터 출시에 이르는 신상품 개발 과정을 성공적으로 수행하기 위하여 필요한 마케팅 개념, 용어, 이론, 도구 등을 다룬다.",
    "syllabus_en": "New product development is recognized as being critical to the success of any corporations. This course covers marketing concepts, terms, theories, and tools essential to successfully complete a new product development ranging from idea generation to laun"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS409",
    "교과목명": "소셜벤처창업",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "사회적책임",
    "필수선수": null,
    "권장선수": "BUSS152|BUSS205|BUSS207",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "현대사회는 정부나 비정부기관(NGO)들의 활동만으로 해결하기 어려운 많은 문제에 직면하고 있다. 이에 기업활동을 통해 이러한 사회적 문제들을 해결하고자 하는 시도들이 이루어지고 있으며 이를 사회적 기업이라고 한다. 사회적 기업 중 사회적 혁신에 방점을 둔 기업을  ",
    "syllabus_en": "There are various social issues that cannot be effectively addressed by the government or NGOs. Social enterprises, businesses that have the goal of addressing specific social issues, have emerged to meet this challenge. Especially, social ventures are so"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS410",
    "교과목명": "기술혁신관리:성공적Entrepreneurship의기초",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "오늘날 기술과 혁신은 기업의 생존과 성장에 필수 요건이다. 본 과목에서는 최근 산업계의 화두인 Information Technology의 혁신과 융합을 매개로 한 신 비즈니스 개척과 경영관리 혁신을 다룬다. 최근의 IT 혁신/융합의 Trend를 살피고 그것을 매개로 한 새로운 비즈니스와",
    "syllabus_en": "Managing technology and innovation is essential to the survival and growth of companies, but it is a tricky business. This course provides future entrepreneurs with necessary insights into the nature of technological innovations. Students will understand "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS413",
    "교과목명": "기업지배구조의이론과실제",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS207",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "경영진/투자자간 대리관계에서 발생되는 대리비용의 유형을 고찰하고 이를 완화하기 위한 내/외부 통제 수단으로서의 이사회, 유인 설계(보수구조), 투자자 행동주의, 기업지배권 시장, 사법적 보호 등이 기업가치에 미치는 영향을 이론적/실증적으로 분석한다. ",
    "syllabus_en": "This course is intended to provide the students with a general framework of understanding the factors that affect firm value when the interests of the management and the investors are not perfectly aligned. Thus, we are explicitly relaxing the basic assum"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS414",
    "교과목명": "채권론",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS207|BUSS207",
    "권장선수": "BUSS203|BUSS203",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "고정수익증권인 채권의 가격결정, 채권투자 수익률과 수익률의 변동성, 채권투자자의 위험, 이자율의 기간구조, 채권투자 전략 및 금리 과생상품을 주로 다룬다. ",
    "syllabus_en": "The aim of this course is to provide students with the introduction to the valuation of fixed income securities and the management of fixed income investment portfolios. It will start with the basics of bond pricing and discuss the various sectors of the "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS415",
    "교과목명": "위험관리",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS207|BUSS207",
    "권장선수": "BUSS203|BUSS203",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "이 과목은 전사적 관점에서 기업의 재무적 위험을 평가하고 관리하는 기본적 틀과 제 기법들을 다룬다. 우선 위험관리가 어떻게 기업가치에 공헌하는가를 분석하는 것을 시작으로 기업이 직면하는 시장위험, 현금흐름위험, 금리위험, 환위험, 신용위험 및 운영위험 등의 측정",
    "syllabus_en": "This course is designed to train students in evaluating and managing risks using an enterprise-wide approach. The course strats with an analysis of how risk management contributes to firm value. The course then examines the measurement and management of m"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS416",
    "교과목명": "기업가치평가",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": " |BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "제반 회계정보를 이용하여 기업의 가치를 평가할 수 있는 모형에 대해 공부한다. 공표된 회계정보를 평가모형에 사용하기 위해 변형하는 방법은 물론 회계수치와 시장지표를 이용한 단수 배수모형에서 시작하여, 미래의 예상 회계 수치를 이용한 이익할인 모형, 잔여이익모형",
    "syllabus_en": "This course deals with various valuation models using accounting information. The topic also covers how to change reported accounting information to use in valuation model. How to apply multiple valuation model, earnings discount model, residual income mo"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS417",
    "교과목명": "고급투자론",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS207|BUSS254|BUSS207|BUSS254",
    "권장선수": "BUSS203|BUSS203",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목의 목적은 투자자들이 투자전략에 맞게 효율적으로포트폴리오를 형성하는 방법과 가격결정을 하는 방법을 자세히 다르고자 한다. 주로 쓰이는 방법들은 현대포트로리오이론을 기반으로 하고 있다. 또한 CAPM, APT등 자산가격결정이론의 배경과 응용에 대한 자세한 이 ",
    "syllabus_en": "The purpose of this course is to provide students with a detailed understanding of how investors or investment managers combine assets into portfolios and set effective investment strategies and how capital markets price securities. The main analyzing too"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS418",
    "교과목명": "기업의인수합병과구조조정",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "1. 기업의 인수와 합병, 분할 및 구조조정에 관련된 여러 분야의 이론과 다양한 관련 이슈를 소개 및 분석하여 융합적 사고를 기르고, 구체적 현실 사례를 통해 이론을 현실에 적용하여 데이터 분석 및 활용 능력을 향상시키며, 인수합병 및 구조조정에 관련된 경제주체 간의",
    "syllabus_en": "This course aims to develop convergent thinking by examining various theories and issues related to mergers, acquisitions, and restructurings, apply theories to real-world cases to improve data analysis skills, and increase understanding of corporate soci"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS420",
    "교과목명": "리더쉽:이론과실제",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "도전적리더",
    "필수선수": "BUSS311",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "리더쉽은 인류 역사 속에서 끊임없이 논의되어 온 화두 가운데 하나이다. 일반적 리더와는 다른 특별한 성과를 이루어내는 리더쉽은 무엇인가? 이 과목의 목적은 학생들로 하여금 이러한 질문에 대한 해답을 찾도록 도와주는 것이다. 즉, 자신뿐만이 아니라 타인과 사회에 대",
    "syllabus_en": "Leadership is one of the world’s oldest preoccupations. Why do most leaders elicit merely competent performance, while a selective few inspire extraordinary achievement? The purpose of this course is to help students find answers to this question by prov"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS425",
    "교과목명": "소셜네트워크와경쟁우위",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS311",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "점점 더 복잡해지고 빠른 속도로 변화하는 환경 속에서 기업이 지속적으로 경쟁우위를 확보하기 위해서는 다른 기업들 또는 사회 구성원들과 관계가 점점 더 중요해지고 있다. _x000D_\n이에 소셜 네트워크와 관련된 조직 및 경영전략 이론에 대한 심화 학습을 통해 지속적 경쟁우위",
    "syllabus_en": "In a complex and rapidly-changing environment, it is getting more important for a firm to build social relationships with other firms (e.g. competitors, buyers, and suppliers) and members of the society (e.g. governments, non-profit organizations, etc.)_x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS431",
    "교과목명": "회계감사",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "회계감사의 준비 및 실시, 조서작성, 보고서작성 및 감사의견 형성에 관한 이론과 실제를 강의한다._x000D_\n",
    "syllabus_en": "Develops an understanding of the audit function as it exists in modern business and non-profit organizations; audit standards, ethics, and liability; audit evidence, including the application of statistics in sampling and analytical review: audit reports "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS435",
    "교과목명": "경영의철학적이해",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 강의는 경영(학)을 패러다임과 철학적으로 이해하고 해석하도록 돕는데 있다. 흔히 경영학을 실용학문이라고 하며, 이념과 철학은 없이 이익창출에만 집중한다고 생각하는 경향이 있다. 본 과목은 이런 일반적 통념과는 달리 경영학과 경영 패러다임은 여느 사회과학과 같",
    "syllabus_en": "This course provides philosophical foundations of management theories and practices so that students can have philosophical understanding of management. This course covers such topicsas assumptions about human nature, political philosophy (i.e., liberalis"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS438",
    "교과목명": "금융기관경영론",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS207",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "금융기관 경영과 관련된 이론, 모형 및 실무를 다룬다. 구체적인 내용으로는 금융 중개이론, 대차대조표상 특징, 자산관리, 부채과리, 자산부채종합관리(ALM), 자본관리, 부외거래의 종류와 특징, 증권화, 그리고 금융규제 등을 포함한다._x000D_\n",
    "syllabus_en": "This course deals with theories, models, and practices of finullcial institutions management. Topics include theory of finullcial inter-mediation, analysis of finullcial performance, asset management, liability management, asset-liability management(ALM), ca"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS439",
    "교과목명": "마케팅신조류",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과정은 마케팅 과목에 관심이 있는 학부생을 위한 학부 세미나입니다. 마케팅 분야의 최근 개발이 학기 내내 소개되고 논의될 것입니다. 주제는 다음과 같습니다._x000D_\n1. 직접 판매_x000D_\n2. 웹 디스플레이 개인화_x000D_\n3. 개인화 오퍼링 설계_x000D_\n4. 디지털 고객 경험_x000D_\n5. 동적 가격 책 ",
    "syllabus_en": "This course is an undergraduate seminar for undergraduate students who are interested in marketing subject. Recent developments in marketing area will be introduced and discussed throughout the semester. Topics include:_x000D_\n1. Direct sales_x000D_\n2. Web display pe"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS442",
    "교과목명": "품질경영",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "기업환경이 국제화 되어감에 따라 품질에 대한 인식이 기업경쟁력의 중요문제로 대두되고 있다. 이에 따라 국제품질 규약인 ISO 9000의 인증요구조건과 절차 등을 살펴보고 아울러 통계적 품질관리, 종합적 품질관리 그리고 서비스산업의 품질관리 등을 다룬다._x000D_\n",
    "syllabus_en": "This course introduces the scientific and statistical methods on product inspection, control chart, and total quality management. This course also deals with ISO 9000, which is a global standard of product and process quality._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS447",
    "교과목명": "로지스틱스관리",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": "BUSS203",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "원재료의 조달, 생산계획 및 스케쥴링, 그리고 완제품의 분배에 이르는 기업내 모든 물류에 관련된 의사결정을 합리적으로 하기 위한 제반개념과 방법을 다룬다. 또한 기업내 물류관리의 확장된 개념인 공급체인관리도 살펴본다_x000D_\n",
    "syllabus_en": "This course deals with the concepts and methodologies for the effective decision making related to the business logistics management. Topics include the management of transportation and distribution, inventory control, production planning and scheduling, "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS448",
    "교과목명": "오퍼레이션스전략",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "시장의 니즈를 총족시키기 위한 생산전략의 수립방법 및 전략의 틀을 제시하며, 생산 전략수립을 위하여 고려해야 할 Order-Winner와 Qualifier를 분석?검토한다. 또한 기업전략을 수립하는데 있어서 생산과 마케팅의 역할 및 상호관계를 연구한다._x000D_\n",
    "syllabus_en": "This course introduces important strategies of production and operations management, including such concepts as order-winner and order-qualifier, make-to-order and make-to-assembly. This course also deals with the relationships among Operations strategy, "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS453",
    "교과목명": "데이터관리와지적경영",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "이 과목은 데이터베이스 시스템에 관한 기본 과목이다. 모든 정보시스템의 중요한 요소인 데이터베이스 시스템의 기본 개념에 대하여 공부한다. 이 과목에서는 데이터베이스의 관리자와 사용자 모두에게 공히 요구되는 실제적인 이슈들, 예를 들면, 데이터베이스 시스템의 구",
    "syllabus_en": "This course deals with both database systems and data mining systems. It introduces basic concepts related to database systems, and explains how to design a database and how to issue various queries against a database using SQL commands. This course also "
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS454",
    "교과목명": "제품및브랜드관리",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "공감소통",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "고객 지향적인 신상품 개발 프로세스에 이용되는 마케팅개념 및 분석 도구들을 이해시키며, 브랜드 자산의 개념, 원천, 관리과정, 전략적 활용 방안들에 관한 이론과 사례를 전달한다.",
    "syllabus_en": "Firms are increasingly becoming aware of the importance of their brand strategies, realizing that the brand one of their most important corporate assets. The brand and its promise is a source of the company’s value to their stakeholders. The effective ma"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS456",
    "교과목명": "금융회계",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS152",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목은 금융기관 (은행, 보험, 증권사)의 회계 및 금융기관과 일반기업이 보유하고 있는 금융상품 (증권, 채권, 파생상품 등) 의 회계와 공시를 다룬다. 금융공학의 발달로 인해 시장에는 새로운 금융상품이 계속적으로 등장하며, 그에 따라 회계 및 공시규정도 꾸준히 변",
    "syllabus_en": "This course covers accounting and disclosure rules for finullcial instruments (equity, fixed income securities and derivatives) and institutions (banking, insurance, broker/dealer firms). Due to a rapid development of finullcial engineering, new finullcial i"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS467",
    "교과목명": "국내경영현장실습I",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 경영대학 학생들을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 본 과목을 통해 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS468",
    "교과목명": "국내경영현장실습II",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목은 경영대학 학생들을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 본 과목을 통해 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS469",
    "교과목명": "국내경영현장실습Ⅲ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 6,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "본 과목은 경영대학 학생들을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 본 과목을 통해 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS470",
    "교과목명": "국제경영현장실습I",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "본 과목은 해외지사 또는 현지법인들 갖고 있는 국내기업의 협조하에 경영대학 학생들을 해외 산업현장에 파견하여 현지업무를 실습하게 함으로써 창조적인 국제경영지도자로서의 자질을 구비하도록 하는 데 궁극적인 목적이 있다. 본 국제경영현장실습은 현지생산 및 영업현",
    "syllabus_en": "This course provides students opportunities to have internship training at the overseas operations of the participating multinational enterprises. Students will work as internship trainees for three weeks while pursing individual research projects which e"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS471",
    "교과목명": "국제경영현장실습II",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 과목은 해외지사 또는 현지법인들 갖고 있는 국내기업의 협조하에 경영대학 학생들을 해외 산업현장에 파견하여 현지업무를 실습하게 함으로써 창조적인 국제경영지도자로서의 자질을 구비하도록 하는 데 궁극적인 목적이 있다. 본 국제경영현장실습은 현지생산 및 영업현",
    "syllabus_en": "This course provides students opportunities to have internship training at the overseas operations of the participating multinational enterprises. Students will work as internship trainees for three weeks while pursing individual research projects which e"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS472",
    "교과목명": "국제경영현장실습Ⅲ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 6,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS475",
    "교과목명": "인터넷마케팅",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": "BUSS205",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "본 과목의 목적은 인터넷을 이용한 마케팅에 관한 이론을 이해하고 실제 응용력을 배양하는 것이다. 따라서 본 과목에서는 인터넷마케팅과 전자상거래에 관한 최신 이론을 강의하고 충분한 실습을 통하여 학생 스스로가 체득할 수 있도록 한다._x000D_\n",
    "syllabus_en": "The objectives of this course are to understand theories of Internet marketing and to cultivate the ability of practical applications in internet-applied business. In order to achieve the objectives, this course offers lectures about both classical and re"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS484",
    "교과목명": "글로벌CEO특강",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "도전적리더",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목은 경영학과 고학년을 대상으로 CEO로서의 자질을 함양하기 위한 것이다. 경영학 전반에 걸친 기초지식을 바탕으로 실무 현장에서의 활용 및 응용을 중심으로 진행한다. CEO들의 특강 및 기업 현장에서의 실습을 통하여 미래 CEO로서의 자질을 함양한다._x000D_\n",
    "syllabus_en": "This course is for senior business majors to nurture ability for future CEO's. The course is designed to have practical experiences based on the integration of the theories of business. A series of CEO lectures and training at firms will be provided._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS488",
    "교과목명": "구매,공급관리",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "기업경영에서는 그동안 생산과 판매에 많은 관심과 연구가 이루어져 왔으나 점차 시장의 변화에 따라 기업 간 경쟁이 치열해지고 글로벌화 되면서 원가경쟁, 품질경영, 서비스경쟁에서 우위를 확보하기 위해서 구매와 조달분야에서 해법을 찾게 되었다. 이와 같이 구매와 조 ",
    "syllabus_en": "This course introduces the importance of the function of purchase and supply management in the company. This course deals with both theory and practice in managing purchase and supply activities._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS490",
    "교과목명": "국내경영현장실습Ⅵ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 6,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "이 과목은 경영대학 학생을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결 능력을 기르고 창",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS491",
    "교과목명": "국내경영현장실습Ⅳ",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "이 과목은 경영대학 학생을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결 능력을 기르고 창",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS492",
    "교과목명": "국내경영현장실습Ⅴ",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "이 과목은 경영대학 학생을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결 능력을 기르고 창",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS493",
    "교과목명": "국제경영현장실습Ⅳ",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 경영대학 학생들을 해외 산업현장에 파견하여 현지 업무를 실습하게 함으로써 창조적인 국제경영지도자가 지녀야 할 자질을 갖추도록 하는 데 궁극적인 목적이 있다. 현지 생산 및 영업현장에서 4~8주간 실습 요원으로 근무함으로써 교과과정에서 배운 경영이론을 ",
    "syllabus_en": "This course provides students opportunities to have internship training at the overseas operations of the participating multinational and local enterprises. Students will work as internship trainees for 4~8 weeks while pursing individual research projects"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS494",
    "교과목명": "국제경영현장실습Ⅴ",
    "학년": 4.0,
    "학기": 1.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 경영대학 학생들을 해외 산업현장에 파견하여 현지 업무를 실습하게 함으로써 창조적인 국제경영지도자가 지녀야 할 자질을 갖추도록 하는 데 궁극적인 목적이 있다. 현지 생산 및 영업현장에서 4~8주간 실습 요원으로 근무함으로써 교과과정에서 배운 경영이론을 ",
    "syllabus_en": "This course provides students opportunities to have internship training at the overseas operations of the participating multinational and local enterprises. Students will work as internship trainees for 4~8 weeks while pursing individual research projects"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS495",
    "교과목명": "국내경영현장실습Ⅶ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 9,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "이 과목은 경영대학 학생을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결 능력을 기르고 창",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS496",
    "교과목명": "국내경영현장실습Ⅷ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 12,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "이 과목은 경영대학 학생을 국내기업 경영현장에 파견하여 학부에서 배운 경영이론을 직접 업무에 적용하여 살아있는 경영지식을 습득할 수 있도록 돕는다. 학생들은 기업의 실제 문제를 연구, 분석하고 이에 대한 종합보고서를 제출하여 창의적인 문제해결 능력을 기르고 창",
    "syllabus_en": "This course provides students with opportunities to apply theoretical business principles into a business context in Korea and gain experiences and insights by working in a real business setting. Throughout the internship, students are required to write a"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS497",
    "교과목명": "국제경영현장실습Ⅵ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 6,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 경영대학 학생들을 해외 산업현장에 파견하여 현지 업무를 실습하게 함으로써 창조적인 국제경영지도자가 지녀야 할 자질을 갖추도록 하는 데 궁극적인 목적이 있다. 현지 생산 및 영업현장에서 실습 요원으로 근무함으로써 교과과정에서 배운 경영이론을 직접 적 ",
    "syllabus_en": "This course provides students opportunities to have internship training at the overseas operations of the participating multinational and local enterprises. Students will work as internship trainees while pursuing individual research projects which examin"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS498",
    "교과목명": "국제경영현장실습Ⅶ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 9,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 경영대학 학생들을 해외 산업현장에 파견하여 현지 업무를 실습하게 함으로써 창조적인 국제경영지도자가 지녀야 할 자질을 갖추도록 하는 데 궁극적인 목적이 있다. 현지 생산 및 영업현장에서 실습 요원으로 근무함으로써 교과과정에서 배운 경영이론을 직접 적 ",
    "syllabus_en": "This course provides students opportunities to have internship training at the overseas operations of the participating multinational and local enterprises. Students will work as internship trainees while pursuing individual research projects which examin"
  },
  {
    "구분": "전공선택",
    "학수번호": "BUSS499",
    "교과목명": "국제경영현장실습Ⅷ",
    "학년": 4.0,
    "학기": 2.0,
    "전공역량": "글로벌",
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 12,
    "시간": 0.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 경영대학 학생들을 해외 산업현장에 파견하여 현지 업무를 실습하게 함으로써 창조적인 국제경영지도자가 지녀야 할 자질을 갖추도록 하는 데 궁극적인 목적이 있다. 현지 생산 및 영업현장에서 실습 요원으로 근무함으로써 교과과정에서 배운 경영이론을 직접 적 ",
    "syllabus_en": "This course provides students opportunities to have internship training at the overseas operations of the participating multinational and local enterprises. Students will work as internship trainees while pursuing individual research projects which examin"
  },
  {
    "구분": "전공인정",
    "학수번호": "PAPP151",
    "교과목명": "행정학원론",
    "학년": null,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "행정학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "학문분야로서의 행정학에 대한 이해에 초점을 두고 행정학의 발달, 행정학의 기본 개념과 이론 등을 소개한다. ",
    "syllabus_en": "This course allows students to develop an understanding of public administration as a field of academic study and an area of professional practice. "
  },
  {
    "구분": "전공인정",
    "학수번호": "JURA204",
    "교과목명": "회사법",
    "학년": null,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "법학전문대학원",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "회사기업, 특히 주식회사에 관하여 설립에서부터 해산·청산에 이르기까지의 법적 제문제점을 해석학적인 측면은 물론, 비교법적·입법론적으로 고찰한다",
    "syllabus_en": "Study of legal issues touching on various companies with particular emphasis on joint-stock company's incorporation, operation and liquidation. Study of relevant statutory provisions as well as comparative analysis and possible areas of law reform."
  },
  {
    "구분": "전공인정",
    "학수번호": "JURA251",
    "교과목명": "행정법",
    "학년": null,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "법학전문대학원",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "재량과 기속의 구별, 법률유보론, 주관적 공권론 등 행정법의 기초개념을 바탕으로 행정행위론, 행정입법론, 행정계획, 공법상 계약, 행정상 사실행위 등 행정작용의 개별형식들을 중심으로 행정법이론을 체계화하고, 개별 행정법영역의 주요 법적 문제를 공무원법, 지방자치",
    "syllabus_en": "This course explores legal aspects of administrative law related to dispute on protection of freedom and rights of citizens against public n power of public administration."
  },
  {
    "구분": "전공인정",
    "학수번호": "JURA301",
    "교과목명": "상법",
    "학년": null,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "법학전문대학원",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "상법의 개념, 역사 및 그 기반을 이루는 경제생활과 이념을 연구하고 기업주체인 상인과 기업의 동태를 규율하는 상행위법에 관한 고찰을 한다. 또한 현대 상거래에서 빼놓을 수 없는 유가증권인 어음·수표에 관하여 그 기초이론 및 판례를 통하여 공부한다.",
    "syllabus_en": "The course aims to study the history, basic concepts and economical basis of commercial transactions. It also provides an exposition of legal rules applicable to merchants and companies as well as negotiable instruments such as promissory notes and cheque"
  },
  {
    "구분": "전공인정",
    "학수번호": "ENGL121",
    "교과목명": "기업영어실습",
    "학년": null,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 1,
    "시간": 1.5,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "영어영문학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "어학실습실에서 읽고, 듣고, 말하기를 반복함으로써 학생들의 실용영어실력을 향상시키는 데 목적이 있다. ",
    "syllabus_en": "This practical course focuses on the English used in business and professional settings. Students will be exposed to common business situations, communicative transactions, and other forms through listening and speaking. Students will also learn and use b"
  },
  {
    "구분": "전공인정",
    "학수번호": "IFLS309",
    "교과목명": "비즈니스영어",
    "학년": null,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "국제어학원",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공인정",
    "학수번호": "ECON201",
    "교과목명": "미시경제이론",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": null,
    "필수선수": "ECON151|ECON171",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경제학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "세계와 한국경제를 이수한 학생들을 대상으로 시장경제에 관한 이론과 정책을 체계적으로 다룬다. 학기초에는 실증경제학적 방법론을 제시하고 시장경제체제에 관한 개관을 한 다음 개별경제 단위의 행동과 상호작용에 대한 미시적 분석을 한다. 또한 불완전 정보의 문제, 시",
    "syllabus_en": "This is for students who completed an introductory course. Principles of consumers' and producers' decision making is introduced and applied to study the market mechanism. We also study the issues like incomplete information, market failure, the role of g"
  },
  {
    "구분": "전공인정",
    "학수번호": "ECON202",
    "교과목명": "거시경제이론",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": null,
    "필수선수": "ECON151|ECON172|ISC203A|ISC203B",
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경제학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "국가 경제에서 국민 소득, 고용량, 이자율, 환율, 인플레이션, 국제수지 등이 어떠한 원리로 결정되고 상호간에는 어떠한 관련이 있는 지를 연구한다. 금융 이론, 경기 변동, 경제성장, 개방 경제 거시의 기초 이론을 강의하며 거시 경제 정책의 효과를 중심으로 최근의 한국",
    "syllabus_en": "In Macroeconomics, we explore theories and evidence on economic growth and fluctuations. Topics that are covered include: Determination of GDP, investment, consumption, unemployment. Analysis of interest rate, wage rate, and inflation as well as  roles of"
  },
  {
    "구분": "전공인정",
    "학수번호": "ECON333",
    "교과목명": "재정학",
    "학년": 2.0,
    "학기": 1.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": "ECON201",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경제학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "정부의 경제활동에 관한 과목으로서 세출입, 시장실패와 외부성, 공공재와 같은 정부시장개입의 근거를 비롯하여 사회후생함수와 소득분배 그리고 정부 실패에 대한 이론을 기본 내용으로 한다. _x000D_\n",
    "syllabus_en": "Discussion of the economics of taxation, public expenditures, fiscal policy and budgeting.  _x000D_\n"
  },
  {
    "구분": "전공인정",
    "학수번호": "ECON334",
    "교과목명": "조세론",
    "학년": 2.0,
    "학기": 2.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": "ECON201",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경제학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "재정학 중 조세 부문을 집중적으로 다루는 과목으로서 정부수입, 조세제도 및 정책, 조세의 전가와 효과 및 각종 조세의 각론을 그 내용으로 한다. _x000D_\n",
    "syllabus_en": "Continuation of public finullce with emphasis on the application of economic theory to public policy and taxation._x000D_\n"
  },
  {
    "구분": "전공인정",
    "학수번호": "ECON335",
    "교과목명": "국제금융론",
    "학년": 3.0,
    "학기": 2.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": "ECON201|ECON202",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경제학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "국제경제학의 화폐이론부문으로서 외환론, 국제통화론, 국제수지 및 그 조정과 국제자본이동론이 주된 내용이다. 국제금융의 최신의 움직임에 대해서도 분석을 행한다._x000D_\n",
    "syllabus_en": "The course analyzes the monetary side of the international economics, attempting to provide an up-to-date and understandable analytical framework for international monetary system, payments, and capital mobility etc._x000D_\n"
  },
  {
    "구분": "전공인정",
    "학수번호": "EGRN322",
    "교과목명": "창업과경영을위한공학기술경향",
    "학년": null,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "공과대학",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "공학을 전공하지 않는 예비 경영자를 대상으로 설계된 강좌로 에너지, 자동차, 반도체, 정보통신, 석유화학, 철강, 건설 등 주요 산업의 현황, 국제 경쟁력, 제조 공정, 핵심 기술 등에 관한 내용을 다루고 로봇, 바이오, 환경, 태양광 등 미래 산업에 대하여 소개한다.",
    "syllabus_en": "This course is designed for students in business school. _x000D_\nIn this course, professors in the college of engineering will introduce the current status of worldwide industries (including manufacturing, energy, automobile, semiconductor, IT, petrochemistry, "
  },
  {
    "구분": "학문의기초",
    "학수번호": "BUSS152",
    "교과목명": "회계학원리",
    "학년": 1.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기업이 외부 이해관계자들에게 제공하는 재무정보의 산출과정에 대한 기본적인 내용을 다룬다._x000D_\n",
    "syllabus_en": "This course deals with external finullcial reporting for business entities, including income measurement and determination of finullcial position._x000D_\n"
  },
  {
    "구분": "학문의기초",
    "학수번호": "BUSS154",
    "교과목명": "경영통계",
    "학년": 1.0,
    "학기": 2.0,
    "전공역량": "창의적문제해결",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "통계학의 기본개념을 소개하고, 이 개념들이 합리적인 기업의사결정을 하는데 응용될 수 있는지를 보여준다. 다루어질 주요 주제는 기초확률이론과 응용, 추정, 가설검정, 상관분석, 회기분석등이다._x000D_\n",
    "syllabus_en": "This course will focus on a variety of statistical techniques which can be applied to all types of business problems. Topics include descriptive statistics, probability related concepts, estimates, hypothesis testing, analysis of variance (ANOVA), correla"
  },
  {
    "구분": "학문의기초",
    "학수번호": "BUSS164",
    "교과목명": "경영과사회",
    "학년": 1.0,
    "학기": 1.0,
    "전공역량": "사회적책임",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 과목에서는 경영학에 대한 철학적 고민, 리더십에 대한 고찰, 경영 윤리에 대한 이해, 그리고 기업의 존재 이유에 대한 논쟁들을 바탕으로 기업과 사회의 관계를 조망하고 이를 바탕으로 기업경영에서 이윤만이 아니라 사회적 가치를 함께 추구하는 것이 왜 중요한지, 그 ",
    "syllabus_en": "This course provides the incoming freshmen class with fundamental theories of business, along with introduction to various areas of business. The purpose of this course is to help students become business leaders that are true to the mission of KUBS, “Bu"
  },
  {
    "구분": "학문의기초",
    "학수번호": "BUSS166",
    "교과목명": "통합적사고와경영학입문",
    "학년": 1.0,
    "학기": 2.0,
    "전공역량": "융합적사고",
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": "경영학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 교과는 Flipped PBL (problem-based learning) class로 한 학기 동안 경영학 분야의 essential 한 이슈 및 시의성있는 이슈를 담고 있는 실제적 문제  5개를 다룰 예정입니다. 하나의 문제 상황에 대해 동일한 입장에 있는 사람들 간의 토의, 서로 다른 관점을 지닌 사람 ",
    "syllabus_en": "In this Flipped PBL (problem-based learning) course, total of 5 authentic organizational problem containing essential and timely issues in the field of business studies will be addressed. Integrated thinking, problem-solving skills, and communication skil"
  },
  {
    "구분": "교양필수",
    "학수번호": "GELI005",
    "교과목명": "학문세계의탐구 I",
    "학년": 1.0,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 교과목은 학습자 주도형 토론 중심 수업으로 다양한 학문 세계를 탐구하며 비판적·창의적·융합적 사고 능력을 배양하는 것을 목적으로 한다. 학문세계의탐구Ⅰ은 토론과 협업을 통해 인간을 이해하고 가치를 탐구하는 교양필수 과목이다.",
    "syllabus_en": "The course explores the academic world across various disciplines and aims to cultivate critical, creative, and convergent thinking competencies with learner-driven, discussion-based instruction._x000D_\nExploration of the Academic World I is a General Education"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEWR002",
    "교과목명": "글쓰기",
    "학년": 1.0,
    "학기": 1.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "<글쓰기>는 ‘글쓰기의 기초’를 훈련하는 과목으로, 대학 수학 능력의 기본이 되는 사고력과 자기 표현력을 기르는 것을 목표로 한다. 학업 과정에서?요구되는 글쓰기의 특성을 이해하고, 이를 바탕으로 글쓰기를 체계적으로 훈련한다. <글쓰기>는 전교 공통의 과정으로 1학",
    "syllabus_en": "College Writing is an introductory writing course intended to advance students’ critical thinking skills and self-expression?basic skills required for college studies. In this course, students will gain a better understanding of the specific techniques n"
  },
  {
    "구분": "교양필수",
    "학수번호": "IFLS800",
    "교과목명": "Academic English I",
    "학년": 1.0,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 2,
    "시간": 2.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 수업은 학생들의 학술관련 영어능력 및 의사소통능력을 향상시키는 데 목적이 있다. 학업 관련 모든 영역에서 활용 가능한 전반적인 영어능력 향상을 위해 학술 내용을 바탕으로 수업을 진행하며, 학생들이 실제 상황에서 구사할 수 있는 영어능력 향상에 초점을 맞춘 다 ",
    "syllabus_en": "The objective of this course is to enhance students’ communicative competence in English. Academic content is covered to improve overall proficiency in all areas of English communication as it relates to academic studies. Basic language skills are develo"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS007",
    "교과목명": "[진로창업]1학년세미나 I",
    "학년": 1.0,
    "학기": 1.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 1.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅰ은 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 대학생활에 적응하고 대학생으로서 진로(연구, 취업, 창업)를 설계할 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여 등으로 ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, which provides fitting in university and career explorations. It includes academic advising, counseling with professors, seminars or special online lectures by KU fa"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS008",
    "교과목명": "[진로창업]1학년세미나 II",
    "학년": 1.0,
    "학기": 2.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 1.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅱ는 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 학교에 대한 소속감을 강화하고 창직 및 창업 등의 진로 방향성을 고민해볼 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여  ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, offering mentorship and guidance in career directions such as entrepreneurship. It includes academic advising, counseling with professors, seminars, and special onli"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT002",
    "교과목명": "[진로창업]SW프로그래밍의기초",
    "학년": 1.0,
    "학기": 1.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목은 컴퓨팅 사고와 프로그래밍의 기본 원리를 소개하는 과정이다. 소프트웨어의 근간이 되는 프로그래밍 언어에 대한 체계적인 이해를 바탕으로, Python 언어를 통해 기본 문법, 데이터 구조 및 제어 구조의 핵심 개념을 학습한다. 학생들은 이 과목을 통해 프로그래밍",
    "syllabus_en": "This course introduces the fundamental principles of computing thinking and programming. Building on a systematic understanding of the programming languages that form the foundation of software, students will learn essential concepts of syntax, data struc"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT003",
    "교과목명": "[진로창업]데이터과학과인공지능",
    "학년": 1.0,
    "학기": 2.0,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "_x000D_\n이 과목은 데이터를 다루고 분석할 수 있는 역량과 인공지능 기술을 이해하고 자기의 일에 활용할 수 있는 방법을 학습하는 과정이다. 기초적인 데이터과학 및 인공지능 핵심 개념을 학습하고, 각 계열별 특성에 맞는 데이터를 활용한 실습을 통해 실제 데이터를 다루고 인",
    "syllabus_en": "This course aims to develop the ability to handle and analyze data, understand artificial intelligence technologies, and learn how to apply them in one's field of work. It covers fundamental concepts of data science and artificial intelligence, and throug"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEBT001",
    "교과목명": "[진로창업]생명과학의세계",
    "학년": 1.0,
    "학기": null,
    "전공역량": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3.0,
    "대학": "경영대학",
    "학과": "경영학과",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "생명과학의 세계는 생명공학의 기초 지식과 생명현상을 이용한 융복합 기술의 다양한 사례를 살펴봄으로써 변화하는 미래 환경을 대비하고 선도할 수 있는 융합적 사고를 함양하는 강좌이다.",
    "syllabus_en": "This is a course that fosters convergent thinking to prepare for and lead the changing future environment by examining basic knowledge of biotechnology and various examples of convergence technologies using life phenomena."
  }
]
