[
  {
    "구분": "전공필수",
    "학수번호": "DISS114",
    "교과목명": "국제통상원론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "국제무역 발생의 원인과 경제적 효과 그리고 무역패턴을 설명하는 이론들을 소개하고 통상정책의 장단점을 분석함으로써 국제 통상 환경의 이해를 높이는데 교육목표를 둔다.",
    "syllabus_en": "This course is designed to help students understand the economic, social and political forces involved in international trade. The course focuses on economic impact of international trades, theories of trade patterns, and merits and demerits of different "
  },
  {
    "구분": "전공필수",
    "학수번호": "DISS122",
    "교과목명": "국제관계원론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "국제정치학의 형성배경과 발전과정을 포괄적으로 논의함으로써 국제관계를 이해하려는 다양한 지적 노력을 조사함과 동시에 현 국제 관계의 변화 방향을 고찰한다.",
    "syllabus_en": "This is an introductory course that is divided into two parts. The first part covers the historical background of the theory of international relations, with special emphasis on the traditional approaches to the study of power, ideology, state interests, "
  },
  {
    "구분": "전공필수",
    "학수번호": "DISS281",
    "교과목명": "국제개발개론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 강의는 국제개발과 관련된 원론과목으로 국제개발의 정의 및 원천 등을 다루는 주요 이론을 학습한다. 또한 개발 사례 및 최근 개발 관련 이슈를 이해하기 위해 경제역사를 학습하며, 개발 관련 이슈를 조사하기 위한 심도있는 사례 연구를 통해 이 분야에 대한 학생의 이",
    "syllabus_en": "Why does development occur in one place but not another? This introductory course fosters the cognitive tools and concrete knowledge needed to consider an answer to this question. The course structures readings from multiple disciplines into three modules"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS112",
    "교과목명": "조사방법론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "표본조사와 실험 등 사회과학을 연구하는 실증적 방법, 이와 관련된 측정문제, 자료의 기술방법, 여러 변수간의 관계에 대한 탐구, 확률의 개념 및 통계적 추론을 다룬다.",
    "syllabus_en": "This course focuses on applied data analysis and statistical decision-making. There are two simple reasons why statistics is so important for decision makers: (1) most interesting problems in management, economic, and public policy involve some degree of "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS115",
    "교과목명": "경제학입문",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "경제학의 기본 논리와 시장, 시장에서의 수요와 공급, 이를 통한 자원 배분, 경쟁과 효율성, 정부의 역할 등을 포함하는 미시 및 거시 기본 경제원리들에 관한 입문과정이다.",
    "syllabus_en": "This course focuses on economic and market principles, supply and demand, resource allocation through market, competition and efficiency, and the role of government. The course will show how these economic principles and forces are played out in the econo"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS123",
    "교과목명": "정치학입문",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "정치학의 기본 개념을 소개하는 입문과정이다.",
    "syllabus_en": "This course will introduce students to the key concepts and ideas of politics. It offers an introduction to all four major areas of study in the discipline: Political Theory, Korean Politics, Comparative Politics, and International Politics. More specific"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS140",
    "교과목명": "세계화의이해",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "세계화의 기본개념을 정치사상사적 측면, 국제정치경제적 측면, 문화론적 측면에서 논의하고, 세계화가 국가, 지역 그리고 범세계적 차원에서 어떠한 영향을 가져올 것인지를 분석한다.",
    "syllabus_en": "What is globalization? What are the political, economic, and social-cultural consequences and dimensions of globalization? What problems and challenges does globalization bring about? What kinds of institutional reforms are needed to cope with these new p"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS210",
    "교과목명": "세계화와한국경제",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "한국경제의 구조, 발전과정과 문제점, 경제정책, 대외교류 현황 및 기타 경제문제의 분석을 주된 내용으로 하고 장래에 대한 전망을 논의한다.",
    "syllabus_en": "The purpose of this course is to survey a brief review of the workings of the Korean economy in the past and to understand the structure and trends of the present Korean economy. And explore a variety of issues relevant to its development. Before the fina"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS212",
    "교과목명": "국제통상정책의이론과실제",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "무역, 투자, 서비스 교역에 관한 관세, 비관세장벽, 내부 유통장벽 등 WTO 체제 하에서의 통상정책이 갖는 다면적 특성, 효과성 등을 살펴보고, 미국, EU, 일본, 중국 등 주요국의 통상정책의 내용을 검토한다.",
    "syllabus_en": "This course focuses on the principles and tools of trade theory and policy. The course also examines various issues related to trade, investment, taxation on service-related trade, and trade protectionism. Also discussed are the efficiency and impact of t"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS215",
    "교과목명": "금융시장및금융기관",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "금융시장에서 금융거래관계를 분석하고 이의 국민경제와의 상관관계를 심도깊게 논의하며, 금융기관의 역할에 대해 중점적으로 논의할 것임.",
    "syllabus_en": "This course focuses on current trends and issues in banking and finullce. Students are expected to study monetary economic activities, capital flows, finullcial institutions, and etc."
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS221",
    "교과목명": "국제협상론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "글로벌소통",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "국제화시대에 들어서면서 기업 또는 정부간 양자 및 다자간 국제협상의 중요성은 날로 커져 가고 있다. 이에 관련된 최신 이론과 사례 등을 체계적으로 연구 분석하여 국제 협상능력을 배양한다.",
    "syllabus_en": "Successful foreign investment requires an understanding of how international negotiations are conducted. The first part of the course revolves around the concept of negotiation barriers. The class will seek to focus on the importance of negotiation and th"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS222",
    "교과목명": "전쟁과평화",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "국제정치의 가장 중요한 두 주제인 전쟁과 평화의 문제를 다룬다. 전쟁과 평화의 원인에 대한 다양한 이론적 논의들이 다루어질 것이고 또한 이에 이르는 다양한 접근방법이 체계적으로 논의된다.",
    "syllabus_en": "This course examines the causes of war and the means of achieving peaceful solution to conflict. We will examine the differences between negative and positive peace as well as the role of human rights, poverty, and the principle of nonviolence in war and "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS223",
    "교과목명": "국제기구론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "사회참여및사회공헌",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제안보와 국제개발협력과 관련된 국제기구들을 소개한다. 특히 이들 기구들의 설립 유래와 목적 및 기능들에 관해 연구평가 한다.",
    "syllabus_en": "The course begins with a foundational overview of the origins, development, finullcing, structure and role of the United Nations and other international organizations such as the World Trade Organization (WTO), International Bank for Reconstruction and Dev"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS230",
    "교과목명": "국제경영의이해",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "글로벌 경영의 기본 메커니즘을 이해하고 국제경영에 관한 기본적인 개념을 이해할 수 있도록 한다.",
    "syllabus_en": "The goal purpose of this course is to help the students achieve an understanding of the international business environment in which Korean companies are facing business competes and managers manage. It also aims to help the students develop skills in anal"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS232",
    "교과목명": "국제경영윤리",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "글로벌 경영환경에서 통용되는 윤리적 규범과 원칙을 학습하고, 회계정보, 노사관계, 세일즈 및 마케팅, 생산활동, 지식재산권 등과 관련된 기업 및 경영인의 윤리를 글로벌 경영의 시각에서 고찰한다.",
    "syllabus_en": "This course explores ethical rules and principles within a commercial context, the various moral or ethical problems that can arise in a business setting and any special duties or obligations that apply to persons who are engaged in business from a global"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS241",
    "교과목명": "현대한국",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "한국의 산업화 과정에서 나타나는 가족관계, 종교, 정치, 경제, 사회변화 등을 사회학적 관점에서 살펴보고 이를 통해 현대 한국사회를 보다 정확하게 이해할 수 있는 기회를 제공한다.",
    "syllabus_en": "This course is designed to introduce students to the main aspects of contemporary Korean society, including those pertaining to the family, industrialization, gender, religion, and political system. The course will specifically focus on topics and issues "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS242",
    "교과목명": "북미지역입문",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "북미지역의 문화, 정치, 교육, 종교, 경제, 사회변화, 사회문제 등 사회 환경을 살펴봄으로써 학생들에게 북미지역에 관한 기본적인 지식을 습득케 하는 데 목적을 둔다.",
    "syllabus_en": "This course is designed to enhance students understanding of North American society and culture. In-depth examinations of the different sectors of contemporary American society, including politics, economy, race relations, and gender and class inequality,"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS243",
    "교과목명": "동아시아지역입문",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "글로벌소통",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "동아시아의 정치적인 변화, 경제개발, 그리고 사회·문화적인 측면에 관하여 논의한다. 특히 현대 정치 및 경제 분야를 중심으로 동아시아의 사회와 문화적 환경이 현대사회에 미치는 영향에 대해 논의한다.",
    "syllabus_en": "The purpose of this course is to familiarize students with key patterns in political change, economic development, and socio-cultural imagination in East Asia. The course briefly reviews the modern history of East Asia before moving on to different perspe"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS244",
    "교과목명": "유럽지역입문",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "유럽지역의 사회와 문화, 투자환경, 시장구조, 정치현황 등을 살펴봄으로써 유럽지역에 관한 기본적인 지식을 습득하는 데 교육목적을 둔다.",
    "syllabus_en": "The value of studying Europe arises not only from its history but also its dynamism and prospects for change. Following the end of the Cold War and the expansion of the European Union, new possibilities have emerged for cooperation and unity as well as fo"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS251",
    "교과목명": "국제법",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "국제법에 관한 개론과 분석을 제공한다. 또한 국제법이 국제사회에서 어떤 효력과 영향력을 지니고 있는지에 관하여 알아본다.",
    "syllabus_en": "This course provides an introduction to the basic principles of public international law and how it regulates relations between states, international organizations, non-governmental organizations (NGOs) and individuals. Also, the course seeks to impart a "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS252",
    "교과목명": "국제경제법",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "관세 및 무역에 관한 일반협정(GATT)에서 세계무역기구(WTO)로의 변천과정에서 나타나는 통상관계의 변화에 관한 국제경제관계를 규율하는 법제도의 변화와 그 목적에 관하여 연구한다.",
    "syllabus_en": "This course provides a comprehensive introduction to the legal framework that governs our international trading system. The class will focus on the General Agreement on Tax and Tariffs (GATT)/World Trade Organization (WTO) framework in terms of free trade"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS256",
    "교과목명": "국제개발의동역학",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "정책입안자들과 투자자들에게 미치는 경제성장의 중요성을 전제하고 이 과목은 경제성장과 개발에 관한 이론과 실증적 증거들을 소개합니다. ",
    "syllabus_en": "Given the importance of economic growth for policy makers, investors, and ultimately the people, this course provides an introduction to both theory and empirical evidence on economic growth and development. We will discuss basic concepts necessary to und"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS261",
    "교과목명": "기술.정보와사회",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "정보와 지식 그리고 기술의 발달이 사회경제적 발전을 주도하는 역할을 담당하게 된 배경과 원인을 규명해 보고, 사회구조 및 변동에 미치는 영향에 대해 고찰한다.",
    "syllabus_en": "This course will consider how new information technologies affect liberty, democracy, and the production of democratic culture. Topics will include mass media competition, the proliferation of new forms of speech on the Internet, and the use of new inform"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS282",
    "교과목명": "한국외교콜로퀴움",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "본 과목은 고려대 체재 중인 외국인 유학생을 주요 대상으로 한다. 이들에게 한국의 외교정책을 지역 및 분야별로  소개함으로써,  한국에 대한 이해도를 높이는 것을 목적으로 한다. ",
    "syllabus_en": "This class is designed to conduct public diplomacy to foreign undergraduate students by offering a series of colloquiums on Korean foreign policies covering from foreign affairs to political economy and cultural diplomacy. "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS283",
    "교과목명": "국제학데이터사이언스",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제경제, 국제개발협력, 국제관계 분야에서의 다양한 데이터 분석 방법론을 학습한다. 조사방법론의 통계 분석 지식과 R, Stata, 파이썬과 같은 통계분석 툴을 국제학 전반의 주제로 데이터 분석에 활용한다. 또한 국제경제, 국제개발협력, 국제관계에서 다루는 주요 주제에",
    "syllabus_en": "1. This course studies various data analysis methodologies in the field of international economics, international development&cooperation, and international relations. Students will perform various statistical analyses based on the statistical knowledge a"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS284",
    "교과목명": "국제학주요쟁점데이터분석",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "이 수업에서는 국제학의 실증분석 연구에서 활용되고 있는 기초적인 데이터 분석 방법론을 다룹니다. 특히, 최근 국제경제, 국제개발, 국제협력, 국제안보 등 국제학 분야에서 주요한 쟁점으로 논의되고 이슈들을 실증분석을 평가하고 이에 사용되는 방법론을 통계패키지(R, ",
    "syllabus_en": "This course introduces the basic data analysis methodologies used in empirical research in international studies. In particular, students will learn practical data analysis skills through the use of statistical packages such as R, Stata, and Python to eva"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS310",
    "교과목명": "동아시아경제론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "동아시아경제의 발전과정을 이해하고, 현안을 논의하며, 앞으로 동아시아 경제가 나아갈 방향에 대해 진단한다.",
    "syllabus_en": "The objective of this course is to equip students with theoretical and conceptual tools necessary to analyze and understand the political economy of East Asia. It will focus on economic growth, the Asian economic crisis, regional cooperation, democratizat"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS311",
    "교과목명": "국제금융:이론및실제",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제경제학의 화폐이론부문으로서 환율결정, 국제수지 및 그 조정과 국제자본이동에 관한 이론과 현실적 문제점 등을 논의한다.",
    "syllabus_en": "This course is to analyze the key international finullcial theories and markets. The scope of inquiry spans two broad areas: first, the economic determinullts of spot exchange rate, the adjustments of the balance of payments, and foreign exchange market; an"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS312",
    "교과목명": "세계화와경제개발",
    "학점": null,
    "시간": null,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "균형적 경제발전을 위하여 저개발국의 경제개발에 관한 이론과 현상을 선진국과 비교. 검토하여 저개발의 특성 및 개발전략, 경제협력, 개발정책, 해외무역과 경제발전 등의 분석과 문제를 논의한다.",
    "syllabus_en": "With the rapid growth of globalization, the difference in the economic performance of underdeveloped, developing and developed countries is getting larger. This course compares the economic characteristics of underdeveloped nations with those of economica"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS314",
    "교과목명": "국제경제협력론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "사회참여및사회공헌",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "경제통합의 역사적 배경과 동향을 분석하고, 유럽연합(EU) 및 북미자유무역지역(NAFTA) 등 1990년대 이후 활발하게 전개되는 지역적 경제통합 움직임을 이론적으로 연구한다.",
    "syllabus_en": "This course examines the history and characteristics of various regional institutions of international economic cooperation, including the EU, NAFTA, ASEAN, and APEC. Also discussed are the current situation, problems, impact, and perspectives of each reg"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS319",
    "교과목명": "국제금융특강",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "국제금융시장에서 발견되는 현상을 분석하고 그 제도적 변화를 연구하며, 특히 국제통화제도, 외환시장, 환율변동, 국제투자분석 등을 구체적으로 논의한다.",
    "syllabus_en": "This course explores current issues related event to the global finullcial system, including international commercial and investment banking, and international investments. We focus on the underlying conditions and fundamental trends in various sectors of "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS320",
    "교과목명": "외교사",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제외교관계를 역사적으로 검토함으로써 국제정치역학의 변화와 이를 지배하는 주요한 요인들을 논의한다.",
    "syllabus_en": "This course aims to examine the evolution of international relations by scrutinizing significant historical events. An emphasis will be placed on explaining the causes and resolutions of major events and looking for the dominullt factors in international r"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS322",
    "교과목명": "국제정치경제",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "경제적 번영, 안보, 환경 및 빈곤과 같은 오늘날 국제적으로 활발히 논의되고 있는 이슈와 국제관계현상을 체계적이고 종합적으로 논의한다.",
    "syllabus_en": "The first half of this course takes an historical as well as analytical approach to international political economy, particularly focusing on the reciprocal and dynamic interaction in international relations of the pursuit of wealth and the pursuit of pow"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS325",
    "교과목명": "국제관계특강I",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제정치 이론 및 현안과 관련된 주요 주제를 선정하여 논의한다.",
    "syllabus_en": "Current and controversial issues in international relations are selected for in-depth analysis."
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS328",
    "교과목명": "국제관계특강II",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "국제정치 이론 및 현안과 관련된 주요 주제를 선정하여 논의한다.",
    "syllabus_en": "Current and controversial issues in international relations are selected for in-depth analysis."
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS333",
    "교과목명": "미국경제론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "한국의 가장 중요한 수출시장이며 자본과 기술협력 대상지역인 북미의 경제와 산업 동향, 경제정책, 통상제도 그리고 한국과의 통상관계 및 통상현안 과제를 학습한다. 특히 세계경제와 국제통상질서의 흐름을 주도하는 미국의 경기동향과 대외 통상정책에 초점을 둔다.",
    "syllabus_en": "Given the importance of the U.S. economy to the performance of the world economy, this course explores the economic foundation of the U.S. economy, including how it is working, what challenges the U.S. economy is facing, and what policies the U.S. Adminis"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS337",
    "교과목명": "NGO와국제거버넌스",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "국가와 시민사회 간의 상호관계를 고찰하고 시민사회 및 정치, 경제에 대한 국가개입 등을 논의하며, 시민사회가 정치적 이해관계를 표출하고 조직화하는 문제 등을 논의한다.",
    "syllabus_en": "The end of the Cold War and the evolution of information and communication technology have brought about a redistribution of power among states, markets and civil society. Today national governments are gradually sharing powers with business, internationa"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS338",
    "교과목명": "세계화와인권",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "인류가 추구해온 보편적 가치와 규범으로서의 인권의 개념을 고찰한 뒤, 인권이 국제 사회에서 민주주의의 실현에 어떤 함의를 갖고 있는가를 논의한다.",
    "syllabus_en": "This course surveys international human rights norms and procedures, including detailed examination of global, regional, and national institutions to protect human rights. The course also examines key contemporary concepts of human rights and the mechanis"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS357",
    "교과목명": "국제금융:시장및기관",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제금융의 이론과 시장에 관하여 분석한다. 현물환율의 경제적 결정요인, 국제수지 조정, 외환시장, 국제 포트폴리오와 위험관리 같은 파생물 등을 다룬다.",
    "syllabus_en": "This course is to analyze the key international finullcial theories and markets. The scope of inquiry spans two broad areas: first, the economic determinullts of spot exchange rate, the adjustments of the balance of payments, and foreign exchange market; an"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS358",
    "교과목명": "전후일본과동아시아",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "원폭, 항복, 그리고 점령으로 이어지는 일본의 제2차 세계대전 후 사건들을 소개한다. 이러한 역사적 사건들이 전후 일본의 재건에 어떤 영향과 유산을 남겼는가를 고찰한다. 이어서 경제재건의 정치경제, 국제관계, 그리고 사회적비용을 고찰한다. ",
    "syllabus_en": "The course will explore the legacy of wartime and immediate postwar experiences upon the postwar reconstruction by examining the impacts of atomic bombs, surrender, and the US's occupation of Japan. Then it will probe into the political economy of postwar"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS362",
    "교과목명": "개발도상국의경제지리학",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "사회참여및사회공헌",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 강의는 개발도상국 경제현상의 분포, 경제행위의 공간적 구조 등을 탐구한다. 다양한 연구방법을 이용한 경제지리학적 분석을 통해 개발도상국의 산업 입지, 집적경제, 운송, 국제통상, 개발, 세계화 등을 이해한다. ",
    "syllabus_en": "This course will study the location, distribution, and spatial organization of economic activities in developing countries. Given the variety of approaches, economic geography will take to many different subject matters, including the location of industri"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS363",
    "교과목명": "글로벌빈곤",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "빈곤은 단순하면서도 복잡한 용어이다. 일반적으로 빈곤은 물질적 또는 비물질적 소유와 관련된 '가지지 못한' 또는 '황폐'의 절대적 또는 상대적 개념이다. 그러나 글로벌 측면에서의 빈곤은 '다른 세계'의 가치 또는 빈곤의 개념화 등으로 단순화 될 수 없다. 본 강의에서 ",
    "syllabus_en": "Poverty is both a very simple and an exceedingly complex term. Generally when we discuss poverty, we could be referring to an absolute or a relative notion of \"not having\" or a \"deprivation\" of a physical and/or non-physical possession. In examining pover"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS364",
    "교과목명": "디지털통상",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 수업에서는 정보통신 등 디지털 기술의 발전이 상품, 서비스, 데이터의 국경을 초월한 이동을 불러오며 국제 무역 환경을 어떻게 근본적으로 변화시켰는지 소개한다. 또한 최근의 디지털 무역 발전이 불러온 개인정보 보호 및 사이버 보안 문제와 같은 새로운 글로벌 무역",
    "syllabus_en": "This class introduces how the development of digital technologies has fundamentally changed the international trade environment by bringing about trans-boundary movement of goods, services, and data. Students will study new global trade risks such as priv"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS365",
    "교과목명": "국제학연구고급데이터분석",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "이 수업에서는 국가 간 상품과 중간재 교역, 노동자의 국가 간 이동, 데이터의 국가 간 이동 등 최근 국제통상 분야에서 부각하고 있는 주요 이슈들을 데이터 분석 방법론과 함께 학습한다. 특히, 경제협력 분야의 자유무역협정, 관세동맹, 경제동맹, 경제 제재와 경제개발  ",
    "syllabus_en": "In this cource, major issues that are emerging in international commerce field such as trade of goods and intermediate goods among countries, movement of workers between countries, and movement of data between countries are studied using advanced data ana"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS412",
    "교과목명": "국제통상특강ll",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "국제통상 이론 및 현안과 관련된 주요 주제를 선정하여 논의한다.",
    "syllabus_en": "This course examines current issues and concerns in international commerce, which could include issues pertaining to E-commerce, the World Trade Organization, and international investment."
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS413",
    "교과목명": "유럽경제론",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "EU 통합의 이론과 사례를 검토한 후, EU 경제의 제 측면을 깊이 있게 연구, 분석한다. 특히 유로(Euro)화 도입 이후 유럽과 세계경제에 어떠한 변화가 초래되고 있는가, 한국 경제 및 기업의 대응전략은 무엇인가를 집중적으로 조명한다.",
    "syllabus_en": "This course is intended to provide students with basic macro-economic knowledge about European and world economy and to examine the historic development and transformation of the European economies. A particular emphasis is put on clarifying the instituti"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS421",
    "교과목명": "북미국제관계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "미국 외교 정책의 형성, 이행 그리고 주요 쟁점들에 관하여 논의한다. 세계 2차대전 후 냉전시대에서의 미국의 외교정책을 중점으로 미국 외교정책의 변화에 관하여 여러 가지 관점에서 접근하게 될 것이다.",
    "syllabus_en": "This course is designed to examine the formulation, implementation and major issues of American foreign policy. A historical analysis of various aspects of American foreign policy is provided, with a particular emphasis on important issues and events in t"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS423",
    "교과목명": "동아시아국제관계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "동아시아 지역의 안보, 정치, 경제, 사회적 특성 및 각국 간의 역학관계를 비교, 분석한다. 특히 동아시아 지역에서의 경제협력 강화, 중국의 빠른 경제발전, 한·중·일 사이의 이해관계에 초점을 둔다.",
    "syllabus_en": "Recent historical and contemporary interstate relations in East Asia as well as the place of East Asia in world affairs are examined in this course. In focus are the interests and polices of East Asian countries, particularly those of China, Korea and Jap"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS427",
    "교과목명": "유럽연합의국제관계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "유럽연합의 공동외교정책(CFSP)과 유럽안보방위정책(ESDP)에 대한 고찰을 통해 국제정치의 주체로서의 유럽연합의 대외적 함의를 고찰하는 한편, 유럽연합의 주요한 양자, 다자관계를 분석하고, 나아가 한국 외교에 있어 유럽연합이 가지는 의미를 알아본다.",
    "syllabus_en": "This course examines diplomatic, political, security, and economic issues that have shape shaped the international relations of European Union and Russia from historical, political and comparative perspectives. The course will also address issues related "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS428",
    "교과목명": "에너지와국제관계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "종합적·융복합적사고력",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제관계에 있어 중요성을 더해가고 있는 에너지 문제의 다양한 이슈와 그 정치, 경제적 함의를 알아보고, 이를 바탕으로 한 국제 에너지 관계의 변화 양상을 고찰한다.",
    "syllabus_en": "Global energy and environmental issues are getting more and more attention as a new agenda which defines international relations. These issues are especially interesting since they contain both political and economic implications. This course examines maj"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS429",
    "교과목명": "환경과국제관계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "기후변화, 황사, 수질 오염 등의 지구 환경을 주제로 한 각 주권국가간 주요 이슈를 살펴본다.",
    "syllabus_en": "This course helps students understand contemporary issues in global and regional environment. As environmental issues become a driving force for the changing world order based on the sovereign states, this course will explore broad theoretical discussions"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS433",
    "교과목명": "동아시아학특강I",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "동아시아 지역과 관련된 주요 주제를 선정하여 논의한다.",
    "syllabus_en": "Current and pressing issues in East Asian Studies will be selected for in-depth analysis. "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS453",
    "교과목명": "세미나:세계화와주요이슈",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "글로벌소통",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "세계화에 대한 다양한 정의와 의의를 찾는 것으로 시작하며 세계화의 변화와 지역을 통합하는 세계화에 대해서 분석한다. ",
    "syllabus_en": "To better understand globalization, this course will begin by exploring the multidimensional definitions and meanings of globalization. The course then examines globalization’s many variations as well as sub-globalizations that bind regions together. Als"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS472",
    "교과목명": "자원과국제개발",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "국제학전문가",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "국제개발에 있어서 에너지, 수자원, 주요 광물들이 가지는 의미를 생산국과 소비국의 관점에서 분석하고, 자원배분과 관련된 주요 이슈들을 고찰한다.",
    "syllabus_en": "Natural resources including oil, gas, water, and minerals are getting more and more important in global development. The issues are pertinent not only to exporting countries but importing countries. This course examines the distribution of major resources"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS475",
    "교과목명": "국제분쟁해결",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "실용지식기반도전적사고",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "국제사회의 분쟁의 해결이 협상, 중재, 법적 수단 등 다양한 경로와 방법에 의해서 해결될 수 있음을 학습하고, 주요 사례들을 분석한다.",
    "syllabus_en": "This course explores various types of settlement of disputes in international society. The first part of the course will introduce the different types of dispute settlements such as negotiations, arbitration and judicial settlement in the international so"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS476",
    "교과목명": "지속가능발전의주요이슈",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": "DISS112|PAPP201|POLI223",
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "지속가능발전과 관계된 경제적, 환경적, 사회적 이슈들과 개발도상국에 대한 지원 체제를 알아보고, 지속가능발전을 위한 여러 국제 사회의 시도를 분석한다.",
    "syllabus_en": "This course studies economic, environmental, and social issues on sustainable development. We also explore efforts of multilateral cooperation to help developing countries through technical cooperation and capacity building at international, regional and "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS477",
    "교과목명": "개발협력의주요이슈",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "본 강의는 국제개발 및 협력의 주요 이슈를 이해하고, 개발원조의 효율성을 분석한다._x000D_",
    "syllabus_en": "This course will study current issues in international development and cooperation and analyze effectiveness of development aid."
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS479",
    "교과목명": "교육보건및개발",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "사회참여및사회공헌",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 강의는 경제와 인간 개발 과정에서 교육과 보건에 대한 이론과 실제 사례에 대해 논의한다. 교육의 질과 접근성을 개선하고 보건 분야의 성과를 높이는 것은 개발도상국과 원조 공여기관 모두의 핵심 목표이다. 이를 위해 본 강의는 교육과 보건 문제 해결을 위한 국제 협",
    "syllabus_en": "This course discusses theories and practical evidence of education and health in the process of economic and human development. Enhancing health outcomes and improving the quality of and access to education are key goals for both developing countries and "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS481",
    "교과목명": "기후환경법과정치",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "사회참여및사회공헌",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "- 글로벌 차원에서 중요한 문제인 기후변화 문제에 대해서 파리협정을 비롯한 국제사회의 법과 제도 및 국가를 비롯한 주요 행위자 간의 거버넌스 문제를 학제간적 방법론에 기하여 학습한다._x000D_\n- 학제간적 방법론에 기한 기후변화에 문제에 대한 심도 있는 학습을 통하여서  ",
    "syllabus_en": "- Study the issues on international law and institutions on climate change including the Paris Agreement, and governullce issues among the major actors, including countries, based on an interdisciplinary methodology._x000D_\n- Learn various ways to respond to cli"
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS483",
    "교과목명": "동아시아환경관리",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "사회참여및사회공헌",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "동아시아 지역(한국, 일본, 중국)을 중심으로 지속가능발전 관련 전 세계적, 지역적, 국가적 담론을 기본 이론적 틀로 설정하여 녹색성장/녹색경제, 자원 효율성, 생태경제효율성 등의 파생 이론을 논의하면서 한국, 일본, 중국 둥 국가별 정책을 검토함. 특정한 사례로서 수",
    "syllabus_en": "The course highlights an array of significant policy frameworks in environmental policy, i.e., sustainable development, green growth, and eco-efficiency, and environmental disaster risk management. Discussions on such theoretical framework will be linked "
  },
  {
    "구분": "전공선택",
    "학수번호": "DISS485",
    "교과목명": "물과지속가능성",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": "사회참여및사회공헌",
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "국제학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 과목은 물과 지속가능성에 초점을 두면서 국제개발 관련 다양한 담론을 논의하고 이해하는 목적이 있음. 물과 지속가능성 이해와 논의를 위해 생태학, 정치학, 경제학과 사회학 관련 원칙과 이론을 논의하면서 과학과 사회경제 및 환경적 정책과 프로그램에 대한 이해를  ",
    "syllabus_en": "The purpose of this course is to provide an interdisciplinary introduction to international development discourses with a focus on water and sustainability issues. Attention will be paid to outlining conceptual frameworks addressing the relevant underlyin"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS203",
    "교과목명": "한국과동아시아",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "한국의 역사, 전통, 그리고 사상의 기원을 전근대 동아시아문명 교류 속에서 재구성하는 것을 목적으로 한다. 중국 중심의 문명권 속에서 형성된 전통한국의 정치와 문화, 실크로드를 통해서 전파된 불교를 중심으로 한 종교와 예술이 어떻게 한국의 전통문화의 형성 및 발전",
    "syllabus_en": "This course situates the formation and transformation of Korean civilization within the intra-regional developments of Asian civilizations. It examines the development of traditional value systems of Korea in association with Chinese and Indian civilizati"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS204",
    "교과목명": "한국문화의재조명",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "한국문화를 역사적으로 조명해 보고 그 이해를 높이는 데 교육의 목적을 둔다.",
    "syllabus_en": "In addition to examining the basic elements of Korean culture, this course incorporates many new findings and standpoints that challenge established notions about Korean culture. The course explores, among other topics, Korean customs, religious beliefs, "
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS212",
    "교과목명": "동아시아의도시화",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 2.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "도시화는 모든 사회적, 경제적 변화에서 나타나는 근본적인 변화이다. 도시화는 산업화 및 경제성장의 필수조건이며 동시에 도시화는 사회관계 형성을 구성한다. 본 강의는 한국과 다른 동아시아국가의 도시화 분석을 통해, 도시가 어떻게 경제개발을 가능하게 하였으며, 또 ",
    "syllabus_en": "Urbanization is an fundamental aspect of the social and economic transformations that take place in the process of development. On the one hand, it is necessary for industrial and economic growth. On the other hand, the shift to urban living alters the wa"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS214",
    "교과목명": "한국과국제법",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "통일, 영토분쟁, 경제협력 등 한국과 관련된 국제법 문제를 심도 있게 논의한다.",
    "syllabus_en": "This course studies the selected Korea related legal issues such as legal issues in Unification of two Koreas, territorial disputes over the Dokdo Island, and economic cooperation with other major economies through FTAs. While this course focuses on the l"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS303",
    "교과목명": "글로벌한국의대외관계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 강의는 현대 한국의 대외관계에 있어 주요 안건들과 전략을 세계적인 관점을 도입하여 다층적으로 분석한다. 또한, 본 강의는 한국과 주변 주요국들의 관계가 발전해온 방향과 세계 주요 지역에서 전개되는 한국의 외교활동을 검토한다. 그리고 한국의 대외관계가 안보,  ",
    "syllabus_en": "This course offers a multidimensional analysis of Korea’s foreign policy agendas and strategies. It will also examine the trajectory of Korea’s relations with key neighboring states, as well as Korea‘s diplomatic activities in major regions of the worl"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS309",
    "교과목명": "글로벌한국학특강I",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "한국학과 관련된 주요 주제를 선정하여 논의한다.",
    "syllabus_en": "Current and pressing issues in Global Korean Studies will be selected for in-depth analysis. "
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS312",
    "교과목명": "북한의정치와경제",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "이 과목은 북한의 정치·경제 체제 형성과 발전의 다층적 측면을 학생들에게 소개하기 위한 것이다. 이러한 각 측면의 주요 이슈와 경향을 비교적 관점을 통해 고찰하고자 한다. 학생들은 주어진 자료를 치밀하게 분석하면서 북한 정치경제 특성을 비판적으로 검토하고 일반 ",
    "syllabus_en": "This course is designed to introduce students to the multifaceted aspects on North Korea’s political and economic formation and development. Main issues and trends of each of these aspects will be examined through interdisciplinary approaches  and compar"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS314",
    "교과목명": "남북한관계의이해",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 3.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "남북한 관계에 대한 전반적인 상황을 비교 분석하고 동시에 남북 통일 문제의 현안 분석과 한반도 주변의 동아시아 국가들의 역할과 한반도에 대한 입장을 비교, 분석한다.",
    "syllabus_en": "This course traces how inter-Korean relations have evolved since the division of the country in 1948. The topics discussed include the impact of Cold War politics on South-North Korean relations; implications of the presence of U.S. troops in South Korea;"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS315",
    "교과목명": "한국통상정책",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "국제통상 이슈에 대하여 연구조사, 발표, 토론, 강평 등을 통하여 학습함으로써, 국제 통상 현안에 대한 실질적인 대응능력을 제고한다. 또한 통상분쟁사례를 분석하여, 국제 통상규정이 실제 사례에서는 어떻게 해석되며 적용되는가에 대하여 알아본다.",
    "syllabus_en": "Korea's trade policies and those of its majortrading countries such as China, Japan, the U.S., and EU are reviewed. New trade issues such as environment, labor rights, investment, and competition policy are discussed in terms of the ircurrent and future p"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS403",
    "교과목명": "한국의문화외교",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 강의는 한국의 문화를 해외에 소개하고, 한국 문화와 다양한 외국 문화와의 접점을 모색하는 것을 목적으로 한다. 문화를 통한 국가간 협력의 이론과 사례들을 고찰하고, 한국의 전통 및 현대문화의 여러 장르들을 양자 및 다자 차원의 외교활동과 연계시켜본다. 이 과정 ",
    "syllabus_en": "This course aims to introduce Korean culture to abroad and seeks intersections between Korean culture and diverse foreign cultures. Based on the exploration of theories and cases of cultural interaction, this course connects diverse genres of Korean cultu"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS404",
    "교과목명": "글로벌한국학특강II",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "한국학과 관련된 주요 주제를 선정하여 논의한다.",
    "syllabus_en": "Current and pressing issues in Global Korean Studies will be selected for in-depth analysis. "
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS409",
    "교과목명": "한국과국제개발",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 4.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "한국 경제개발의 이론과 실증을 소개하는 것을 목적으로 한다. 한국의 개발경험을 중점적으로 재구성하면서, 왜 국가별 개발 경로가 다른가를 분석할 것이다. 보다 구체적으로, 국가적 소득수준의 차이, 인간 개발의 차이, 삶의 질 차이는 어디서 오는 것인지를 비교 분석할 ",
    "syllabus_en": "This course provides an introduction to both theory and empirical evidence on economic growth and development. Drawing significantly on the Korean development experience, this class explores basic explanations for why countries differ in their levels of i"
  },
  {
    "구분": "전공선택",
    "학수번호": "GKSS410",
    "교과목명": "한미관계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": null,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": "글로벌한국융합학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "한미관계의 역사적 배경과 안보, 정치, 경제, 사회 등 각 방면에 있어서 상호관계를 파악하고 21세기 한미관계의 바람직한 방향을 모색한다.",
    "syllabus_en": "This course examines diplomatic, political, economic, social, and cultural issues that have shaped the relationship between the two countries since the 1870s to the present. In particular, the events and issues that have figured prominently in the history"
  },
  {
    "구분": "교양필수",
    "학수번호": "GELI005",
    "교과목명": "학문세계의탐구 I",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 교과목은 학습자 주도형 토론 중심 수업으로 다양한 학문 세계를 탐구하며 비판적·창의적·융합적 사고 능력을 배양하는 것을 목적으로 한다. 학문세계의탐구Ⅰ은 토론과 협업을 통해 인간을 이해하고 가치를 탐구하는 교양필수 과목이다.",
    "syllabus_en": "The course explores the academic world across various disciplines and aims to cultivate critical, creative, and convergent thinking competencies with learner-driven, discussion-based instruction._x000D_\nExploration of the Academic World I is a General Education"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEWR002",
    "교과목명": "글쓰기",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "<글쓰기>는 ‘글쓰기의 기초’를 훈련하는 과목으로, 대학 수학 능력의 기본이 되는 사고력과 자기 표현력을 기르는 것을 목표로 한다. 학업 과정에서?요구되는 글쓰기의 특성을 이해하고, 이를 바탕으로 글쓰기를 체계적으로 훈련한다. <글쓰기>는 전교 공통의 과정으로 1학",
    "syllabus_en": "College Writing is an introductory writing course intended to advance students’ critical thinking skills and self-expression?basic skills required for college studies. In this course, students will gain a better understanding of the specific techniques n"
  },
  {
    "구분": "교양필수",
    "학수번호": "IFLS800",
    "교과목명": "Academic English I",
    "학점": 2.0,
    "시간": 2.0,
    "학년": 1.0,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 수업은 학생들의 학술관련 영어능력 및 의사소통능력을 향상시키는 데 목적이 있다. 학업 관련 모든 영역에서 활용 가능한 전반적인 영어능력 향상을 위해 학술 내용을 바탕으로 수업을 진행하며, 학생들이 실제 상황에서 구사할 수 있는 영어능력 향상에 초점을 맞춘 다 ",
    "syllabus_en": "The objective of this course is to enhance students’ communicative competence in English. Academic content is covered to improve overall proficiency in all areas of English communication as it relates to academic studies. Basic language skills are develo"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS007",
    "교과목명": "[진로창업]1학년세미나 I",
    "학점": 1.0,
    "시간": 1.0,
    "학년": 1.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅰ은 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 대학생활에 적응하고 대학생으로서 진로(연구, 취업, 창업)를 설계할 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여 등으로 ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, which provides fitting in university and career explorations. It includes academic advising, counseling with professors, seminars or special online lectures by KU fa"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS008",
    "교과목명": "[진로창업]1학년세미나 II",
    "학점": 1.0,
    "시간": 1.0,
    "학년": 1.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅱ는 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 학교에 대한 소속감을 강화하고 창직 및 창업 등의 진로 방향성을 고민해볼 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여  ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, offering mentorship and guidance in career directions such as entrepreneurship. It includes academic advising, counseling with professors, seminars, and special onli"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT002",
    "교과목명": "[진로창업]SW프로그래밍의기초",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목은 컴퓨팅 사고와 프로그래밍의 기본 원리를 소개하는 과정이다. 소프트웨어의 근간이 되는 프로그래밍 언어에 대한 체계적인 이해를 바탕으로, Python 언어를 통해 기본 문법, 데이터 구조 및 제어 구조의 핵심 개념을 학습한다. 학생들은 이 과목을 통해 프로그래밍",
    "syllabus_en": "This course introduces the fundamental principles of computing thinking and programming. Building on a systematic understanding of the programming languages that form the foundation of software, students will learn essential concepts of syntax, data struc"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT003",
    "교과목명": "[진로창업]데이터과학과인공지능",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "_x000D_\n이 과목은 데이터를 다루고 분석할 수 있는 역량과 인공지능 기술을 이해하고 자기의 일에 활용할 수 있는 방법을 학습하는 과정이다. 기초적인 데이터과학 및 인공지능 핵심 개념을 학습하고, 각 계열별 특성에 맞는 데이터를 활용한 실습을 통해 실제 데이터를 다루고 인",
    "syllabus_en": "This course aims to develop the ability to handle and analyze data, understand artificial intelligence technologies, and learn how to apply them in one's field of work. It covers fundamental concepts of data science and artificial intelligence, and throug"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEBT001",
    "교과목명": "[진로창업]생명과학의세계",
    "학점": 3.0,
    "시간": 3.0,
    "학년": 1.0,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "전공역량": null,
    "대학": "국제대학",
    "학과": "국제학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "생명과학의 세계는 생명공학의 기초 지식과 생명현상을 이용한 융복합 기술의 다양한 사례를 살펴봄으로써 변화하는 미래 환경을 대비하고 선도할 수 있는 융합적 사고를 함양하는 강좌이다.",
    "syllabus_en": "This is a course that fosters convergent thinking to prepare for and lead the changing future environment by examining basic knowledge of biotechnology and various examples of convergence technologies using life phenomena."
  }
]
