[
  {
    "구분": "교양필수",
    "학수번호": "GELI005",
    "교과목명": "학문세계의탐구 I",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 교과목은 학습자 주도형 토론 중심 수업으로 다양한 학문 세계를 탐구하며 비판적·창의적·융합적 사고 능력을 배양하는 것을 목적으로 한다. 학문세계의탐구Ⅰ은 토론과 협업을 통해 인간을 이해하고 가치를 탐구하는 교양필수 과목이다.",
    "syllabus_en": "The course explores the academic world across various disciplines and aims to cultivate critical, creative, and convergent thinking competencies with learner-driven, discussion-based instruction._x000D_\nExploration of the Academic World I is a General Education"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEWR002",
    "교과목명": "글쓰기",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "<글쓰기>는 ‘글쓰기의 기초’를 훈련하는 과목으로, 대학 수학 능력의 기본이 되는 사고력과 자기 표현력을 기르는 것을 목표로 한다. 학업 과정에서?요구되는 글쓰기의 특성을 이해하고, 이를 바탕으로 글쓰기를 체계적으로 훈련한다. <글쓰기>는 전교 공통의 과정으로 1학",
    "syllabus_en": "College Writing is an introductory writing course intended to advance students’ critical thinking skills and self-expression?basic skills required for college studies. In this course, students will gain a better understanding of the specific techniques n"
  },
  {
    "구분": "교양필수",
    "학수번호": "IFLS800",
    "교과목명": "Academic English I",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 2,
    "시간": 2,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 수업은 학생들의 학술관련 영어능력 및 의사소통능력을 향상시키는 데 목적이 있다. 학업 관련 모든 영역에서 활용 가능한 전반적인 영어능력 향상을 위해 학술 내용을 바탕으로 수업을 진행하며, 학생들이 실제 상황에서 구사할 수 있는 영어능력 향상에 초점을 맞춘 다 ",
    "syllabus_en": "The objective of this course is to enhance students’ communicative competence in English. Academic content is covered to improve overall proficiency in all areas of English communication as it relates to academic studies. Basic language skills are develo"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS007",
    "교과목명": "[진로창업]1학년세미나 I",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 1,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅰ은 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 대학생활에 적응하고 대학생으로서 진로(연구, 취업, 창업)를 설계할 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여 등으로 ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, which provides fitting in university and career explorations. It includes academic advising, counseling with professors, seminars or special online lectures by KU fa"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS008",
    "교과목명": "[진로창업]1학년세미나 I",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 1,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅱ는 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 학교에 대한 소속감을 강화하고 창직 및 창업 등의 진로 방향성을 고민해볼 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여  ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, offering mentorship and guidance in career directions such as entrepreneurship. It includes academic advising, counseling with professors, seminars, and special onli"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT002",
    "교과목명": "[진로창업]SW프로그래밍의기초",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목은 컴퓨팅 사고와 프로그래밍의 기본 원리를 소개하는 과정이다. 소프트웨어의 근간이 되는 프로그래밍 언어에 대한 체계적인 이해를 바탕으로, Python 언어를 통해 기본 문법, 데이터 구조 및 제어 구조의 핵심 개념을 학습한다. 학생들은 이 과목을 통해 프로그래밍",
    "syllabus_en": "This course introduces the fundamental principles of computing thinking and programming. Building on a systematic understanding of the programming languages that form the foundation of software, students will learn essential concepts of syntax, data struc"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT003",
    "교과목명": "[진로창업]데이터과학과인공지능",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "_x000D_\n이 과목은 데이터를 다루고 분석할 수 있는 역량과 인공지능 기술을 이해하고 자기의 일에 활용할 수 있는 방법을 학습하는 과정이다. 기초적인 데이터과학 및 인공지능 핵심 개념을 학습하고, 각 계열별 특성에 맞는 데이터를 활용한 실습을 통해 실제 데이터를 다루고 인",
    "syllabus_en": "This course aims to develop the ability to handle and analyze data, understand artificial intelligence technologies, and learn how to apply them in one's field of work. It covers fundamental concepts of data science and artificial intelligence, and throug"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEBT001",
    "교과목명": "[진로창업]생명과학의세계",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "생명과학의 세계는 생명공학의 기초 지식과 생명현상을 이용한 융복합 기술의 다양한 사례를 살펴봄으로써 변화하는 미래 환경을 대비하고 선도할 수 있는 융합적 사고를 함양하는 강좌이다.",
    "syllabus_en": "This is a course that fosters convergent thinking to prepare for and lead the changing future environment by examining basic knowledge of biotechnology and various examples of convergence technologies using life phenomena."
  },
  {
    "구분": "교양선택",
    "학수번호": "MATH161",
    "교과목명": "미적분학및연습 I",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 4,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "수학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "일계함수의 미분과 적분, 적분의 응용, 극좌표계, 수열과 급수, 벡터와 벡터 공간",
    "syllabus_en": "Calculus of one variable functions, Applications fo integration, Polar coordinates Sequences and series, Vector and vector spaces, Calculus of vector functions"
  },
  {
    "구분": "교양선택",
    "학수번호": "MATH162",
    "교과목명": "미적분학및연습 Ⅱ",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 4,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "수학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "다변수 함수의 미분, 다중적분, 선적분, 곡면적분, 발산정리",
    "syllabus_en": "Differentiation of several variable functions, Multiple integrals, Line integrals, Surface integrals Divergence theorem"
  },
  {
    "구분": "교양선택",
    "학수번호": "PHYS151",
    "교과목명": "일반물리학및연습Ⅰ",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "물리학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "대학에서 과학 및 공학을 공부하는 데에 필요한 물리학의 기본지식과 이에 근거한 방법론 및 과학적 사고방식을 가르치는 과목이다. 주요 내용은 물리량을 기술하는 방법, Newton 역학, 파동현상, 열역학이며, 미적분을 이용한 수준이다. 3시간의 강의가 있고, 1시간의 연습 ",
    "syllabus_en": "In this course students will learn basic physics and physical methodology that are prerequisite for further studies in science and engineering at a college level. Major contents include Newtonian mechanics, wave phenomena and thermodynamics with heavy use"
  },
  {
    "구분": "교양선택",
    "학수번호": "PHYS161",
    "교과목명": "일반물리학실험Ⅰ",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "물리학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "일반물리학및연습 I 에서 강의 및 문제풀이로 배우는 내용을 실험을 통해서 배우는 과목이다. 주요 내용은 date분석법, Newton 역학, 파동현상, 열역학에 관한 실험이다. 한번 3시간 실험으로 진행되며, 2인 1조를 원칙으로 하고, 8개조가 한 반을 구성하여 조교 및 교수의  ",
    "syllabus_en": "In this course students do experiments on various topics which are covered in the accompanying lectures. The course consists of 9 laboratory sessions guided by a teaching assistant. Each class is made of 8 groups of two students each."
  },
  {
    "구분": "교양선택",
    "학수번호": "PHYS152",
    "교과목명": "일반물리학및연습Ⅱ",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "물리학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "대학에서 과학 및 공학을 공부하는 데에 필요한 물리학의 기본지식과 이에 근거한 방법론 및 과학적 사고방식을 가르치는 과목이다. 주요 내용은 전자기학, 광학 및 현대물리학이며, 미적분을 이용한 수준이다. 3시간의 강의가 있고, 1시간의 연습시간에 과제물에 대한 문제 ",
    "syllabus_en": "In this course students will learn basic physics and physical methodology that are prerequisite for further studies in science and engineering at a college level. Major contents include electromagnetism, optics and modern physics with heavy use of calculu"
  },
  {
    "구분": "교양선택",
    "학수번호": "PHYS162",
    "교과목명": "일반물리학실험Ⅱ",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "물리학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "일반물리학및연습 II 에서 강의 및 문제풀이로 배우는 내용을 실험을 통해서 배우는 과목이다. 주요 내용은 date분석법, Newton 역학, 파동현상, 열역학에 관한 실험이다. 한번 3시간 실험으로 진행되며, 2인 1조를 원칙으로 하고, 8개조가 한 반을 구성하여 조교 및 교수의 ",
    "syllabus_en": "In this course students do experiments on various topics which are covered in the accompanying lectures. The course consists of 9 laboratory sessions guided by a teaching assistant. Each class is made of 8 groups of two students each."
  },
  {
    "구분": "교양선택",
    "학수번호": "CHEM150",
    "교과목명": "일반화학및연습",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "화학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "이공계 분야들에 관련된 화학에 관한 기본개념과 이론들을 강의와 연습을 통해 토의하고, 응용분야들인 환경화학이나 생물화학 및 공업화학 등을 소개 한다",
    "syllabus_en": "It discuss the basic conecept and theories of chemistry related to the scientific areas. It introduces the application of chemistry by teaching and practice. It also introduces the applied fields of chemistry such as environmental chemistry, biochemistry,"
  },
  {
    "구분": "교양선택",
    "학수번호": "CHEM155",
    "교과목명": "일반화학실험",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "화학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "일반화학 강의에서 다룬 내용들을 실제 실험을 통하여 화합물의 합성법을 배우고 물성을 측정한다. 또한, 화학에 관련된 실험을 수행하는데 필요한 기본 테크닉들을 익힌다.",
    "syllabus_en": "The purpose of this laboratory is to provide the student with easy-to-grasp examples of the concepts presented in General Chemistry. Experiments expose students to basic laboratory skills and demonstrate the principles of chemistry by experimental data"
  },
  {
    "구분": "교양선택",
    "학수번호": "LIBS150",
    "교과목명": "생명과학",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "생명과학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "21세기는 생명과학의 시대라고들 이야기한다. 이 과목은 21세기를 살아가는 현대인들이 기본적으로 알아야 할 생명의 기원, 세포학, 생화학, 유전학, 발생학, 생태 및 분류학과 같은 생명과학 분야 기본과목의 기초적인 이해에 그 목표가 있다.",
    "syllabus_en": "It is generally said that 21st century is the era of Life Sciences. This class offers students general introduction of all the fields of biological sciences including origin of life, cell biology, biochemistry, genetics, taxonomy, environmental biology et"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH201",
    "교과목명": "열역학I",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "에너지의 개념, 열역학의 기본 법칙들과 그 응용을 다루며, 내용은 질량보존법칙, 열역학 제1법칙, 제2법칙, 물질의 상태량 변화와 엔트로피의 개념등이다._x000D_\n",
    "syllabus_en": "Concept of energy, fundamental laws of thermodynamics and applications : mass conservation law, the first and second law of thermodynamics, properties of substances and concept of entropy._x000D_\n"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH204",
    "교과목명": "유체역학I",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "유체정역학 및 운동학, 오일러식 및 에너지식, 운동량식의 응용, 차원 해석과 상사율, 충류 및 난류의 실제유동, 경계층 개념, 내류 및 외류 등을 다룬다._x000D_\n",
    "syllabus_en": "Fluid statics, kinematics, Euler's equations, and momentum principles. Laminar and turbulent flows, pipe flow, similitude, boundary layer flow, compressible flow and open channel flow._x000D_\n"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH205",
    "교과목명": "고체역학I",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "  축의 비틀림, 전단력, 굽힘모멘트, 보의 응력, 보의 처짐, 부정정보 기초, 기둥의 기초",
    "syllabus_en": " Torison of shafts, Shear Force, Bending Moment, Strusses in Beams, Deflections of Beams, Elements of Statically indeterminated Beams, Elementary Column Theory._x000D_\n"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH209",
    "교과목명": "기계제작법및실습",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 4,
    "전공역량": "공학문제식별능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "주조, 소성가공, 열처리, 용접, 절삭가공, 연삭가공, 특수가공 등 모든 제작방법을 다루고, 기계를 구성하는 부품의 적절한 제작방법을 선정할 수 있게 하고, 공작기계를 이용하여 부품을 제작한다._x000D_\n",
    "syllabus_en": "Introduction of manufacturing processes used to make mechanical devices including casting, forming, heat treatment, welding, cutting, grinding, nontraditional machining, etc. Enhancing ability to select optimal processes for manufacturing machine componen"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH210",
    "교과목명": "전산기이용기계제도",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 2,
    "시간": 3,
    "전공역량": "문제해결능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기계나 구조물을 설계하고 제작하는 데 필요한 부품도와 조립도 등의 도면을 작성하고 판독하는 방법을 배우며, 이러한 지식을 바탕으로 컴퓨터를 이용한 도면의 작성 방법을 습득한다._x000D_\n",
    "syllabus_en": "In this course, the students learn to prepare and understand engineering drawings in order to design and manufacture the machines and structures. Based on these knowledge the students also practice mechanical drawings by computers._x000D_\n"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH211",
    "교과목명": "기구학",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "공학문제식별능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기구학이란 기계를 구성하는 부품들 사이의 상대 운동 해석과 설계자가 원하는 원활한 운동을 하는 기계를 만들기 위해서는 어떠한 부품들을 어떻게 조합하여야 하는가를 다루는 학문으로 기계 설계에 있어 가장 근본이 된다. 본 강의에서는 다양한 기계를  구성하는  기구의",
    "syllabus_en": "Kinematics of Mechanisms deals with relative motions of various links in mechanisms and how to synthesize a mechanism which satisfies desired motion, which is a fundamental subject in mechanical design. In this class, motion and force analyses of various "
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH226",
    "교과목명": "동역학",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": " 동역학의 일반적인 원리에 대해 살펴보고 질점과 강체의 운동학과 뉴튼의 법칙, 일과 에너지의 법칙, 충격량과 운동량의 세 가지면에서 보는 운동역학을 여러 공학모델에 응용한다.",
    "syllabus_en": " General principles on Dynamics will be considered in this course. Kinematics of particles and rigid bodies and kinetics of particles and rigid bidies in terms of newton's second law, method of work and energy, and impulse and momentum will be applied to "
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH300",
    "교과목명": "창의적기계설계:캡스톤디자인",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 4,
    "전공역량": "창의적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목에서는 일상생활이나 산업환경에서 발생하는 공학적인 문제를 창의적으로 해결하는 방안의 하나로 기계설계의 원리와 절차를 강의한다. 강의는 설계 개념을 도출하는 방법, 추상적인 개념을 구체적인 형상으로 표현하는 방법, 각종 기계를 구성하는 요소들의 종류 및 ",
    "syllabus_en": "In thin course creative machine design process is introduced ac a practical tool for solving engineering problems. The lectures will cover methods for defining problems, generating creative elements. Case studies of machine design will be offered. Attenda"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH317",
    "교과목명": "공학재료학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "공학문제식별능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기계 부품 및 구조물 설계 시 가장 적합한 공학재료를 선택할 필요가 있다. 본 강의에서는 금속(합금), 세라믹, 포리머 그리고 복합재료의 기계적 성질과 미소 구조와의 상관관계 그리고 재료의 공정을 공부함으로서 공학 재료에 대한 기본 지식을 기른다. _x000D_\n",
    "syllabus_en": "Selection of engineering materials (metals and alloys; polymers; ceramics; composites) is important in design of mechanical components and structures. This course quantifies relationships between mechanical properties and microstructures. Processing techn"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH329",
    "교과목명": "기계공학실험I",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 3,
    "전공역량": "문제해결능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "재료의 기계적 성질 및 시험법: 인장, 압축, 충격, 경도 및 부식 시험 재료역학 실험 : 비틀림, 압력 용기, 광탄성, 기초 진동 및 회전축 Whirling, 트러스의 행렬해석_x000D_\n",
    "syllabus_en": "Mechanical Properties and Test Methods; Tension, Compression, Impact, Hardness and Corrosion Experiments for the Mechanics of Materials ; Torsion of Shafts, Pressure Vessel, Photoelasticity, Elementary Vibration and Shaft Whirling, Matrix Analysis of Trus"
  },
  {
    "구분": "전공필수",
    "학수번호": "MECH330",
    "교과목명": "기계공학실험II",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 3,
    "전공역량": "문제해결능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "열 및 유체공학의 기본실험으로서 레이놀즈 및 관마찰실험, 각종 유량계수 및 점성측정실험, 열전도실험, 발열량실험, 풍동실험 등을 포함한다._x000D_\n",
    "syllabus_en": "This course covers Reynolds experiments, pipe friction tests, measurements of the flow coefficients through orifices, venturi-tube and weirs, viscosity of lubricating oil, heat conduction tests, measurements of heating value of fuels, and wind tunnel expe"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH215",
    "교과목명": "공업수학I",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "공학의 실용적인 문제와 관련하여 시스템의 운동이나 현상을 해석하고 예측하는데 필요한 수학을 학습한다. 주된 내용으로 전공과목에 곧바로 적용할 수 있는 미분방정식의 시리즈해법, 특수함수, 라플라스변환, 선형대수학 등을 다룬다._x000D_\n",
    "syllabus_en": "We'll explore series solution of differential equation, Special function, Laplace Transforms, and Linear Algebra to help us understand the various aspects of modern engineering_x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH216",
    "교과목명": "공업수학II",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "공업수학Ⅰ의 연속으로 전공심화과정에 필요한 수학을 배운다. 주요내용으로 편미분, 푸리에 변환 선형대수학 등을 공부한다._x000D_\n",
    "syllabus_en": "The course will cover partial differential fourier Analysis, Numerical methods, etc. in sequence of Engineering mathematicsⅠ._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH222",
    "교과목명": "열역학II",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "열역학의 기본 법칙들의 응용을 다루며, 내용은 제2법칙 해석, 가스와 증기 동력 사이클, 냉동 사이클, 상태량 관계식들 등이다._x000D_\n",
    "syllabus_en": "Applications of thermodynamics laws : Second law analysis, gas and vapor power cycles, refrigeration and heat pump cycles and thermodynamic relations._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH236",
    "교과목명": "고체역학Ⅱ",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "응력과 변형률 해석, 응력-변형률-온도관계, 부정정문제, 비대칭 굽힘, 비탄성 굽힘 및 비틀림, 좌굴 이론, 에너지방법. ",
    "syllabus_en": " Alalysis of stress and strain, stress-strain-temperature relations, statically indeterminate problems, unsymmetrical bending, inelastic bending and torison, buckling theory, energy methods."
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH311",
    "교과목명": "열전달",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "열전달 현상을 이해하기 위해서 일차원 및 다차원 정상열전도, 비정상 열전도, 강제 및 자연 대류 열전달, 복사 열전달을 소개하며 그 응용기관인 열교환기 등을 다룬다._x000D_\n",
    "syllabus_en": "Principles of heat conduction, convection, and radiation. Engineering applications of the theory of heat transfer such as heat exchangers._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH312",
    "교과목명": "응용열전달",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "열전달에서 배운 전도 및 대류 기본 지식을 응용하여 열교환기설계, 상변화 열전달, 복사열전달, 물질전달 등 응용열전달분야를 심도있게 공부한다. _x000D_\n",
    "syllabus_en": "This course gives students the opportunity to utilize the fundamental principles of conduction and convection heat transfer for practical application, and to study the theories of applied heat transfer such as phase change, heat exchanger design, radiatio"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH318",
    "교과목명": "냉동",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "증기압축 냉동사이클 및 그 해석, 압축기, 열교환기, 팽창장치, 흡수식냉동 그리고 열펌프 등에 대한 기초이론 및 응용기술을 다룬다._x000D_\n",
    "syllabus_en": "This course covers principles and analysis of vapor compression cycle, compressors, heat exchangers, expansion devices, heat pumps, and absorption refrigeration_x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH320",
    "교과목명": "유체기계",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH323",
    "교과목명": "유체역학II",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "움직이는 유체 내부에 작용하는 힘과 유동 특성, 압력 특성과의 관계를 이론적 실험적으로 해석하고 그 원리를 산업적으로 응용하는 방법을 익힌다. 강의 내용은 차원 해석과 상사율, 내류 점성유동, 외류 점성 유동, 압축성 유동, 개수로 유동, 터보기계를 다룬다._x000D_\n",
    "syllabus_en": " In this subject, the theoretical and experimental analyses about the relationships between the forces acting on a fluid  in action and the flow characteristics will be lectured. One of the main objectives of  the subject is to have practice the method ap"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH328",
    "교과목명": "기계요소설계",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "지식융합능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기계를 구성하는 각종 요소의 기능과 구조를 이해하고, 이들을 적절히 선택하여 기계나 장치를 설계하는 방법을 학습한다. 본 과목은 기초 설계론 , 설계 사례 및 각종 기계요소에 대한 이론 강의와 설계 경연대회 출전용 KIT 의 고안 및 설계의 실습을 포함한다._x000D_\n",
    "syllabus_en": "In this course following topics will be covered ; design procedures, case studies in machine design, fundamental theories and applications of machine elements. This course include design and implementation of a KIT for the annual design contest. _x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH334",
    "교과목명": "유한요소법",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "유한 요소법의 기초이론과 이를 여러 가지 공학 문제에 적용하는 방법을 배운다. 이를 위해 트러스, 보, 2차원 및 3차원 요소 등 각종 요소에 대해 배우고, 지배 방정식의 구성, 동적 해석 등에 필요한 지식을 습득한다. 또한 상용 프로그램과 예제 프로그램을 사용하여 실제",
    "syllabus_en": "Basic theory of the finite element method and its application to various engineering problems. Formulation of truss, beam, two-dimensional and three-dimensional elements. Solution schemes of governing equations and dynamic analysis._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH352",
    "교과목명": "전산기응용설계",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "문제해결능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "2차원과 3차원 컴퓨터 그래픽스 및 기하학적 모델링, 솔        리드 모델링 등에 사용되는 기본적인 수학적 이론과 설계의 데이터베이스 및 최적설계의 수학적인 기초 등을 다룬다._x000D_\n",
    "syllabus_en": "This class deals with mathematical tools used for 2-and 3- dimensional computer graphics, geometric modelling and solid modeling. in addition, the concepts of design data base and optimization techniques are covered._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH373",
    "교과목명": "기계진동학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": " 1자유도 선형계의 자유진동을 소개하고, 설계, 측정 및 안정성에 대해서도 논한 다음 조화입력을 받는 1자유도계의 응답과 감쇠의 여러 형태, 일반적인 입력을 받는 1자유도계의 응답, 2자유도계와 모드해석, 진동해석과 측정 및 설계, 분포계의 진동해석, 모드실험해석 등 ",
    "syllabus_en": " This course introduces free vibration of SDOF linear systems with design, measurement and stability. In addition, this course covers on response of SDOF systems to harmonic input, alternative forms of damping, response of SDOF systems to general inputs, "
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH386",
    "교과목명": "전기전자공학개론",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "전기전자공학개론은 기계공학과 학생들을 대상으로, 기계공학에 필요한 전기 및 전자공학의 기초를 가르치는 과목이다. 전반부에서는 선형 전기회로의 기본원리 및 이를 구성하는 저항, 커패시터, 인덕터 등을 학습하고, 이를 바탕으로 교류회로 및 선형회로의 시간영역 및  ",
    "syllabus_en": "Basic electrical and electronic engineering for the students majoring in mechanical engineering. The first half part deals with basic principles of linear electrical circuits, passive components (resistors, capacitors, inductors), AC circuits, time-domain"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH387",
    "교과목명": "자동제어",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "기계, 전기 장치 등의 동적 시스템을 모델링하고 분석하는 방법과 기본 제어이론 및 응용을 배운다. 피드백 제어 시스템의 특성, 과도응답 및 정상상태 성능, 안정성 해석과 근궤적 기법, 주파수 응답 기법 등의 설계 기법을 익힌다.",
    "syllabus_en": "Learn how to model and analyze dynamic systems such as machinery and electrical devices, basic control theory, and application. Learn design techniques such as feedback control system characteristics, transient response and steady-state performance, stabi"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH389",
    "교과목명": "공학현장실습Ⅰ",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 0,
    "전공역량": "지식융합능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "기계공학 각 분야의 산업 또는 연구개발 현장에 직접 참여토록 하여, 학부과정에서 배운 이론과 실기능력을 적용하고 살아있는 지식을 습득할 수 있는 기회를 제공한다.",
    "syllabus_en": "This course gives students the opportunity to integrate theory learned in the classroom with practical application and skills development."
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH399",
    "교과목명": "공학현장실습Ⅱ",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 0,
    "전공역량": "지식융합능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH411",
    "교과목명": "초소형기전공학",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "공학문제식별능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "MEMS(Micro-Electro-Mechanical System)에서 이용되는 공정을 공부하고, 이러한 공정은 이용한 초소형 센서와 액츄에이터의 설계 및 제작에 관해 고전적인 방법들과 최신의 동향을 알아보고 이를 기반으로 하여 MEMS 소자나 시스템을 설계하는 경험을 갖도록 한다._x000D_\n",
    "syllabus_en": "Basic processes used in MEMS(Micro-Electro- Mechanical System), Design and fabrication of varions   sensors and actuators basde on MEMS techniques Research trends on MEMS technology._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH415",
    "교과목명": "공기조화",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "지식융합능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "습공기 계산, 습공기 과정 및 습공기 선도, 냉난방 부하와 에너지 소요량 산정, 공기조화 시스템 및 그 제어, 송풍기 및 덕트 시스템, 펌프 및 배관시스템 등에 대한 기초 이론을 다룬다._x000D_\n",
    "syllabus_en": "This course covers moist air properties, psychrometric chart and process, heating and cooling loads, air conditioning systems, fan and duct system, and pump and pipe system. _x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH419",
    "교과목명": "에너지공학",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "공학문제식별능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "에너지의 개념과 열역학, 유체역학, 열전달의 관점에서 에너지의 전달해석 등 기초 이론을 설명하고 이를 에너지 변환 시스템에 적용한다. 기존 및 신 에너지를 얻기 위한 여러 응용 시스템을 알아본다. 에너지의 재활용 및 보존, 경제성을 살펴보고, 환경 문제도 다룬다._x000D_\n",
    "syllabus_en": "Introduction on concept of energy. Energy classification, sources, and utilization. Energy conservation with a view from thermodynamics, fluid mechanics and heat transfer. Energy conversion systems. Energy storage techniques. Economic considerations and t"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH421",
    "교과목명": "내연기관",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 4,
    "전공역량": "공학문제식별능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH424",
    "교과목명": "연소공학",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "공학문제식별능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "연소에 관련된 이론과 화염의 응용 및 제어, 즉 연소 효율 증대, 공해 물질 생성 억제 및 추진 등을 다룬다. 이를 위하여 화학반응이 수반되는 유동에서의 운동량, 열 및 물질 전달의 복합적인 현상에 대해 이론을 다룬다._x000D_\n",
    "syllabus_en": "Topics in combustion, providing both theoretical and applied understanding of flame processes as they related to combustion efficiency, pollutant formation and propulsion, Momentum, heat and mass transfer by various modes, chemistry and dynamics of combus"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH431",
    "교과목명": "생체공학",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": " 일반적인 생체 구조 및 생리학적 및 현상에 대한 이해를 토대로 기계, 전자 및 화학 등의 공학 전반에 걸친 지식의 융합적 접근을 통해 인체 생리현상에 대한 새로운 해석과 이를 통한 관련 의료공학으로의 응용을 다룬다.",
    "syllabus_en": " This calss covers variety of bioengineering topics related with physiological mechanisms based on mechanical, eletronic, and chemical engineering background. The interdisciplinary approaches to the physiological phenomena will be given on each topics and"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH436",
    "교과목명": "응용유체역학",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "유체역학 이론과 유동실험 동영상 교재를 통하여 다양한 유동 현상의 물리적 특성을 배우고, 이를 이용한 유체역학적 설계 기술을 습득한다. 특히 유동에 의해 발생하는 항력, 양력, 소음 등을 최적화 할 수 있는 제어 기술들을 고찰하고, 전산해석 S/W를 이용하여 이를 최적",
    "syllabus_en": "Fluid dynamic theories will be studied with video aids of various experiments. Study will be focused on understanding of physical mechanisms and the principles of fluid dynamic design will be taught. The dynamics of fluids regarding on drag, lift, and flo"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH437",
    "교과목명": "메카트로닉스",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "  각종 센서 및 계측 시스템, 디지털 전자공학의 기초, DC모터, AC모터의 원리 및 제어, 마이크로프로세서의 구조, 컴퓨터 인터페이싱, 마이크로프로세서에 기초한 기계시스템의 설계 등의 주제를 강의와 실습을 통해서 취급한다._x000D_\n_x000D_\n ",
    "syllabus_en": "  Lecture and laboratory experiments.Sensors and measurement systems, fundamentals of digital electronics, principles and control of DC, AC and stepping motors, architecture of microprocessor, computer interfacing, and design of microprocessor-based mecha"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH446",
    "교과목명": "재료거동학",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "지식융합능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "고체역학과 기계재료학의 기본 개념을 바탕으로 기계부품 설계의 핵심요소인 소성 평가, 파괴강도 평가, 피로 수명 설계, 크리프파손및 산화와 관련된 이론을 공부함으로서 궁극적으로 신소재를 이용한 새로운 기계/전자 부품의 설계 및 신뢰성 평가를 위한 기초 지식을 습득",
    "syllabus_en": "This course firstly covers design against plastic deformation, fatigue, fracture, creep and oxidation. Then, combining with knowledge on solid mechanics, design evaluation of mechanical components is covered using new materials._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH457",
    "교과목명": "수치해석",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "수학문제를 컴퓨터를 이용하여 근사적인 수치해를 구하는 방법들, 즉  고차방정식의 근 및 선형 연립방정식의 근을 구하는 법, 근사식 및 보간법, 수치적인 미분과 적분, 상미분방정식 및 편미분 방정식 등의 수치해법을 다룬다._x000D_\n",
    "syllabus_en": "Numerical methods for the approximate solution of mathematical problems. Roots of algebraic equations, solution of linear system of equation, curve fitting and interpolation numerical integration an differentiation, and numerical integration of ordinary a"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH460",
    "교과목명": "생산공학",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "폴리머, 복합 재료 및 세라믹의 가공과 첨단 생산 및 가공 시스템을 다루며, 생산 일정 계획, 생산 자동화 및 통합 생산 시스템(CAD/CAM, FMS), 최적화, 경제성 평가 등에 대해 공부한다._x000D_\n",
    "syllabus_en": "Topics include manufacturing processes for polymers, composite materials, and ceramics. Planning & scheduling, manufacturing automation, CAD/CAM, FMS optimization, economic analysis._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH463",
    "교과목명": "마이크로프로세서프로그래밍",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 4,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "기계요소설계, 자동제어, 전기전자공학, 메카트로닉스 등의 과목에서 학습한 내용을 종합하여, 지능기계의 해석, 설계, 제작 및 운영 능력을 배양한다. 본 과목은 이론 강의와 실습으로 구성되며, 메카니즘 설계, 컴퓨터 프로그래밍, 인터페이싱, 회로설계 및 성능평가 등을 ",
    "syllabus_en": " Intelligent machine design includes concepts and applications that are related to various disciplines of mechanical element design, controls, electronics, and mechatronics. The goal of this class is for students to obtain the ability to design, develop, "
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH471",
    "교과목명": "종합설계",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "산업 현장의 다양한 사례 연구를 통해 기계공학의 각종 원리들이 실제 문제에 어떻게 적용되는가를 이해하고, 다양한 기계공학 원리들의 종합적인 응용을 통해 설계문제에 대한 해결책을 구하는 능력을 배양한다.",
    "syllabus_en": "Based on the case studies of various engineering problems, students will can learn how engineering principles are applied to real problems. Students will also be trained to integrate engineering principles, experiences and skills for practical design prob"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH482",
    "교과목명": "나노공학입문",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목에서는 우선 에너지와 물질의 연속성에 기반한 고전적 역학체계에 익숙한 기계공학 전공자들이 나노공학을 이해할 수 있도록 기본적인 양자역학, 통계역학 등 나노공학을 이해하는데 필요한 기초적인 이론을 소개한다. 이를 토대로 나노 계측 기법, 나노물질 제조 기 ",
    "syllabus_en": "This course provides basic quantum mechanics, statistical mechanics, and kinetic theory necessary so that mechanical engineering students (juniors and seniors) usually familiar only to the classical mechanics based on the assumption of the continuity of e"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH483",
    "교과목명": "로봇공학",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": " 로봇 머니퓰레이터와 이동로봇의 해석 및 설계에 대한 기본을 강의한다. 로봇기구학(동차변환 및 역기구학, 속도기구학), 정역학, 동역학(순동역학 및 역동역학), 궤적계획 및 생성, 오프라인 프로그래밍, 산업용 로봇의 액츄에이터 및 센서, 로봇 제어, 이동로봇의 구조 및",
    "syllabus_en": " Intriduction to analysis and design of robotic maniqulators and mobile robots. Topic include maniqulator kinematics(homogeneous transform, inverse and velocity kivematics), statics, dynamics (forward and inverse dynamics), trajectory planning and generat"
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH492",
    "교과목명": "자동차공학",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "종합적사고력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "MECH498",
    "교과목명": "학부논문연구",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 4,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "기계공학부",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목에서는 학부학생들로 하여금 직접 연구를 수행하고, 학위논문을 쓰게 하여 연구에 대한 이해를 높이고 학위논문작성법을 익히게 한다. _x000D_\n",
    "syllabus_en": "In this course, undergraduate students have a chance to do research and to write their theses. They can understand more about research and learn how to write a thesis._x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "NEIK424",
    "교과목명": "열에너지변환공학",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "에너지신산업",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "신재생에너지 또는 미활용 에너지 기술 기반으로 생산된 열에너지를 더 유용한 열에너지로 변환할 수 있는 에너지변환시스템의 이해",
    "syllabus_en": "Understanding of thermal energy conversion systems using renewable energy or waste energy sources."
  },
  {
    "구분": "전공인정",
    "학수번호": "EGRN103",
    "교과목명": "창의설계",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 2,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "공과대학",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "공과대학에 입학한 학생들에게 창의성의 개념과 창의적 사고과정을 교육하고, 창의성에 바탕하여 도출된 기본적인 아이디어를 형성화하고 설계하여 간단한 재료와 도구로 제작하게 해 봄으로서 향후 접하게 될 전공과목에 대한 흥미를 유발하고 종합설계에 필요한 기본적인  ",
    "syllabus_en": "This course is to teach new students the concept of creativity and how to approach in creative way. Students will find interest in their majors through turning their ideas into actual products using simple materials and gadgets.  "
  },
  {
    "구분": "전공인정",
    "학수번호": "EGRN242",
    "교과목명": "데이터학습과지능",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "전공지식",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "공과대학",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "기계학습 이론과 전문기술은 현대 데이터과학 응용에서 결정적인 역할을 하며, 다양한 분류, 회귀모델, 군집화, 차원축소, 강화학습 그리고 딥러닝을 포함합니다. 기계학습 문제와 관련 전문기술에 대한 큰 그림에 대해 이해하고 문제해결에 활용할 수 있도록 합니다. 이 강 ",
    "syllabus_en": "Theories & techniques in machine learning plays a crucial role in modern data science applications and includes the topics such as classification, regression models, clustering, dimension reduction, reinforcement and deep learning. Understanding of the bi"
  },
  {
    "구분": "전공인정",
    "학수번호": "EGRN332",
    "교과목명": "기술과창업",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "문제해결능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "공과대학",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공인정",
    "학수번호": "EGRN430",
    "교과목명": "공학인턴십Ⅰ",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 6,
    "시간": 0,
    "전공역량": "문제해결능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "공과대학",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "인턴쉽프로그램을 통해 수업에서 배운 이론을 실제로 적용하는 기회를 제공한다.",
    "syllabus_en": "This Internship gives senior students the opportunity to integrate theory learned in the classroom with practical application and skills development."
  },
  {
    "구분": "전공인정",
    "학수번호": "EGRN440",
    "교과목명": "공학인턴십Ⅱ",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 9,
    "시간": 0,
    "전공역량": "문제해결능력",
    "대학": "공과대학",
    "학과": "기계공학부",
    "개설학과": "공과대학",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "인턴쉽프로그램을 통해 R&D 분야와 같은 다양한 공학 현장에서 이론과 기술적 사항들을 실제 적용하는 기회를 제공한다.",
    "syllabus_en": "This internship is to provide opportunities to senior students that they can apply theoretical principles and practical techniques to real-world through participating in various engineering fields such as high-tech industry and R&D."
  }
]
