[
  {
    "구분": "교양필수",
    "학수번호": "GELI005",
    "교과목명": "학문세계의탐구 I",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 교과목은 학습자 주도형 토론 중심 수업으로 다양한 학문 세계를 탐구하며 비판적·창의적·융합적 사고 능력을 배양하는 것을 목적으로 한다. 학문세계의탐구Ⅰ은 토론과 협업을 통해 인간을 이해하고 가치를 탐구하는 교양필수 과목이다.",
    "syllabus_en": "The course explores the academic world across various disciplines and aims to cultivate critical, creative, and convergent thinking competencies with learner-driven, discussion-based instruction._x000D_\nExploration of the Academic World I is a General Education"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEWR002",
    "교과목명": "글쓰기",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "<글쓰기>는 ‘글쓰기의 기초’를 훈련하는 과목으로, 대학 수학 능력의 기본이 되는 사고력과 자기 표현력을 기르는 것을 목표로 한다. 학업 과정에서?요구되는 글쓰기의 특성을 이해하고, 이를 바탕으로 글쓰기를 체계적으로 훈련한다. <글쓰기>는 전교 공통의 과정으로 1학",
    "syllabus_en": "College Writing is an introductory writing course intended to advance students’ critical thinking skills and self-expression?basic skills required for college studies. In this course, students will gain a better understanding of the specific techniques n"
  },
  {
    "구분": "교양필수",
    "학수번호": "IFLS800",
    "교과목명": "Academic English I",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 2.0,
    "시간": 2.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 수업은 학생들의 학술관련 영어능력 및 의사소통능력을 향상시키는 데 목적이 있다. 학업 관련 모든 영역에서 활용 가능한 전반적인 영어능력 향상을 위해 학술 내용을 바탕으로 수업을 진행하며, 학생들이 실제 상황에서 구사할 수 있는 영어능력 향상에 초점을 맞춘 다 ",
    "syllabus_en": "The objective of this course is to enhance students’ communicative competence in English. Academic content is covered to improve overall proficiency in all areas of English communication as it relates to academic studies. Basic language skills are develo"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS007",
    "교과목명": "[진로창업]1학년세미나 I",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.0,
    "시간": 1.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅰ은 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 대학생활에 적응하고 대학생으로서 진로(연구, 취업, 창업)를 설계할 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여 등으로 ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, which provides fitting in university and career explorations. It includes academic advising, counseling with professors, seminars or special online lectures by KU fa"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS008",
    "교과목명": "[진로창업]1학년세미나 I",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.0,
    "시간": 1.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅱ는 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 학교에 대한 소속감을 강화하고 창직 및 창업 등의 진로 방향성을 고민해볼 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여  ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, offering mentorship and guidance in career directions such as entrepreneurship. It includes academic advising, counseling with professors, seminars, and special onli"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT002",
    "교과목명": "[진로창업]SW프로그래밍의기초",
    "학년": 1,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목은 컴퓨팅 사고와 프로그래밍의 기본 원리를 소개하는 과정이다. 소프트웨어의 근간이 되는 프로그래밍 언어에 대한 체계적인 이해를 바탕으로, Python 언어를 통해 기본 문법, 데이터 구조 및 제어 구조의 핵심 개념을 학습한다. 학생들은 이 과목을 통해 프로그래밍",
    "syllabus_en": "This course introduces the fundamental principles of computing thinking and programming. Building on a systematic understanding of the programming languages that form the foundation of software, students will learn essential concepts of syntax, data struc"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT003",
    "교과목명": "[진로창업]데이터과학과인공지능",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "_x000D_\n이 과목은 데이터를 다루고 분석할 수 있는 역량과 인공지능 기술을 이해하고 자기의 일에 활용할 수 있는 방법을 학습하는 과정이다. 기초적인 데이터과학 및 인공지능 핵심 개념을 학습하고, 각 계열별 특성에 맞는 데이터를 활용한 실습을 통해 실제 데이터를 다루고 인",
    "syllabus_en": "This course aims to develop the ability to handle and analyze data, understand artificial intelligence technologies, and learn how to apply them in one's field of work. It covers fundamental concepts of data science and artificial intelligence, and throug"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEBT001",
    "교과목명": "[진로창업]생명과학의세계",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": null,
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": null,
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "생명과학의 세계는 생명공학의 기초 지식과 생명현상을 이용한 융복합 기술의 다양한 사례를 살펴봄으로써 변화하는 미래 환경을 대비하고 선도할 수 있는 융합적 사고를 함양하는 강좌이다.",
    "syllabus_en": "This is a course that fosters convergent thinking to prepare for and lead the changing future environment by examining basic knowledge of biotechnology and various examples of convergence technologies using life phenomena."
  },
  {
    "구분": "전공필수",
    "학수번호": "PSYC201",
    "교과목명": "심리학의기초I",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "‘심리학의기초II’와 함께 심리학 전공자를 위한 심리학 전반을 소개하는 기초강의이다. ‘심리학의기초I’에서는 인간의 사고와 행동을 미시적이고 자연과학적 관점에서 다루는 심리학의 하부 분야들을 집중적으로 다룬다. 구체적으로 신경생리학적 기초, 감각 및 지각, 학",
    "syllabus_en": "This course provides basic apporaches to human behavior based on psychological theories. It is recommended that student who major in psychology take this course first. Topics in ‘Fundamentals of Psychology I’ Include biological perspectives, sensation a"
  },
  {
    "구분": "전공필수",
    "학수번호": "PSYC202",
    "교과목명": "심리학의기초II",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "'심리학의 기초 I'와 함께, 심리학 전공자를 위한 심리학 전반을 소개하는 기초강의이다. '심리학의 기초 II'에서는 인간의 사고와 행동을 미시적이고 자연과학적 관점에서 다루는 심리학의 하부 분야들을 집중적으로 다룬다. 구체적으로 발달과 성격, 사회, 임상, 상담심리 ",
    "syllabus_en": "This course completes the fundamentals of psychology course. It is recommended that students who jamor in psychology take this course as well as PSYC201. Topics in 'Fundamentals of Psychology II' include soial behavior, abnormal behavior, indsutrial psyco"
  },
  {
    "구분": "전공필수",
    "학수번호": "PSYC209",
    "교과목명": "초급심리통계",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "심리학의 과학적 연구내용과 방법을 이해하는데 필요한 통계 조사 방법 및 이론을 소개한다. 기본 통계 개념, 각종 자료의 특성과 기술통계, 통계 분포를 이용한 가설 검증 등을 다룬다. 심리 통계 이론 및 실스블 통해 통계 분석, 프로그램 운용 방법, 자료 분석 방법, 결과",
    "syllabus_en": "This course introduces statistical analytic methods essential in psychological research and theory. It deals with basic statistical concepts, virous kinds of data, descriptive analyses, and hypothesis testign. students will study real analyese of spycholo"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC216",
    "교과목명": "학습심리학",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "인간과 동물의 학습과 기억에 관여하는 원리, 이론 및 중요한 연구문제를 소개한다. 다양한 종류의 학습과 기억을 이해하고, 계산신경학적 모델 및 신경생물학적 기반을 공부한다. 또한 기초적인 연구결과를 다양한 임상현장 및 일상생활에 적용할 수 있도록 창의적으로 사고",
    "syllabus_en": "This course offers critical analysis of various mechamnisms of learning and memory. Theories of calssical and operant conditoning and their applicaions are discussed."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC220",
    "교과목명": "심리학연구와활용",
    "학년": 1,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "심리학적 지식이 만들어지는 연구과정에 대한 전반적인 지식과 그 지식이 사회에 기여하게 되는 응용되는 과정을 배우고 경험한다. 이를 통해 심리학이 사회에서 가지는 의미와 그 발전방향에 대한 인식을 논의한다. 학생들의 향후 진로와 교육목표를 설정하는데 기여할 것으",
    "syllabus_en": "This course provides an opportunity to participate in research procedure and application of psychological knowledge. Students learn how psychological research is conduncted and how psychological knowledge is applied to daily lives. This course aims to hel"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC221",
    "교과목명": "감각및지각심리학",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "감각 지각과 연관된 철학적, 생물학적 제문제들의 분석과 함께, 최신 지각 이론과 연구들을 소개한다. 이 수업을 통하여 학생들은 생물이 환경 속에서 사물과 사건에 관한 정보를 획득하고, 처리하며, 활용하는 방법에 대해 배운다. 시연을 포함한 강의와 실험 방법을 통해  ",
    "syllabus_en": "The relationship beween the physical stimuli and related sensation will be studied. And illlusion. perceptual constancy, and perceptual organization occurring during form, motion. and event pereption will be studied, demonstrated, and experimented."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC224",
    "교과목명": "기억심리학",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "인간의 학습이 이루어지는 원리를 인간정보처리론적인 입장에서 이해하고 학습의 결과로 생기는 인간 기억의 특성과 원리를 이해한다. 또한 효과적인 학습이 일어나기 위한 조건이 무엇인지를 다룰 것이다",
    "syllabus_en": "Human learning and memory mechanism will be studied. Components of human memory, representation code in short-term and long term memory, and methoeds of memory enhancement will be discussed."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC225",
    "교과목명": "인공지능의심리학",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "감각 및 지각, 강화학습, 신경망 등의 자연지능 원리에 기반한 인공지능 알고리듬을 이해하고 이를 통해 문제를 해결할 수 있는 실질적인 역량을 학습한다. 기본적인 컴퓨터 프로그래밍 훈련을 제공한다.",
    "syllabus_en": "This course introduces machine learning algorithms based on perception, reinforcement learning and neural network theory and teaches basic programming skills to implement the algorithms for problem solving  ."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC231",
    "교과목명": "성격심리학",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "성격심리학은 개인의 성격과 개인들 간 차이를 연구하는 분야이다. 성격은 개인이 가지고 있는 역동적으로 조직화된 개인의 특징 세트로서 개인의 인지, 동기, 다양한 장면에서의 행동에 영향을 준다.",
    "syllabus_en": "To study personalities that characterize human behavior and individual differences. Major theories of personality formation and development will be reviewed."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC232",
    "교과목명": "임상심리학",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "임상심리학의 역사, 이론적 틀, 전망 및 쟁점들을 알아보고, 과학과 임상실무가 어떻게 통합되는지 살펴 보고, 임상심리학의 주요영역인 심리평가, 심리치료, 연구의 세부내용 및 현황을 학습한다.",
    "syllabus_en": "To review the history. theoretical frame, prospective, and issues in clinical psychology. Testing, psychotherapy. studies of clinical psychology will be studied."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC236",
    "교과목명": "심리검사 ",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "심리적 특성의 측정방법의 기초와 다양한 심리검사에 대한 기본적 이해에 초점을 둔다. 심리검사에 있어서 요구되는 심리측정적 특성과 인지, 정서, 성격을 측정하는 심리검사 도구들을 소개한다.",
    "syllabus_en": "To introduce theoretical backgrounds and charateristics of various psychological testings, and to learn how to use in practice. "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC241",
    "교과목명": "산업심리학 ",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "조직 내에서의 효율적 인사관리를 위해 여러 가지 심리학 지식을 직원선발, 배치, 평가에 응용하는 방법을 개관한다.",
    "syllabus_en": "This class covers the psychological knowledges to employee selection, placement and appreisal for efficient human resource management in organizations. "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC242",
    "교과목명": "조직심리학",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "조직에서의 리더십, 직무동기 및 직무만족 등에 영향을 주는 심리학적 요인을 이해하도록 한다.",
    "syllabus_en": "This calss enables students to understand the psychological factors affecting leadership, job motivation and job satisfaction in  organizations "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC271",
    "교과목명": "생물심리학 ",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "생물심리학은 인간과 동물의 행동을 통제하는 생물학적 메커니즘을 규명하는 학문이다. 신경세포 및 신경계의 기본적인 구조와 기능을 공부하고, 감각 및 지각 시스템이 뇌에서 정보를 처리하는 과정과 운동의 신경생리학적 메커니즘을 이해한다.",
    "syllabus_en": "Biopsychlogy is an interrdisciplinary science which investigates biological mechanisms underlying human and animal behavior. Through this course students should be able to understand how the sensory and perceptual system process information in the brain a"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC275",
    "교과목명": "발달심리학",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "출생부터 청년기에 이르는 행동의 성장과 발달에 영향을 미치는 요인들과 기제 그리고 각 발달단계별 행동특징을 다룬다. 신체적 발달뿐만이 아니라 인지적, 사회적 및 성격발달과 이론들에 역점을 둔다.",
    "syllabus_en": "This course provides a general overview of posychological theories on human biological cognitive, emotional, social and cultural development, from a life-span perspective, covering infancy through adults."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC277",
    "교과목명": "사회심리학 ",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "사회심리학에서 최근에 연구되고 있는 각 분야의 이론들을 경험적인 실습을 통해 이해하고자 한다. 개인과 사회적 환경과의 관계를 탐구하며, 사회적 맥락에서 인간의 사고와 행동에 미치는 사회환경적 요인에 대한 심리학적 이론들을 개관한다.",
    "syllabus_en": "This course provides a general overview of the major theories in social psychology through empirical pratice and research. It covers various issues in thinking processes in social context, human relations, group dynamics, and cultrual interaction."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC279",
    "교과목명": "자연지능의계산신경과학",
    "학년": 2,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "연합 학습, 주의, 신경가소성 원리에 기반한 계산신경과학적 모델 구축의 원리와 실습을 통해 정량적 사고와 도구를 학습한다.",
    "syllabus_en": "This course introduces theory and practice for computational modeling of associative learning, attentional process and synaptic plasticity."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC306",
    "교과목명": "심리데이터과학의기초",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC317",
    "교과목명": "성격의수준과영역",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "무엇이 어떤 사람을 그 사람으로 만드는가? 어떻게 하면 누군가를 온전히 이해할 수 있는가? 이 수업을 통해 여러 수준을 통해 개인 간의 차이를 구분하고, 이러한 개인 간의 차이가 드러나는 영역에 대해 이해한다.",
    "syllabus_en": "What makes a person that person? How can we fully understand a person? In this class, we differentiate different levels of individual differences and understand domains where those differences are revealed."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC319",
    "교과목명": "AI기법을이용한인간행동과마음의탐구",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "AI는 기계에게 지능을 부여하는 학문이며, 기계가 지적이려면 일정한 운영 원리를 따라야 한다. AI기법을 이용한 인간행동과 마음의탐구에서는  AI에서 다루고 있는 원리를 바탕으로 인간의 지적 행동을 새로운 입장에서 접근하고 궁극적으로는 지적 행동을 발생시키는 일반 ",
    "syllabus_en": "AI tries to understand and implement intellectual thought and behavior through logical algorithms. In the lecture of “human behavior and mind based on AI approach”, universal principles on intelligence will be considered in attempt to understand human’"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC320",
    "교과목명": "동기의뇌신경과학",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "인간 및 동물은 특정 목적을 위하여 종-특유 행동을 보인다. 이러한 목적 지향적 행동을 유발하는 내외적 동기요인들을 이해하고, 어떤 뇌 영역이 개별 목적행동 또는 동기요인과 관련된 중요한 기능을 하는지 알아본다.",
    "syllabus_en": "Humen and animals engage in behavior that is directed toward or away from particular stimuli for survival such as food and predators. This course addresses internal needs and external factors that drive motivated behavior as well as brain circuits and neu"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC321",
    "교과목명": "인지심리학",
    "학년": 2,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "현상의 인식, 기억, 주의집중, 언어의 산출과 이해, 지식의 표상, 사고 등의 인지 과정에 관한 주요개념, 발견 및 이론적 모형을 소개하고 주요 인지현상에 대한 컴퓨터 모사실험의 경험을 제공한다.",
    "syllabus_en": "Patterns recognitions, attention, human learning and memory, knowledge acquisition and categorization, language comprehension and production, reasoning and problem solving will be studied  and students will participate in cognition experimets for demonstr"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC326",
    "교과목명": "언어심리학",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "인지심리학, 언어학 및 인공지능의 관점에서 본 언어정보처리 과정에 관한 최근의 이론과 연구를 소개하고 논의한다.",
    "syllabus_en": "The principles of language comprehension, language production, and language acquisiion and learning will be studied. And how these principles are represented in the brain and how these principles can be applied to other areas such as language education an"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC329",
    "교과목명": "아동이상심리학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 강의는 아동기와 청소년기 정상 발달과 발달 장애에 관련한 임상심리학적 지식들을 제공합니다. 발달 장애의 진단, 병인 증상의 발현 과정 및 예방 등에 관련한 이론적인 이해를 높이는 것을 목적으로 합니다. 이를 통해 개인은 학문 및 직업적 장면에서 응용가능한 지식 ",
    "syllabus_en": "This course offers an advanced intorduction to the exciting fields of child and adolescent psychopathology. We will review countemporary theoretical approaches to understanidng the phenomenology. diagnosis, etiology developmental course, and prevention of"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC330",
    "교과목명": "신경다양성",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 강의는 신경다양성 (Neurodiversity)에 대한 최근 동향과 지식을 제공합니다. 본 강의를 통해 학생들은 자폐증, ADHD 및 학습 장애와 같은 특정 발달 장애가 개인이 세상을 경험하고 해석하며, 타인과 상호작용 하는 방식들에 어떤 영향을 미치는지에 대한 이해를 높이게 ",
    "syllabus_en": "This course offers an advanced introduction to the exciting field of Neurodiversity. In this course, students will learn about how certain developmental disorders such as autism, ADHD, and learning disability affect how individuals experience, interact wi"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC331",
    "교과목명": "이상심리학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "성인의 이상행동을 심도 있게 이해하고, 나아가 신뢰로운 평가방법과 효과적인 치료법을 살펴보는 것을 주요 목표로 한다. 이상행동은 정상행동과 어떻게 다르고, 이상행동은 어떻게 진단되고 분류되는지, 그리고 이상행동은 어떻게 치료될 수 있는지를 개관한다. 이와 관련 ",
    "syllabus_en": "To understand adults abnormal psychology in depth, and furthermore to study reliable testing methods and therapies. Anxiety disorder, personality disorder, mood disorder, schizophrenia etc. will be mainly discussed. related case studies, empirical studies"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC333",
    "교과목명": "집단상담",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "집단 상담의 기본 개념과 과정의 이해에 초점을 둔 강의이다. 구체적으로, 집단에 기초한 심리적 개입방법들의 유형을 학습하고, 집단상담 과정에서 나타나는 단계별 특성 및 상담자의 목표를 이해하고, 실제 집단 상담에 적용하기 위한 전략을 탐색한다.",
    "syllabus_en": "This course will provide undergraduates with various theories and knowledges of a groop counselling, and actually expericene the process of group counselling, and discuss."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC334",
    "교과목명": "상담및심리치료이론",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "상담과 심리치료의 주요 이론들을 다룬다. 각 이론들의 성격 발달과 부적응에 대한 관점을 학습하고 이에 근거한 심리적 개입 방법들도 함께 살펴본다. ",
    "syllabus_en": "This course deals with the major theories of counseling and psychotherapy. Students will learn the perspectives of personality development and maladjustment as well as psychological interventions in each theoretical group. "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC335",
    "교과목명": "인지치료",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 강의는 인지치료에 대한 개론 수업입니다. 강의, 영상 및 사례를 통해 인지치료의 이론적 기반과 우울 및 불안을 다루는 실제 치료적 전략을 제공하고자 합니다.",
    "syllabus_en": "This course is an introduction to cognitive therapy. Lectures, films, and case studies will be used to provide you with an understanding of the theoretical framework for cognitive therapy as well as therapeutic strategies for managing depression and anxie"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC336",
    "교과목명": "성격의측정과활용",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "개인 간의 차이는 자신과 다른 사람을 이해하는 데 중요하다. 나아가, 직원 선발 등의 도구로 사용될 수도 있다. 이 수업을 통해 개인 간의 차이를 어떻게 측정하고 실생활에서 어떻게 응용할 수 있는지 살펴본다.",
    "syllabus_en": "Individual differences are important for understanding oneself as well as others. Furthermore, they can be used as a tool for personnel selection. In this class, we learn how to assess individual differences and how to apply them in real life contexts."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC337",
    "교과목명": "정서와정신건강",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "1. 심리치료와 관련된 정서처리 이론을 배운다._x000D_\n2. 정서도식과 정서에 대한 태도를 평가할 수 있다._x000D_\n3. 정서적 고통을 다루는 근거-기반의 심리치료적 접근을 배운다",
    "syllabus_en": "1. To learn emotion theories in psychotherapy._x000D_\n2. To assess emotional schema and attitudes towards emotions _x000D_\n3. To learn evidence-based psychotherapeutic approaches to emotional distress."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC338",
    "교과목명": "정서의뇌신경과학",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "정서는 우리의 일상생활 뿐만 아니라 생존에까지 영향을 미치는 중요한 요소이다. 이 과목은 정서와 감정에 관한 이론들을 소개하고, 현재 신경과학 분야에서 정서와 관련된 주요 연구주제 및 쟁점 사항에 대한 강의를 진행한다. 또한 특정 정서를 유발하는 뇌 영역들에 대해",
    "syllabus_en": "Emotion is integral to every aspect of our psychology and behavior. This course reviews theories of emotion and current research topics in the field of affective neuroscience. This course also addresses neural substrates that regulate emotional responses."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC339",
    "교과목명": "빈곤의심리학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "빈곤이 개인의 정신건강에 미치는 영향을 살피고 심리치료, 미디어, ICT 등의 기술을 결합하여 낮은 사회경제적 위치에 있는 개인의 안녕감에 대한 심리적 완충장치를 제안한다.",
    "syllabus_en": "This course is designed to explore how poverty affects individuals and develop a way to intervene in individuals under disadvantaged socioeconomic status using psychotherapy, media, and ICT."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC346",
    "교과목명": "진로발달의평가",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "생애 진로발달의 관점에서 발달적 단계에 따라 중요한 진로 발달 지표를 평가하는 심리측정 도구들을 교육한다. 진로발달을 평가하는 심리측정 도구들의 특징과 기저 이론에 대해 학습함으로써 진로발달 평가도구의 활용성에 대해 이해한다. ",
    "syllabus_en": "This course teaches psychological measurement tools which assess important career development indicators from the perspective of life span career development. Students are expected to learn the major characteristics of career development assessments and t"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC350",
    "교과목명": "창의디자인",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "디자인은 물리적 대상으로서의 상품의 개발, 생산 및 마케팅과의 연관성을 중심으로 논의되어 왔지만, 최근 그것을 사용하는 사람과 연관된 관심이 증가하고 있다. 본 교과는 디자인의 최적화와 평가에 연관된 심리적 차원들에 대한 기초적인 이해를 제공한다. 학생들은 이러",
    "syllabus_en": "Design has been discusses mainly in terms of creation, development, production and marketing of physical objects. Recently, however, the human (user) aspect of design gains a surge of interest. This course aims to providing basic understanding of psycholo"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC353",
    "교과목명": "소비자광고심리학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "현대 사회에서 소비의 심리학적 의미와 기능을 이해하고, 소비자의 의사결정, 구매과정, 제품사용행동 과정이 어떻게 진행되는지 심리학적으로 논한다. 특히 소비자가 광고 및 마케팅 메시지를 어떻게 처리하고 해석하는가의 심리학적 기제를 이해하고 최근의 마케팅 동향에 ",
    "syllabus_en": "This course is designed to help students understand the psychology of persuasion and consumer behavior as they relate to marketing communications. This course will provide students with an overview of the key psychological concepts and theories and how th"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC358",
    "교과목명": "선택의뇌과학",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "이 과목에서는 신경과학분야에서 최근에 새롭게 등장한 의사결정 신경과학 그리고 신경경제학이라는 분야에 대해 소개한다. 강의내용으로는 의사결정관련 뇌기제의 핵심 요소인 도파민 기능, 접근 및 회피회로, 가치계산, 안정성 대 유연성의 딜레마 등이 포함된다. 또한, 의",
    "syllabus_en": "This course introduces a new field of decision neuroscience and neuroeconomics. The lectures will include key topics in decision neuroscience, such as dopamine functions, approach vs. avoidance circuits, value computation, and stability-plasticity dilemma"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC360",
    "교과목명": "행동경제학",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "이 과목에서는 행동경제학과 의사결정 심리학 분야의 대표 연구들과 핵심이론들을 소개한다. 강의내용으로는 전망이론, 휴리스틱과 편향, 자기통제, 그리고 사회적 의사결정 등의 주제들이 포함된다. 또한, 이 강의를 통해 수강생들은 의사결정의 심리학적 그리고 경제학적  ",
    "syllabus_en": "This course introduces the representative studies and core theories in the fields of behavioral economics and decision psychology. The lectures include topics such as prospect theory, heuristics and biases, self-control, and social decision-making. In add"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC370",
    "교과목명": "자기와정체성",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "심리학 연구의 기본 연구 단위는 개인이고, 그 점을 고려할 때, 자기와 정체성은 인간의 심리를 이해하는 데 필수적인 개념이다. 이 수업을 통해 자기와 정체성이 가지고 있는 여러 측면에 대해 논의한다. ",
    "syllabus_en": "The basic unit of psychological studies is an individual. Given that, self and identity are essential concepts that help us to understand human mind. In this class, we discuss several facets that self and identity have. "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC371",
    "교과목명": "문화의형성과이해",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "이 수업은 문화심리학의 기초가 되는 영역으로, 문화가 어떻게 형성이 되고 변화하는지, 그리고 인간은 어떻게 문화적 존재가 되는 지에 대한 과정을 다룬다. ",
    "syllabus_en": "This course covers the basics of cultural psychology. We focus on the evolution of culture and cultural change, and how humans become cultural being."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC372",
    "교과목명": "문화의적응과교류",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "비교문화 심리학 연구 결과를 살펴보고 다양한 문화적/사회적 집단의 차이를 이해함으로써 다원화된 사회에서의 적응과 활발한 교류를 모색한다. ",
    "syllabus_en": "This course examines the empirical findings of cross-cultural and gender studies, and by doing so, aims to foster greater understanding and communication among diverse members of the society. "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC373",
    "교과목명": "인간관계의이해",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 수업은 인간관계를 이해하고 개선하기 위한 지식을 함양하는 데 목적을 두고 있다. 인간은 매우 오묘하고 복잡한 조재이며, 그렇기 때문에 사람과 사람 사이의 관계를 이해하고 갈등을 다루는 것은 매우 난해한 문제이다. 이에 본 수업에서는 다양한 인간관계 양상을 다루",
    "syllabus_en": "This course aims to acquire knowledge to understnad and improve human relationships. Humans are very mysterious and complex beings, so understnading the relastionship between people and dealing with conflict are very difficult. Therefore, students in this"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC374",
    "교과목명": "심리학을위한프로그래밍",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 교과목에서는 심리학 연구에 필요한 프로그래밍 기술을 학습한다. Python 프로그래밍 언어를 이용해, 기억, 지각, 의사 결정 연구의 고전적인 실험 패러다임들을 직접 프로그래밍하고, 실험 결과를 분석한다. 이 과정에서 Python의 구문, 함수 및 알고리즘 패턴들을 학습 ",
    "syllabus_en": "The aim of this course is to acquire programming skill for psychological studies. Using Python language, we will code three classic psychological experiments about memory, perception, and decision making. We will also learn how to use control statements a"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC377",
    "교과목명": "행동치료",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "1. 행동치료의 역사를 배운다._x000D_\n2. 행동치료의 핵심 치료 요소/원리를 배운다_x000D_\n3. 근거기반의 행동치료적 접근을 배운다",
    "syllabus_en": "1. To learn histories of behavioral treatment._x000D_\n2. To learn core therapeutic components and principles of behavioral treatment _x000D_\n3. To learn evidence-based behavioral treatment."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC379",
    "교과목명": "성격장애",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "성격 및 성격장애와 관련한 역사적, 임상적, 현대적 이론과 연구, 쟁점들을 다룬다. 본 강의를 통해 주요 성격장애 각각에 해당하는 증상, 병인론적 고려점, 치료 패러다임을 검토하게 될 것이다.",
    "syllabus_en": "This course explores historical, clinical, and contemporary theories, findings, and issues regarding the personality and personality disorders. Each major personality disorder, symptoms, etiological considerations, and therapeutic paradigms will be examin"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC382",
    "교과목명": "뉴미디어심리학",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "디지털 미디어의 발달로 인간 간의 커뮤니케이션 및 정보 확산 방식이 크게 변화하고 있다. 뉴미디어의 보급과 SNS 중심의 소통문화에 따른 인간의 라이프스타일과 트렌드 변화를 분석한다.",
    "syllabus_en": "Development of digital media have made a major progress in communcation between individuals and information exchange paradigms. This course provides a voerview and analyses of human life styles and trends in relation with new media and SNS communication."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC390",
    "교과목명": "인간의비합리성",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "인간이 사회적 맥락 속에서 보여주는 비합리성에 대한 사회심리학적 관점들과 연구들을 개관한다. 대인지각, 사회적 귀인판단, 선택과 의사결정 들의 사회적 사고과정에서 비합리성의 본질, 원인, 원리 등을 교육한다.",
    "syllabus_en": "The purpose of this course is to provide a general overview of social psychological perspectives and theories to explain human irrational behaviors and thoughts in social context. This course provide essential nature, causes, and principles of human irrat"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC393",
    "교과목명": "정서의이해",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "정서란 무엇인가? 정서는 어떠한 기능을 갖는가? 이 수업에서는 정서의 고전적, 현대적 이론을 살펴보고, 현대 심리학에서 정서를 연구하는 접근을 이해해본다. 이 수업은 사회심리학, 문화심리학에서 다루는 정서연구의 기초를 제공한다.",
    "syllabus_en": "What is an emotion? What functions do emotions serve? In this course, we will examine basic theories of emotions and examine different approaches in viewing emotions. This course will provide a groundwork for further studies in social and cultural psychol"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC394",
    "교과목명": "정서와관계",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "정서는 관계적, 사회적 맥락에서 기능을 수행한다. 이 수업에서는 다양한 관계적, 사회적, 문화적 맥락에서 기능하는 정서의 다양한 측면들을 현대 심리학적 연구들의 결과들을 통해 이해해본다.",
    "syllabus_en": "Emotions have been found to serve functions in relational and social context. In this course, we will investigate psychological research on emotions as they unfold in relational, social, and cultural context."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC396",
    "교과목명": "심리학과정보처리이론",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "인간이 정보를 처리하는 과정에 대해 시각 체계를 중심으로 알아본다. 시지각 정보 처리 과정을 부호화, 표상, 해석 과정으로 세분화하여, 망막에서부터 뇌에 이르는 시각 시스템에서 어떤 연산이 이루어지는지를 살펴본다. 이를 위해, 시지각과 관련된 정신물리학 연구, 생 ",
    "syllabus_en": "In this course, we will study how information is encoded, represented, and interpreted in human visual system. Findings from neuroscience, psychophysics, computational modeling and simulation studies will be introduced. For better understanding for visual"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC398",
    "교과목명": "약물과중독행동",
    "학년": 3,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC399",
    "교과목명": "리더십의심리학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "리더십에 관한 심리학 이론들을 학습한다. 이를 위해 먼저 리더십에 관한 주요 심리학적인 개념들을 살펴보고, 이를 바탕으로 정치, 경영, 교육, 종교, 문화, 학문 및 가정에 이르는 다양한 사회 분야에서의 실제 사례들을 분석한다. 그리고 이러한 학습을 바탕으로 실습을  ",
    "syllabus_en": "To learn psychological theories about leadership. We first look at the major psychological concepts of leadership and, based on them, actual cases in various social fields such as politics, management, education, religion, culture, academic and family are"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC422",
    "교과목명": "인지신경과학",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "지각, 운동, 학습, 기억, 정서, 주의, 의식 및 사회 인지를 포함하는 인간의 인지 과정과 그 기반을 이루는 신경 과정들을 탐색한다. 기초 신경해부학을 소개하며, 인지 기능의 뇌 기반에 대한 추론을 가능하게하는 다양한 신경과학적 방법들에 대해 논의한다.",
    "syllabus_en": "The component of human cognition and cognition mechanism willl be inroduced. The correlation of the brain damage and cognitive disorder will be classified and the effctive method of the cognitive rehabilitation will be introduced. "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC423",
    "교과목명": "주의와반응선택",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "본 과목은 주의, 반응선택의 과정 그리고 인간의 운동 제어에 관한 주제를 다룬다. 특히, 어떻게 과제 관련된 정보가 선택되어지며 제시된 자극에 기초하여 어떻게 적절한 반응이 일어나는지 그리고 인간의 운동 시스템의 기능들에 대해서 다룰 것이다.",
    "syllabus_en": "This course introduces researches on attention, response-selecton processes, and human motor control. Students will learn how task-relevant information is selected, how an appropriate response is made based on the identity of the present stimulus, and the"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC424",
    "교과목명": "심리학자율연구",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 6.0,
    "전공역량": "Schema&Scale",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 교과는 학생의 창의적이고 융합적인 문제해결 역량 강화를 위한 학생 중심의 프로젝트 기반 학습으로 이루어진다. 학생이 학문중심 혹은 실무중심의 연구주제를 설정하고 지도교수의 교육과 수퍼비전에 따라 연구 프로젝트를 수행한다. ",
    "syllabus_en": "This course provides project-based learning focusing on students’ research interests for developing creative and convergent competences in problem solving. Students are expected to select a academic or practical research topic and implement a project und"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC437",
    "교과목명": "예술심리학",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "예술은 가장 오래된 인간의 활동이자, 지각, 인지, 정서, 및 사회 문화 등 다양한 심리학의 주제와 연관되는 고차원적인 주제이다. 본 교과는 예술적 경험, 창작, 및 감상과 연관된 심리학의 오랜 분야 중 하나인 경험미학의 관점을 통해 예술에 대한 이해 뿐만 아니라 인간 ",
    "syllabus_en": "Art has been one of the oldest human activities in history, and it is a complicated topic related to various psychological issues including perception, cognition, emotion, culture and society. By taking the perspectives of empirical aesthetics, a classic "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC439",
    "교과목명": "사회신경과학",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "인간의 다양한 사회적 행동들의 기저에 있는 뇌과학적 원리에 대한 최신 연구들이 소개된다. 또한, 현대 사회와 밀접한 관련성을 보이는 뇌과학 분야의 최근 발전 동향에 대해 알아보고 이러한 뇌과학적 기술발전이 가까운 미래사회에 보여 줄 가능한 변화들에 대해 예측하고",
    "syllabus_en": "This course will introduce students to the latest research findings on the neural mechanisms underlying human cognitions and behaviors in various social domains. This class also discusses how diverse aspects of human society will be influenced by the adva"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC468",
    "교과목명": "한국인의심리의식특성",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Creativity&Culture",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "사회문화심리학적 관점에서 한국인의 심리적 특성을 교육한다. 동양인으로서의 기존의 사회심리학적 논의를 초월하여, 한국인을 이해하기 위한 최적의 심리학적 개념들을 이해하고, 그 관점에서 한국사회의 다양한 사회현상들을 논의한다.",
    "syllabus_en": "The purpose of this course is to provide social/cultural psychological approach to explain Korean cultural characteristic. This course provide psychological concepts and mechanisms optimal to understand Korean unique psychological processes and social phe"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC472",
    "교과목명": "소비자트랜드분석실습",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "최신 소비자 트랜드를 분석하고 실제 기업의 브랜드 사례를 통해 마케팅 커뮤니케이션 전략 수립과정에 참여하고 경험한다. ",
    "syllabus_en": "This course will provide students with an overview of consumer trends and marketing. The ultimate goal of this course is to provide students with a sound understanding of the dynamics of the psychological mechanism underlying the processes of branding inc"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC479",
    "교과목명": "정신사회재활",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "1. 정신사회재활에 대한 목적과 철학을 이해한다._x000D_\n2. 정신사회재활의 전빈적 과정을 기술할 수 있다._x000D_\n3. 정신사회재활 단계별로 관련된 주요 치료적 접근과 이슈를 파악하고 해결책을 모색한다.",
    "syllabus_en": "1. To understand the mission and philosophy of psychiatric rehabilitation._x000D_\n2. To describe the overall psychiatric rehabilitation process._x000D_\n3. To identify key treatment approaches related to the phases of the psychiatric rehabilitation process."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC481",
    "교과목명": "뇌기능연구기법",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "이 과목에서는 최근 인지신경과학 분야에서 사용되고 있는 다양한 뇌기능 연구기법들을 소개한다. 강의내용으로는 생리적 반응 측정 기법, 뇌자극 기법, 뇌영상기법이 포함된다. 이 강의를 통해 수강생들은 다양한 뇌기능 연구기법들의 이론적 토대뿐 아니라 직접 특정 연구 ",
    "syllabus_en": "This course introduces various research methods for brain function that have recently been used in the field of cognitive neuroscience. The lectures will include the theoretical foundation of various brain function research techniques such as physiologica"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC483",
    "교과목명": "인간의동기",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "동기란 사람을 움직이는 힘이다. 이 수업을 통해 사람을 움직이는 생물학적, 감정적, 사회적, 인지적 요소들에 대해 살펴본다. 나아가 동기에 대한 심리학적 지식을 실제 삶의 맥락에서 적용할 수 있는지 논의한다.",
    "syllabus_en": "Motivation is what makes people act. In this class we discuss, different forces that initiate human behaviors, including biological, emotional, social, and cognitive forces. Furthermore, how to apply psychological knowledge on motivation to real life cont"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC491",
    "교과목명": "정서의심리학",
    "학년": 3,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "심리학에서 정의하는 정서와 정서이론을 바탕으로, 정서가 인간의 삶에서 어떠한 기능과 역할을 하는지 분석_x000D_\n정서의 인지적, 생물학적, 행동적 측면을 과학적으로 검증하는 실증 연구를 평가_x000D_\n정서 연구를 실제로 제안하고 이를 글과 구두로 공유하는 능력 함양",
    "syllabus_en": "This course aims to understand definitions and theories of emotions in psychological research_x000D_\nCurrent empirical studies on cognitive biological, and behivioral aspects of emotions will be investigated_x000D_\n"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC493",
    "교과목명": "사용자경험과심리학",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Mind&Machine",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "시스템과 상호작용하는 사용자의 특성을 고려하고, 사용자가 시스템 사용을 쉽고, 안전하고, 효율적으로 사용하며, 긍정적인 경험을 할 수 있도록 하기 위한 인간 중심의 디자인 원리를 다룬다.",
    "syllabus_en": "This course deals with basic principles of user-centered design, a process in which users' interaction with a system becomes easy, safe, efficient and fun."
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC495",
    "교과목명": "윤리와기술",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "인공지능, 사물인터넷, 머신러닝, 빅데이터 등으로 대표되는 4차 산업혁명 시대에 새롭게 등장하는 신기술 및 디지털미디어의 발전으로 인해 변화하는 인간의 삶과 윤리 문제에 대하여 논의하고 토론한다. ",
    "syllabus_en": "This course is designed to help students understand a variety of ethical issues in artificial intelligence, robotics, new media, and information technology. This course will provide students with an overview of the key psychological concepts and theories "
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC496",
    "교과목명": "공감의기술",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "대인관계의 질을 향상시키는 공감적 이해와 소통 기술의 심리적 모형을 학습한다. 사적인 관계에서의 공감적 소통과 전문적인 도움을 제공하는 관계에서의 공감 기술이 가지는 특징과 심리적 원리를 이해하고 공감적 이해 역량을 발달시킨다. ",
    "syllabus_en": "This course teaches psychological models of empathic understanding and communication skills which facilitate the quality of interpersonal relationships. It is designed to help students to understand the major characteristics and underlying psychological p"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC497",
    "교과목명": "성격과사회적상황",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC498",
    "교과목명": "현대사회의진로적응성",
    "학년": 4,
    "학기": 2.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1.5,
    "시간": 1.5,
    "전공역량": "Wellness&Wellbeing",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "현대사회의 일의 세계에서 나타나는 변화를 이해하고 이러한 변화에 적응하기 위해 필요로 되는 심리사회적 요인을 탐색한다. 비전통적인 진로 양상을 설명하는 진로모형들과 각 진로모형에서 강조되는 적응 자원과 기술을 이해한다.  ",
    "syllabus_en": "This course is designed to teach the changes in the world of work in the contemporary society and to explore psychosocial factors required for the adaptation to these changes. Students learn new career models that describe the non-traditional career patte"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC701",
    "교과목명": "심리학과창업",
    "학년": 4,
    "학기": 1.0,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "심리학과 창업은 창업 전반에 대한 이해를 습득하고 이를 바탕으로 심리학을 활용한 창업 아이디어 도출을 통해 최종 사업 계획서를 작성하는 과목이다. 심리학적 지식을 종합하여 우리 사회가 필요로 하는 새로운 서비스를 기획하고 팀별 맞춤형 교육과 멘토링을 통해 창업 ",
    "syllabus_en": "Psychology and Start-Up is a course in which students acquire an understanding of staru-up and preapre a business plan in the area of psychology. By synthesizing spychological knowledge their have learned, students plan new services that our society needs"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC703",
    "교과목명": "캡스톤디자인",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": 3.0,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "캡스톤디자인은 심리하과 전공과목에서 학습한 것을 바탕으로 사회가 요구하는 과제에 대해 학생들이 스스로 기획하고 종합적인 문제해결을 제안하는 과목이다. 팀 프로젝트를 기반으로 학생들이 주체적으로 문제를 정의하고 이를 해결할 창의적인 방안을 고안한다.",
    "syllabus_en": "Capstone Design is a course in which students plan and propose their own problem solving in response to socially requisite tasks based oh what they have learned in pschology. With other team members Students independently define problems and devise and cr"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC704",
    "교과목명": "심리학현장실습A1",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": null,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "표준현장실습은 학생들이 산업체에서 본인이 배운 심리학적 지식을 활용하여 실무를 경험하는 과정이다. 실용적인 직무 역량을 배양함과 동시에 본인의 역량과 적성을 탐색하며 전공 지식을 사회에 적용하는 경험을 할 수 있다.",
    "syllabus_en": "Standard Field Internship is a course in which students work in a company using psychological knowledge they have learned. Students can have a chance to cultivate job competencies as well as explore thier on competencies and aptitudes by applying their kn"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC705",
    "교과목명": "심리학현장실습A2",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3.0,
    "시간": null,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "표준현장실습은 학생들이 산업체에서 본인이 배운 심리학적 지식을 활용하여 실무를 경험하는 과정이다. 실용적인 직무 역량을 배양함과 동시에 본인의 역량과 적성을 탐색하며 전공 지식을 사회에 적용하는 경험을 할 수 있다.",
    "syllabus_en": "Standard Field Internship is a course in which students work in a company using psychological knowledge they have learned. Students can have a chance to cultivate job competencies as well as explore thier on competencies and aptitudes by applying their kn"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC706",
    "교과목명": "심리학현장실습B1",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 6.0,
    "시간": null,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "표준현장실습은 학생들이 산업체에서 본인이 배운 심리학적 지식을 활용하여 실무를 경험하는 과정이다. 실용적인 직무 역량을 배양함과 동시에 본인의 역량과 적성을 탐색하며 전공 지식을 사회에 적용하는 경험을 할 수 있다.",
    "syllabus_en": "Standard Field Internship is a course in which students work in a company using psychological knowledge they have learned. Students can have a chance to cultivate job competencies as well as explore thier on competencies and aptitudes by applying their kn"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC707",
    "교과목명": "심리학현장실습B2",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 6.0,
    "시간": null,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "표준현장실습은 학생들이 산업체에서 본인이 배운 심리학적 지식을 활용하여 실무를 경험하는 과정이다. 실용적인 직무 역량을 배양함과 동시에 본인의 역량과 적성을 탐색하며 전공 지식을 사회에 적용하는 경험을 할 수 있다.",
    "syllabus_en": "Standard Field Internship is a course in which students work in a company using psychological knowledge they have learned. Students can have a chance to cultivate job competencies as well as explore thier on competencies and aptitudes by applying their kn"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC708",
    "교과목명": "심리학현장실습C",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 9.0,
    "시간": null,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "표준현장실습은 학생들이 산업체에서 본인이 배운 심리학적 지식을 활용하여 실무를 경험하는 과정이다. 실용적인 직무 역량을 배양함과 동시에 본인의 역량과 적성을 탐색하며 전공 지식을 사회에 적용하는 경험을 할 수 있다.",
    "syllabus_en": "Standard Field Internship is a course in which students work in a company using psychological knowledge they have learned. Students can have a chance to cultivate job competencies as well as explore thier on competencies and aptitudes by applying their kn"
  },
  {
    "구분": "전공선택",
    "학수번호": "PSYC709",
    "교과목명": "심리학현장실습D",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 12.0,
    "시간": null,
    "전공역량": "Leadership&Link",
    "대학": "심리학부",
    "학과": "심리학부",
    "개설학과": "심리학부",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "표준현장실습은 학생들이 산업체에서 본인이 배운 심리학적 지식을 활용하여 실무를 경험하는 과정이다. 실용적인 직무 역량을 배양함과 동시에 본인의 역량과 적성을 탐색하며 전공 지식을 사회에 적용하는 경험을 할 수 있다.",
    "syllabus_en": "Standard Field Internship is a course in which students work in a company using psychological knowledge they have learned. Students can have a chance to cultivate job competencies as well as explore thier on competencies and aptitudes by applying their kn"
  }
]
