[
  {
    "구분": "교양필수",
    "학수번호": "GELI005",
    "교과목명": "학문세계의탐구I",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 교과목은 학습자 주도형 토론 중심 수업으로 다양한 학문 세계를 탐구하며 비판적·창의적·융합적 사고 능력을 배양하는 것을 목적으로 한다. 학문세계의탐구Ⅰ은 토론과 협업을 통해 인간을 이해하고 가치를 탐구하는 교양필수 과목이다.",
    "syllabus_en": "The course explores the academic world across various disciplines and aims to cultivate critical, creative, and convergent thinking competencies with learner-driven, discussion-based instruction._x000D_\nExploration of the Academic World I is a General Education"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEWR002",
    "교과목명": "글쓰기",
    "학년": 1,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "<글쓰기>는 ‘글쓰기의 기초’를 훈련하는 과목으로, 대학 수학 능력의 기본이 되는 사고력과 자기 표현력을 기르는 것을 목표로 한다. 학업 과정에서?요구되는 글쓰기의 특성을 이해하고, 이를 바탕으로 글쓰기를 체계적으로 훈련한다. <글쓰기>는 전교 공통의 과정으로 1학",
    "syllabus_en": "College Writing is an introductory writing course intended to advance students’ critical thinking skills and self-expression?basic skills required for college studies. In this course, students will gain a better understanding of the specific techniques n"
  },
  {
    "구분": "교양필수",
    "학수번호": "IFLS800",
    "교과목명": "Academic English I",
    "학년": 1,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 2,
    "시간": 2,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 수업은 학생들의 학술관련 영어능력 및 의사소통능력을 향상시키는 데 목적이 있다. 학업 관련 모든 영역에서 활용 가능한 전반적인 영어능력 향상을 위해 학술 내용을 바탕으로 수업을 진행하며, 학생들이 실제 상황에서 구사할 수 있는 영어능력 향상에 초점을 맞춘 다 ",
    "syllabus_en": "The objective of this course is to enhance students’ communicative competence in English. Academic content is covered to improve overall proficiency in all areas of English communication as it relates to academic studies. Basic language skills are develo"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS007",
    "교과목명": "[진로창업]1학년세미나Ⅰ",
    "학년": 1,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 1,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅰ은 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 대학생활에 적응하고 대학생으로서 진로(연구, 취업, 창업)를 설계할 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여 등으로 ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, which provides fitting in university and career explorations. It includes academic advising, counseling with professors, seminars or special online lectures by KU fa"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEKS008",
    "교과목명": "[진로창업]1학년세미나 II",
    "학년": 1,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 1,
    "시간": 1,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "[진로·창업] 1학년세미나Ⅱ는 멘토 특성을 지닌 교양필수 교과목으로서, 1학년 세미나 지도교수의 통솔 하에 학교에 대한 소속감을 강화하고 창직 및 창업 등의 진로 방향성을 고민해볼 수 있도록, 온라인 합동강좌 수강, 개별 지도 및 면담, 교내외 다양한 프로그램 참여  ",
    "syllabus_en": "[Career·Entrepreneurship] Freshmen Seminar is a required course for first-year students, offering mentorship and guidance in career directions such as entrepreneurship. It includes academic advising, counseling with professors, seminars, and special onli"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT002",
    "교과목명": "[진로창업]SW프로그래밍의기초",
    "학년": 1,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "이 과목은 컴퓨팅 사고와 프로그래밍의 기본 원리를 소개하는 과정이다. 소프트웨어의 근간이 되는 프로그래밍 언어에 대한 체계적인 이해를 바탕으로, Python 언어를 통해 기본 문법, 데이터 구조 및 제어 구조의 핵심 개념을 학습한다. 학생들은 이 과목을 통해 프로그래밍",
    "syllabus_en": "This course introduces the fundamental principles of computing thinking and programming. Building on a systematic understanding of the programming languages that form the foundation of software, students will learn essential concepts of syntax, data struc"
  },
  {
    "구분": "교양필수",
    "학수번호": "GECT003",
    "교과목명": "[진로창업]데이터과학과인공지능",
    "학년": 1,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "_x000D_\n이 과목은 데이터를 다루고 분석할 수 있는 역량과 인공지능 기술을 이해하고 자기의 일에 활용할 수 있는 방법을 학습하는 과정이다. 기초적인 데이터과학 및 인공지능 핵심 개념을 학습하고, 각 계열별 특성에 맞는 데이터를 활용한 실습을 통해 실제 데이터를 다루고 인",
    "syllabus_en": "This course aims to develop the ability to handle and analyze data, understand artificial intelligence technologies, and learn how to apply them in one's field of work. It covers fundamental concepts of data science and artificial intelligence, and throug"
  },
  {
    "구분": "교양필수",
    "학수번호": "GEBT001",
    "교과목명": "[진로창업]생명과학의세계",
    "학년": 1,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "생명과학의 세계는 생명공학의 기초 지식과 생명현상을 이용한 융복합 기술의 다양한 사례를 살펴봄으로써 변화하는 미래 환경을 대비하고 선도할 수 있는 융합적 사고를 함양하는 강좌이다.",
    "syllabus_en": "This is a course that fosters convergent thinking to prepare for and lead the changing future environment by examining basic knowledge of biotechnology and various examples of convergence technologies using life phenomena."
  },
  {
    "구분": "학문의기초",
    "학수번호": "COSE101",
    "교과목명": "컴퓨터프로그래밍I",
    "학년": 1,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "ChatGPT 그리고 Copilot등의 생성형 인공지능 기술은 일상생활 뿐만 아니라 소프트웨어 개발자들의 존재 가치 및 일하는 방식을 근본적으로 바꾸고 있다. 그러나 소프트웨어 전문가라면 프로그래밍 능력은 꼭 필요한 기본 지식이다.  _x000D_\n본 과목은 프로그래밍 경험이 없는 학 ",
    "syllabus_en": "This is an introductory course to computer programming for computer science major freshmen. Problem solving methods are studied using various programming languages."
  },
  {
    "구분": "학문의기초",
    "학수번호": "COSE102",
    "교과목명": "컴퓨터프로그래밍II",
    "학년": 1,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE101",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목은 컴퓨터 과학을 전공하려는 학부생을 대상으로 하는 컴퓨터 프로그래밍의 입문 과정으로서, 논리적인 문제 해결 방법을 학습하고, 창의적인 사고를 유도하여, 실용적인 문제를 다양한 프로그래밍 언어를 사용하여 효율적으로 해결하는 방법을 학습한다.",
    "syllabus_en": "This is an introductory course to computer programming for computer science major freshmen. Problem solving methods are studied using various programming languages."
  },
  {
    "구분": "학문의기초",
    "학수번호": "COSE111",
    "교과목명": "전산수학I",
    "학년": 1,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "기초 선형대수를 학습 하며, 벡터와 행렬을 통하여 다양한 문제들을 선형적으로 모델링 하고 선형 방정식 해의 존재여부를 알기 위한 기반 정리들과 그 계산 방법을 학습 한다. 주 내용은, 행렬 연산, 선형 방정식, Gaussian Elimination, Determinullt, 직교, Rn의 성질, Eig",
    "syllabus_en": "Studies the basic concepts in linear algebra so that students can formulate problems in terms of a system of linear equations using vectors and matrices.  In addition, the course teaches the how to obtain the solution to the linear equations and propertie"
  },
  {
    "구분": "학문의기초",
    "학수번호": "COSE112",
    "교과목명": "전산수학II",
    "학년": 1,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE111",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "기초 확률과 통계 및 최적화 기법을 학습 한다.  또한 확률과 통계 및 최적화 기법이 전산학에서 여러 가지 문제를 풀어내기 위하여 어떻게 쓰이는지 이해 할 수 있도록 한다.  주요 내용은 기초 확률, 조건 확률, 조합, distributions, 랜덤변수, 최대/최소값 구하기, 선형 ",
    "syllabus_en": "Study basic concepts in probability and statistics and optimization and gain an insight into how they may be applied in computer science as in data science and search problems.  Major topics include: basic probability, conditional probability, counting, d"
  },
  {
    "구분": "전공필수",
    "학수번호": "COSE213",
    "교과목명": "자료구조",
    "학년": 2,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE112",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "자료구조의 개념 및 기초지식과 더불어 스택 및 큐, 리스트들을 기본 자료구조로서 다루며, 그래프와 트리를 고급 자료구조로서 다룬다. 자료구조의 응용으로는 순환, 탐색, 정렬, 해싱을 다룬다.",
    "syllabus_en": "This course covers the basis definition of data structures, including stack, queue, dequeue, and lists. Also covers advanced data structures, such as graphs, trees. Advanced topics include circulation, searching, sorting, and hashing."
  },
  {
    "구분": "전공필수",
    "학수번호": "COSE214",
    "교과목명": "알고리즘",
    "학년": 2,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "알고리즘의 표현방법, 기능 및 처리과정, 난해도의 분석, 효율적인 알고리즘을 설계하는 기법, 응용 등을 다루고 기존에 개발된 알고리즘들을 주제별로 분류하여 활용한다.",
    "syllabus_en": "The concept and notation of algorithms, problem analysis, development of algorithms, evaluation, designing efficient algorithms and their implementation in a procedure-oriented language."
  },
  {
    "구분": "전공필수",
    "학수번호": "COSE222",
    "교과목명": "컴퓨터구조",
    "학년": 2,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE221|COSE215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "컴퓨터 동작의 핵심부분인 중앙처리장치 및 메모리 계층구조의 구성과 설계방법에 대해 학습한다. 중앙처리장치에서는 파이프라인 구조에 기반 CPU의 기계어 수행 원리 및 설계에 대해 학습한다. 메모리 계층구조에서는 캐시메모리, 주기억장치, 하드디스크와 같은 저장장치 ",
    "syllabus_en": "This course covers the computer organization details and design focusing on CPU and memory hierarchy. For the CPU operation and design, the implementation detail for the machine code execution is covered with the pipelined architecture. The memory hierarc"
  },
  {
    "구분": "전공필수",
    "학수번호": "COSE341",
    "교과목명": "운영체제",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE213|COSE222",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "이 과목의 목적은 운영체제의 정의, 발전과정, 그리고 구조를 소개하고, 작업을 처리하기 위해 운영체제가 갖추어야 할 기본 기능에 대해 배우는 것이다. 기본 기능들은 프로세스 관리, 동기화, 기억장치 관리, 가상메모리, 파일시스템, 그리고 대용량 기억장치의 관리 방법 ",
    "syllabus_en": "This course covers the definition, the stage of development, and the structure of operating systems. The basic functions of operating system needed to precess a job will be studied as well; Basic functions include process management, synchronization, memo"
  },
  {
    "구분": "전공필수",
    "학수번호": "COSE342",
    "교과목명": "컴퓨터네트워크",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "정보처리를 효율적으로 수행하기 위한 컴퓨터 네트워크를 구축하는 기법을 배운다. 데이터의 송수신을 위한 기본원리 및 컴퓨터 통신 관련 기술이 소개된다. 컴퓨터들 간의 통신에 필요한 인터넷 계층구조, 라우팅, 프로토콜 (TCP/IP protocol suite), 네트워크 보안 및 네트",
    "syllabus_en": "The course will cover the basic concepts and principles of computer networks; layered network architectures, protocols (TCP/IP protocol suite), routing, network security, network management, applications and local area networks."
  },
  {
    "구분": "전공필수",
    "학수번호": "COSE361",
    "교과목명": "인공지능",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "본 과목은 인공 지능의 입문 과정으로, 탐색을 통한 문제 해결, 지식 표현, 논리와 추론, 계획 수립, 불확실성 및 확률적 추론, 의사 결정, 기계 학습, 그리고 인공 지능 응용 분야 등을 다룬다.",
    "syllabus_en": "This is an introductory course to artificial intelligence covering various subjects such as problem solving by search, knowledge representation, logic and inference, planning, uncertainty and probabilistic reasoning, machine learning, and artificial intel"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE211",
    "교과목명": "이산수학",
    "학년": 2,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "전산학의 기초를 이루는 이산수학에서의 중요 토픽들을 강의와 숙제/시험을 통하여 익히고 프로그램 개발 및 컴퓨터 응용을 보다 수학에 기반한 모델링을 통하여 수행 할 수 있는 능력을 배양.  주 내용은 Logic, 집합과 함수, 알고리즘 기초, 기초 정수론, 재귀함수, 그래프",
    "syllabus_en": "The course covers basic topics in discrete mathematics relevant to the study of computer science.  Topics include logic, functions and sets, basic algorithms, number theory, recursion, graphs and trees, and Boolean algebra.  Series of homework problem set"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE212",
    "교과목명": "프로그래밍언어",
    "학년": 2,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE102|COSE215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "프로그래밍 언어의 원리와 프로그래밍 언어를 구성하는 제반 요소들을 이해하고 각 언어별 특징에 대하여 학습하며 프로그래밍 언어의 이해를 위해 Syntax와 Semantics등에 대하여 학습한다. Semantics를 공부하기 위하여 Higher-order procedure를 지원해 주는 언어의 inter",
    "syllabus_en": "Syntax and semantics of programming languages, and use of a language with higher-order procedures as a descriptive and interpreter base for studying semantic issues."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE215",
    "교과목명": "계산이론",
    "학년": 2,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "컴퓨터 과학의 이론적 모델인 Finite Automata, Push Down Automata, Turing Machines 등에 대하여 고찰하고, 이를 기반으로 하여 computability와 computational complexity 이론에 관하여 배운다.",
    "syllabus_en": "This is an introductory undergraduate level course on classical and contemporary theories of computation. Topics include the theory of automata and formal languages, computability using Turing machines, recursive functions, uncomputability, computational "
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE221",
    "교과목명": "논리설계",
    "학년": 2,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE215",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "컴퓨터 동작의 기본 단위인 디지털 논리회로의 원리와 설계방법에 대해 학습한다. 즉, 조합회로와 순차회로의 원리와 하드웨어를 설계하는 언어에 대해 학습한다. 또한 디지털 설계에서 많이 사용되는 가산기/감산기, 디코터, 멀티플렉서, ALU, 래치 및 플리플롭 등에 대해  ",
    "syllabus_en": "This course covers the principles and methods of the digital logic design as a preparation for understanding the computer organization. Hardware design language is covered as well. Main topics include combinational logic and sequential logic designs.  Var"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE242",
    "교과목명": "데이터통신",
    "학년": 2,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "컴퓨터 네트워크 기술을 이용하여 실제 생활에서 사용되고 있는 데이터 통신에 대한 내용을 배운다. 정보화 사회의 하부 구조가 되는 물리적 계층, 데이터링크 계층, 매체접근제어 계층 등의 프로토콜에 대한 이론과 통신 기술을 학습한다. 사례 연구로서, 이더넷, 토큰링, F",
    "syllabus_en": "The course studies data communications for computers and computer terminals. Topics include theoretical basis for physical layer, transmission media, data link protocols, medium access control sublayers, (case studies using Ethernet, Token Ring, FDDI and "
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE281",
    "교과목명": "공학수학",
    "학년": 2,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE112",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": " ? 일차 및 선형 고차 차등 방정식에 대한 수학적 표현을 배우고 방정식의 해를 구한다._x000D_\n ? 라플라스 변환 및 역변환을 자유롭게 할 줄 알고 이를 차등 방정식에의 활용하는 법을 배운다. _x000D_\n ? 다양한 계수를 갖는 차등 방정식 교육한다._x000D_\n ? 직교성에 대해 이해하고 여러  ",
    "syllabus_en": "Engineering mathematics I geared for students interested in solid research in Communications Science and Engineering and related engineering disciplines. _x000D_\nThe topics in this course include:_x000D_\n- Ordinary differential equations (first/second/high-order)_x000D_\n- "
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE283",
    "교과목명": "회로이론",
    "학년": 2,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "전기회로 분석의 기초인 옴의 법칙, 키르히호프의 법칙 Thevenin, Norton theorem을 이용한 등가회로 등을 소개한다. Capacitor와 Inductor를 사용한 회로에 sine wave (AC)와 pulse (transient) 신호 가 입력되었을 때 나타나는 특성을 분석한다.",
    "syllabus_en": "Analyze electrical networks containing basic circuit elements such as R, L, C, and voltage and current sources. Various techniques will be introduces to analyze circuits in DC, AC and transient environment."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE284",
    "교과목명": "전자기학",
    "학년": 2,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE281|COSE283",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "벡터 해석, Coulomb의 법칙, 전계의 세기, 전속밀도, Gauss의 법칙, 벡터계의 발산, 전계의 에너지 및 전위, Faraday 및 Ampere 법칙, Maxwell 방정식 등을 공부하고, 이를 이용한 정전자계 현상에 대한 이론 및 해석방법을 공부한다.",
    "syllabus_en": "This course is designed to help students to understand general theory regarding to electromagnetics: vector theory, Coulomb’s law, Gauss’ law, Faraday’s law, Ampere’s law and Maxwell’s Equations."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE312",
    "교과목명": "컴파일러",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "컴파일러에 대한 기본적인 원리 및 이론에 대하여 학습한다. 세부적으로는 컴파일러를 구성하기 위해 필요한 구문 분석, 의미 분석, 코드 분석 및 최적화, 파싱 방법 등을 학습하고 이를 토대로 실제 프로그래밍 실습을 병행한다.",
    "syllabus_en": "This course includes detailed study of the basic techniques for compiler implementation, including lexical analysis, syntax analysis, semantic analysis, intermediate code generation, object code generation, and code optimization."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE321",
    "교과목명": "컴퓨터시스템설계",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "CPU, 메모리, 입출력 주변장치로 구성되는 컴퓨터시스템을 설계하고, low-level 프로그래밍(Assembly & C)을 통해 CPU와 주변장치의 상호작용을 실험함으로써 컴퓨터시스템의 동작을 이해한다. 커리큘럼에는 Timer, GPIO(General-purpose I/O)설계 및 프로그래밍, interrupt,",
    "syllabus_en": "Understand the operations of computers systems by designing I/O devices, writing low-level programs in Assembly and C, and experimenting the interactions between CPU and peripheral devices. Curriculum includes Timer & GPIO design and programming, Interrup"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE322",
    "교과목명": "시스템프로그래밍",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "컴퓨터하드웨어를 관리하는 운영체제가 제공하는 system call을 이용하여 시스템자원 생성, 관리, 운영 등에 대해 학습한다. 커리큘럼은 프로세스 생성 및 통신, system call을 통한 자원관리 방법, 커널 변경 및 효과 검증 등을 포함한다.  ",
    "syllabus_en": "Study the methods to create, maintain, and manage system resources through system calls provided by operating systems. Curriculum includes process generation and communication, resource managements via system calls, and kernel modification and its consequ"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE331",
    "교과목명": "컴퓨터그래픽스",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "컴퓨터 그래픽스란 무엇이고, 이를 위한 다양한 하드웨어 및 소프트웨어와 원리에 대해 다룬다. 실습을 통해 2차원 컴퓨터 그래픽에서의 윈도우, 뷰포트, 기초 모형, 단절 및 변형 등의 알고리즘과 원리 기법을 다룬다. 시간이 허락되면, 3차원과 4차원에 대한 알고리즘과 원",
    "syllabus_en": "An overview of computer graphics (CG). Various hardware, software, and the principles for CG are covered. Algorithms and techniques in two dimensional CG-window, viewport, primitives, clipping and transformations are covered in practical exercises. If tim"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE352",
    "교과목명": "소프트웨어공학",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "소프트웨어의 전반적 생산 및 유지 보수를 체계적으로 관리하기 위한 과목으로 소프트웨어 개발 주기, 요구분석, 소프트웨어 아키텍쳐, 시스템 모델링, 객체지향 기법, 위험분석, 비용 계산, 테스팅등을 배운다. 실제 프로젝트를 수행하여 경험하며 배운다.",
    "syllabus_en": "Introduction to software engineering. Includes software development life-cycle, system modeling, design methods, object-oriented techniques, software estimation, risk analysis, software project planning and management. Also, the specification, development"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE354",
    "교과목명": "정보보호",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "사회적책임",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "정보화가 촉진될수록 바이러스나 해킹에 의한 정보 시스템의 불법 침입과 정보의 파괴, 프라이버시 및 개인정보의 도용과 침해 등의 심각한 사회적 부작용들이 나타나고 있다. 본 강의에서는 정보보호의 필요성에 대하여 논하고 여러 가지 정보보호 장치 및 기법들을 고찰함 ",
    "syllabus_en": "The illegal intrusion and destruction of system, the fraudulent use of private information, and the invasion of privacy by means of Viruses or hacking causes serious social reaction. This course discusses the necessity of information security and the alte"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE362",
    "교과목명": "기계학습",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "기계 학습에서는 컴퓨터 프로그램이 경험을 통해서 스스로 성능을 개선할 수 있는 알고리즘에 관하여 고찰한다. 특히, concept learning, Bayesian learning, hidden Markov models, decision trees, artificial neural networks, belief networks, kernel machines, unsuper",
    "syllabus_en": "Machine learning is concerned with the question of how to construct computer programs that automatically improve themselves with experience. The topics covered are concept learning, Bayesian learning, hidden Markov models, decision trees, artificial neura"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE363",
    "교과목명": "정보와정보학",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "생명체를 기반으로 생성되는 정보의 본질에 대해 생각해 보고, 컴퓨터과학 만이 아니라, 응용 정보학, 사회정보학 등의 분야에서 다양한 정보 현상에 대한 인식을 바탕으로 정보의 일반 원리를 탐구하는 것이다. 기호학/기호 론, 생명기호론, 언어학, 사회학, 현상학 등 다양",
    "syllabus_en": "It is to explore the general principles of information based on the recognition of various information phenomena in fields of computer science, domain informatics, and social informatics. In addition to discussing recognition of information in various fie"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE371",
    "교과목명": "데이터베이스",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE214",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 데이터베이스의 기본 개념을 관계형 데이터 모델, 관계형 대수 및 SQL을 통해 설명하고, 나아가 데이터베이스 관리 시스템(DBMS: DataBase Management System)의 필수구성요소들인 저장장치 및 색인시스템(Indexing), 질의 처리(Query Processing) 및 질의 최적화 ",
    "syllabus_en": "This course introduces the fundamental concepts of database management systems. Topics to be covered include relational data model, relational algebra, SQL, storage and indexing system, query processing, query optimization, transaction management and conc"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE372",
    "교과목명": "데이터베이스시스템",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "데이터베이스 시스템 구조, 데이터 저장 시스템, 색인 및 질의 처리 기술, 트랜잭션의 개념 및 처리 기술 등을 학습하고, 최신 데이터베이스 기술을 학습한다.",
    "syllabus_en": "In this course, the architecture of database systems, storage systems, indexing and query processing methods, the concept of transaction and transaction processing techniques, and advanced database topics are lectured."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE380",
    "교과목명": "디지털신호처리",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "통신시스템의 이론과 구현의 핵심인 디지털신호처리의 기초에 대해 학습한다. 신호 및 시스템 이론을 바탕으로 기본 선형시불변 디지털시스템의 해석 및 설계에 대한 개요를 비롯하여 표본화 정리, Z-변환, FIR/IIR 필터 설계, Discrete Fourier Transform 와 Fast Fourier T",
    "syllabus_en": "This course covers basics of Digital Signal Processing which is a fundamental tool for design and analysis of communication systems. Based on Signals and Systems theory, the following topics are covered: Analysis and Design of Discrete Time Linear Time In"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE382",
    "교과목명": "확률및랜덤과정",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "확률의 기본 개념, 확률변수 및 확률 분포의 개념을 배우고, 이를 다양한 공학적인 문제에 적용한다. 그리고 이 개념을 다중 확률변수 및 분포로 확장하고, 나아가 확률과정의 개념 및 응용을 배운다.",
    "syllabus_en": "To learn the basic concepts of probability and random variables with their probability distribution, while apply them to the various engineering problems; furthermore, to extend the basic concepts to the multiple random variables and their joint distribut"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE385",
    "교과목명": "신호및시스템",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE281",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "신호 및 시스템의 논리적인 정립하에 CT LTI 시스템 이론 및 응용을 학습한다. Convolution, Stability, Fourier Series / Transform, Laplace 등을 학습하고, Nyquist Sampling Theorem 통한 AD/DA 변환을 분석한다. 음성 및 영상처리 그리고 AM/FM 변조기 및 복조기를 포함",
    "syllabus_en": "Introduction to function-based Signal Representation and the associated ramifications for Continuous Time LTI Systems. Treatment of Fourier Series, Fourier Transforms and Laplace Transforms as they apply to Signal Processing in Information and Communicati"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE389",
    "교과목명": "기업가정신과리더쉽",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "도전적리더",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "국제적으로 성공한 기업가, 투자자, 마케팅전문가, 기술전문가의 엔터프리너쉽과 리더쉽을 학습하여 미래 사회에서 요구 되어지는 도전, 창조 및 실행정신에 대한 중요성을 강조하고, 실질적으로 기업이나 사회에서 요구되어지는 내용들을 파악할 수 있는 기회를 제공하며,  ",
    "syllabus_en": "This lecture (1) enables the students to learn entrepreneurship and leadership from successful entrepreneurs, investors, marketing professionals and technology experts; (2) provides challenging spirits, creativity, and hand-on experience of work tasks req"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE394",
    "교과목명": "창의적소프트웨어창업방법론",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "도전적리더",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 소프트웨어를 설계하는데 있어서 문제를 인식하고 창의적으로 해결방안을 모색하여 궁극적으로는 창업까지 이어질 수 있도록 교육하는 것을 목적으로 한다.  _x000D_\n현업의 주요 문제들을 과제로 선정하여 실무능력향상에 중점을 두었으며 문제를 명확히 이해하고 분석 ",
    "syllabus_en": "The purpose of this course is to introduce you to basics of finding, thinking, solving the problems of software design innovatively. _x000D_\nTo be applicable to real software design domain, you will learn how to understand and analyze problems, collect and orga"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE394-1",
    "교과목명": "현장실습및창업실습I",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0,
    "전공역량": "공감소통",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 소프트웨어를 설계하는데 있어서 문제를 인식하고 창의적으로 해결방안을 모색하여 궁극적으로는 창업까지 이어질 수 있도록 교육하는 것을 목적으로 한다.  _x000D_\n현업의 주요 문제들을 과제로 선정하여 실무능력향상에 중점을 두었으며 문제를 명확히 이해하고 분석 ",
    "syllabus_en": "The purpose of this course is to introduce you to basics of finding, thinking, solving the problems of software design innovatively. _x000D_\nTo be applicable to real software design domain, you will learn how to understand and analyze problems, collect and orga"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE394-2",
    "교과목명": "현장실습및창업실습II",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0,
    "전공역량": "공감소통",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 소프트웨어를 설계하는데 있어서 문제를 인식하고 창의적으로 해결방안을 모색하여 궁극적으로는 창업까지 이어질 수 있도록 교육하는 것을 목적으로 한다.  _x000D_\n현업의 주요 문제들을 과제로 선정하여 실무능력향상에 중점을 두었으며 문제를 명확히 이해하고 분석 ",
    "syllabus_en": "The purpose of this course is to introduce you to basics of finding, thinking, solving the problems of software design innovatively. _x000D_\nTo be applicable to real software design domain, you will learn how to understand and analyze problems, collect and orga"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE394-3",
    "교과목명": "현장실습및창업실습III",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0,
    "전공역량": "공감소통",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 소프트웨어를 설계하는데 있어서 문제를 인식하고 창의적으로 해결방안을 모색하여 궁극적으로는 창업까지 이어질 수 있도록 교육하는 것을 목적으로 한다.  _x000D_\n현업의 주요 문제들을 과제로 선정하여 실무능력향상에 중점을 두었으며 문제를 명확히 이해하고 분석 ",
    "syllabus_en": "The purpose of this course is to introduce you to basics of finding, thinking, solving the problems of software design innovatively. _x000D_\nTo be applicable to real software design domain, you will learn how to understand and analyze problems, collect and orga"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE394-4",
    "교과목명": "현장실습및창업실습IV",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 0,
    "전공역량": "공감소통",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 소프트웨어를 설계하는데 있어서 문제를 인식하고 창의적으로 해결방안을 모색하여 궁극적으로는 창업까지 이어질 수 있도록 교육하는 것을 목적으로 한다.  _x000D_\n현업의 주요 문제들을 과제로 선정하여 실무능력향상에 중점을 두었으며 문제를 명확히 이해하고 분석 ",
    "syllabus_en": "The purpose of this course is to introduce you to basics of finding, thinking, solving the problems of software design innovatively. _x000D_\nTo be applicable to real software design domain, you will learn how to understand and analyze problems, collect and orga"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE405",
    "교과목명": "컴퓨터학콜로키움",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 6,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "본 과목은 학생들에게 다양한 컴퓨터학 분야의 최신, 첨단 연구 기술들에 대한 세미나를 제공하여, 컴퓨터학과 학생들의 지식 배양 및 시대적 동향에 대한 이해를 높이고자 한다.",
    "syllabus_en": "This course provides a series of lectures on advanced, recent technologies in a variety of computer science fields."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE407",
    "교과목명": "개별연구프로젝트",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 6,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "대학원 랩과 공동으로 연구를 진행하는 프로젝트형 과목이다. 본 교과목은 산업체 제안하는 주제별 산학 R&D 프로젝트를 진행하는 것으로 대학원 랩실과 공동 프로젝트에 참여함으로 실전적 SW 역량과 연구 역량, 실무를 향상하는 과정이다.",
    "syllabus_en": "This course is a project-type course in which research is conducted in collaboration with the graduate lab._x000D_\nThis course is a process of conducting an R&D project based on a topic proposed by an industry._x000D_\nThe purpose of the students is to improve practic"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE415",
    "교과목명": "저전력컴퓨팅",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "컴퓨터학 전공 교과목들을 이수한 다음, 자신이 희망하는 연구 주제를 선정하고 해당 분야 교수의 지도를 받으며 심화 연구를 수행하는 과목이다. ",
    "syllabus_en": "It is essential to consider power consumption to design IT devices (from mobile devices to data center). Low power techniques from software to hardware are discussed, leading to cooperated design capability. Additionally, thermal aware techniques are expl"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE416",
    "교과목명": "인공지능과자율주행자동차",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "최근 인공지능 기술이 접목된 완전자율주행 기술에 관한 연구가 구글, 아마존 등 Tech 업계 및 자동차 업계 중심으로 전세계적으로 활발하게 수행되고 있다. 본 강의에서는 학계 및 산업계에서 활발하게 진행 중인 인고지능 기반 자율주행 관련 최신 주요 연구 및 기반 기술 ",
    "syllabus_en": "Self-driving vehicle perception and control has made dramatic progress in the last several years, and many auto vendors have pledged large-scale commercialization in a 2-3 year time frame. This course aims to provide a rich understanding of the foundation"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE419",
    "교과목명": "소프트웨어검증",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "소프트웨어가 올바르게 동작함을 확인하기 위해 사용되는 이론을 익히고 이를 실제 소프트웨어 검증에 활용해 본다. 소프트웨어 검증을 위한 기초 이론인 전산 논리, 프로그램 분석, 및 자동 증명 기술 등을 다룬다.",
    "syllabus_en": "This course introduces the theory and practice of software verification. The topics include foundational theories such as computational logics, program analysis, and automated theorem proving."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE421",
    "교과목명": "임베디드시스템",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE221",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "특수목적 컴퓨터시스템인 임베디드시스템의 종류 및 특징에 대해 이해하고 임베디드시스템 예를 사용하여 실습한다. 또한 Wearable 시스템에 대해 살펴본다. 커리큘럼에는 안드로이드 또는 임베디드 리눅스 컴파일 및 포팅, 디바이스드라이버 프로그래밍, 어플리케이션 프로 ",
    "syllabus_en": "Understand the characteristics of embedded systems, and learn through hands-on-labs of an embedded system. Wearable systems will be covered as well. Curriculum includes Android or (Embedded) Linux compilation & porting, device driver programming & porting"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE423",
    "교과목명": "볼록최적화입문",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "컴퓨터공학의 많은 분야의 문제들은 최적화문제로 귀결되며 문제 해결의 알고리즘 역시 최적화문제의 해를 찾는 과정으로 해석할 수 있다. 본 과목에서는 최적화문제의 기초 이론과 알고리즘 및 응용에 대해 학습한다. 기초이론의 개념으로 볼록집합과 볼록함수에 대해 배우 ",
    "syllabus_en": "This course covers introductory materials for optimization problems for computer engineers. Most of computer engineering problems can be formulated as certain types of optimization problems, and the related algorithms reduce to procedures for seeking solu"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE425",
    "교과목명": "블록체인입문및실습",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "블록체인의 이론을 배우고 기본적인 개념을 실습해 본다. 블록체인 1.0 비트코인의 작동 원리, 블록체인 2.0의 이더리윰의 스마트컨트랙트, 디지털 증서인 NFT (Non-Fungible Token)의 개념을 배우고 이를 텀프로젝트에 적용하여 실제로 디지털 자산을 만들며 공부한다. ",
    "syllabus_en": "This course is an introduction to Blockchain theories and practices  for the purpose of better understanding many blockchain concepts and technologies. Major topics include 1) blockchain 1.0: Bitcoin; 2) blockchain 2.0: Ethereum and Smart Contract; 3) NFT"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE432",
    "교과목명": "인간컴퓨터상호작용입문",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "인터액티브 시스템 및 컨텐츠에서 인간과 컴퓨터 사이의 인터액션을 모델링하고 인터페이스를 개발에 대한 기본 원칙, 가이드라인 및 지원도구등을 배우고 실습 및 구현을 통하여 개념을 학습한다.? HCI 관련 인지과학, 2D 및 웹 인터페이스, 3차원 다중양식 인터페이스, 모 ",
    "syllabus_en": "This class teaches basic principles, guidelines, tools and practices of human computer interaction. The class will cover a broad range of issues starting with the human cognitive and perceptual capabilities, 2D interfaces, 3D and multimodal interfaces, in"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE434",
    "교과목명": "게임프로그래밍",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "다문화포용",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "이 과목은 게임 그래픽스와 애니메이션 분야의 기본 주제를 강의한다. 기하 모델링, 라이팅 및 쉐이딩, 프로그래머블 파이프라인 및 쉐이더, 텍스처 매핑, 스키닝 애니메이션, 충돌 탐지 및 처리 등의 주제를 다룬다. 각각의 주제에 대해 DirectX를 이용한 프로그래밍 숙제가",
    "syllabus_en": "This course teaches the fundamental topics on game graphics and animation. Topics include geometric modeling, lighting and shading, programmable pipeline and shader, texture mapping, skinning animation, collision detection and handling. Each topic involve"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE436",
    "교과목명": "인터렉티브시각화",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "사이버 공간상의 방대한 데이터나 콘텐츠를 컴퓨터 프로그래밍을 이용하여 가시화 시키는 방법을 학습한다. 스마트 미디어에서의 콘텐츠 가시화 방법과 GPU를 이용한 가속화 프로그래밍 수업을 진행한다.",
    "syllabus_en": "This lecture will provide the basic knowledge for visualizing 3D contents and the lecture course that includes mobile content visualization and GPU programming."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE441",
    "교과목명": "인터넷프로토콜",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": "COSE242",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "네트워크 통신과 컴퓨터 시스템의 기본적인 이해를 바탕으로 IPv6, 인터넷 QoS 메커니즘, 인증 프로토콜 등에 대하여 학습한다. 주요 내용으로는 P2P, 보안, NGN을 위한 응용 프로토콜과 시스템을 비롯하여 새로운 네트워크 계층 및 트랜스포트 계층의 프로토콜 및 시스템,  ",
    "syllabus_en": "This course investigates various Internet protocols including IPv6, Internet QoS mechanisms, and authentication protocols based on the fundamental understandings of network communications and computer systems. Topics include newly developed technologies, "
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE444",
    "교과목명": "클라우드컴퓨팅",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "이 과목에서는 클라우드컴퓨팅의 개념, 모델, 그리고 구조에 대해 학습한다. 이 과목의 주요 주제는 클라우드를 위한 기술 들로서, 데이터 센터 기술, 가상화 기술, 서비스 기술 등 이다.",
    "syllabus_en": "The course covers the concepts, models, and architectures of cloud computing. The main topics include Cloud-enabling technologies, such as data center technology, virtualization technology, and service technology."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE446",
    "교과목명": "모바일네트워크",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE451",
    "교과목명": "소프트웨어보안",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "사회적책임",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "소프트웨어 보안 기본 개념과 그 응용 기술에 대해 논의한다. 버퍼 오버플 로우 등의 소프트웨어 보안 취약점의 원리와 분석기술, 개발 단계에서 보안 성을 높이기 위한 시큐어 코딩 방법론, 개발 프로세스 별 보안성 점검기술, 보안 취약점을 이용하는 악성코드 원리 및 탐 ",
    "syllabus_en": "Introduction to software security will be covered, which includes buffer overflow and other software vulnerabilities, secure coding practices, checking tools in development process, and malware analysis."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE455",
    "교과목명": "스타트업프로젝트관리",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "도전적리더",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "스타트업에서의 SW 프로젝트 추진시 착수부터 계획과 실행, 통제를 거쳐 종료할 때까지 프로젝트 수명주기를 관리하는 지식체계를 강의하고자 한다._x000D_\n강의 내용으로는 프로젝트/프로젝트 관리의 기본 개넘, 수명주기, 성공및 실패요인, 프로젝트 관리 관련 중요내용을 ISO215",
    "syllabus_en": "Many knowledge systems that manages the project life cycle from the beginning to the end of the SW project through planning, execution and control will be studied in this class. The contents of this lecture will be based on the contents of ISO21500, inclu"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE457",
    "교과목명": "실전SW프로젝트",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 6,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "본 교과목은 산업체의 기술 수요를 반영한 교과목이다. 본 교과목을 통하여 학생들이 현재 IT 산업의 동향과 기술 이슈를 이해하고, 선수강 한 전공 지식을 활용하여 문제를 해결하는 것이 목적이다._x000D_\n산업체의 기술적 이슈나 문제에 대하여 해당 전문가와 기술 교류를 하고,",
    "syllabus_en": "This subject is a project-type subject that reflects the technology demand of industries. The purpose of this course is to understand current IT industry trends and technology issues, and to solve problems by using computer science major knowledge._x000D_\nStude"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE461",
    "교과목명": "자연어처리",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE361",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 4,
    "syllabus_kr": "본 과목은 인간과 컴퓨터간의 자연스러운 인터페이스 중 하나인 사람의 언어(자연어)를 컴퓨터가 어떻게 이해하고 생성하는지에 대한 기본 원리와 과정을 학습한다. 이를 위하여 형태소 분석, 구문 분석, 의미 분석 등 언어처리의 각 단계에 대한 통계기반과 규칙기반 알고리",
    "syllabus_en": "This class deals with basic fundamentals on how to make computer understand and generate human language. In this class, students have opportunity to learn statistical and rule-based algorithms for morphology, syntax, and semantic analysis. Also, This clas"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE471",
    "교과목명": "데이터과학",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": "COSE213|COSE214",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "본 과목은 빅데이터로부터 정보를 추출하고 추출된 정보를 분석하여 예측 및 직관을 얻는 일련의 과정을 실제 문제 해결의 관점에서 소개한다. 세부 학습 내용은 대용량데이터를 빠르고 안정적으로 접근하기 위한 빅데이터 관리방법(Big Data Management), 데이터추출 및 정 ",
    "syllabus_en": "This course aims to give students the concrete understanding of big data analytics using real-world examples. The process of analyzing big data involves in general extracting information from big data and analyzing the extracted information for prediction"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE472",
    "교과목명": "정보검색",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "시뮬레이션능력",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": "데이터과학과 참고",
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE474",
    "교과목명": "딥러닝",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "사회적책임",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "본 과목은 심층 신경망의 이론 및 응용 분야를 고찰한다. 기존의 인공 신경망, CNN, RNN/LSTM, attention model, memory networks, generative adversarial networks 등의 최근 각광을 받고 있는 딥러닝 기법과 이를 학습하는 데 필요한 initialization, normalization, grad",
    "syllabus_en": "This course studies the theory and the applications of dee neural networks. In particular, this course covers various techniques of deep neural networks, such as fully-connected artificial neural networks, convolutional neural networks, recurent neural ne"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE475",
    "교과목명": "고급딥러닝",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 6,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "딥러닝 기초에 대한 이해를 기반으로 최신 딥러닝 모델과 이론 및 구현, 그리고 최신 연구 동향을 학습한다. 학생들은 실제 문제를 해결하기 위한 고급 딥러닝 모델을 설계하고 훈련할 능력을 함양한다.",
    "syllabus_en": "This course covers the latest deep learning models, theories, and implementation, as well as current research trends on top of the basic understanding of deep learning. Students develop the ability to design and train advanced deep learning models for sol"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE480",
    "교과목명": "산학캡스톤디자인",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": 1.0,
    "세부전공": null,
    "학점": 3,
    "시간": 6,
    "전공역량": "공감소통",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 2,
    "syllabus_kr": "컴퓨터학과 전공 지식을 기반으로 종합적인 공학적 연구와 융합적인 아이디어를 통하여 실용적인 SW 결과물을 도출한다._x000D_\n수강생의 취업 및 창업 시 실무 감각을 배양하고 본인의 SW 이론 및 구현을 자발적으로 함으로서 개인 역량을 강화함을 목적으로 한다.",
    "syllabus_en": "This subject is a project that conducts comprehensive engineering research based on computer science major knowledge. Students derive practical SW results through convergent ideas._x000D_\nStudents develop a sense of practice at the time of employment and start-"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE483",
    "교과목명": "무선회로설계",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "초고주파의 기본원리를 응용한 부품과 시스템을 분석하며, 초고주파 수동회로 설계 및 능동회로 설계를 중점적으로 학습한다. 디자인 SW 이용법을 습득하며, 회로 설계의 측면에서 초고주파 소자의 특성을 분석한 후, coupler, filter, amplifier, mixer, oscillator등을 설 ",
    "syllabus_en": "This course focuses on RF circuits such as filters, amplifiers, mixers, and oscillators utilizing commercially available design software packages. Students will design RF circuits using commercial software packages, and perform measurements using various "
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE484",
    "교과목명": "무선보안",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "창의적문제해결",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "본 과목에서는 interference 및 jamming이 존재하는 무선통신 환경에서 안정적인 무선통신 구현을 위한 물리적/하드웨어적 대응 기술에 대해서 소개하고, 이를 기반으로 대응 기술 실습을 진행한다.",
    "syllabus_en": "This course is intended to study countermeasure techniques for securing sustainable wireless communication in the presence of co-site interference and jamming."
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE485",
    "교과목명": "정보이론과추론학습",
    "학년": 4,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "융합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 3,
    "syllabus_kr": "본 과목은 4학년 학부생을 위한 과목으로서 정보이론과 확률적 추론 방법론을 소개한다. Entropy 와 Capacity의 개념과 이의 핵심적인 응용인 Source Coding theorem 과 Noisy Channel Coding theorem을 소개하고 Monte Carlo  Methods 와 Inference Learning Algorithm 으로",
    "syllabus_en": "This is an introductory course on Information Theory and probabilistic Inference for senior undergraduates.  Entropy and capacity are introduced based on solid probabilistic background and Source Coding theorem and Noisy Channel Coding theorem are introdu"
  },
  {
    "구분": "전공선택",
    "학수번호": "COSE490",
    "교과목명": "전산학특강",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "공감소통",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "컴퓨터학과",
    "내용": null,
    "메모": null,
    "개설횟수": 5,
    "syllabus_kr": "전산학 관련한 최신 기술 분야를 소개 하며, 개설 학기마다 주제는 새롭게 선정되어 질 수 있다.",
    "syllabus_en": "This course introduces hot topics in computer science, and the topics can be chosen every semester individuall"
  },
  {
    "구분": "전공인정",
    "학수번호": "SATA302",
    "교과목명": "시계열분석",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": "STAT241|STAT342",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "데이터분석|시뮬레이션능력",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "통계학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공인정",
    "학수번호": "SATA332",
    "교과목명": "비모수통계학",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": "STAT151",
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "데이터분석|시뮬레이션능력",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "통계학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공인정",
    "학수번호": "SATA404",
    "교과목명": "베이즈통계입문",
    "학년": 3,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "통합적의사결정|시뮬레이션능력",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "통계학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": null,
    "syllabus_en": null
  },
  {
    "구분": "전공인정",
    "학수번호": "DATA302",
    "교과목명": "기초컴퓨터비전이론및응용",
    "학년": 3,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "데이터과학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 컴퓨터비전의 기초이론 및 응용을 배운다. 컴퓨터비전은 다양한 전공이 융합된 분야로 저수준 영상이해부터 고수준 영상 이해를 포괄한다. 본 과목에서는 영상 처리, 이미지 분류, 물체 탐지, 이미지 분할, 영상 접합, 3차원 복원, 이미지 자동 캡셔닝, 이미지/영 ",
    "syllabus_en": " This course introduces the basic concepts and techniques in computer vision. Computer vision is an interdisciplinary discipline to study algorithms that offer low-level and high-level understanding from images or videos. It includes basic image processin"
  },
  {
    "구분": "전공인정",
    "학수번호": "DATA303",
    "교과목명": "고급기계학습",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "통합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "데이터과학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 고급기계학습 이론을 소개한다. 기계학습 모델의 수학적 정의, 최적화 문제, 모델 추정 알고리즘을 배운다. 또한 다양한 기계학습 모델들의 관계를 학습한다.",
    "syllabus_en": "This is an advanced course on machine learning. This course introduces the mathematical definitions of machine learning models, their associated optimization problems and estimation algorithms. In addition, relationship between various machine learning mo"
  },
  {
    "구분": "전공인정",
    "학수번호": "DATA304",
    "교과목명": "빅데이터분석",
    "학년": 3,
    "학기": 1,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "데이터문해력",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "데이터과학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 교과목은 빅데이터를 가공하고 정제하고 분석하는 일련의 과정을 다룬다. 구체적으로 빅데이터를 가공하기 위한 툴(예 Python)을 배우고 다양한 기계학습 기술 또한 다룬다. ",
    "syllabus_en": "The key objective of this course is to familiarize the students with most important information technologies used in manipulating, storing, and analyzing big data. We will examine the basic tools for statistical analysis, Python, and several machine learn"
  },
  {
    "구분": "전공인정",
    "학수번호": "DATA306",
    "교과목명": "디자인사고",
    "학년": 3,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "데이터과학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 교과목은 많은 분야에서 활용 가능한 혁신적인 문제 해결 방법론을 다룬다. 구체적으로, 본 과목은 사용자의 의도를 이해하고, 실패로 부터 배우며, 가능한 위험성을 찾아내고, 이를 스토리텔링을 통한 커뮤니케이션에 활용하여 혁신적인 문제 해결 방법론을 개발하는 것 ",
    "syllabus_en": "This course introduces a systematic approach to innovation and creative problem-solving that can be used in many disciplines. Specifically, this course will help you to learn techniques to understand users’ motivations and to gather deep insights, learn "
  },
  {
    "구분": "전공인정",
    "학수번호": "DATA401",
    "교과목명": "데이터시각화",
    "학년": 4,
    "학기": null,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": null,
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "데이터과학과",
    "내용": null,
    "메모": null,
    "개설횟수": 1,
    "syllabus_kr": "본 과목은 데이터시각화에 관한 내용으로 데이터를 그래픽스를 활용하여 시각화 하는 일련의 과정을 배운다. 접근 가능한 데이터와 문제를 위한 시각화하는 기법들을 배우며, 구체적으로 데이터 모델링, 데이터 프로세싱, 데이터 맵핑, 데이터 인코딩 기술 등을 배운다.",
    "syllabus_en": "This course is all about data visualization, the art and science of turning data into readable graphics. We’ll explore how to design and create data visualizations based on data available and tasks to be achieved. This process includes data modeling, dat"
  },
  {
    "구분": "전공인정",
    "학수번호": "DATA403",
    "교과목명": "강화학습",
    "학년": 4,
    "학기": 2,
    "필수선수": null,
    "권장선수": null,
    "실험실습": null,
    "세부전공": null,
    "학점": 3,
    "시간": 3,
    "전공역량": "통합적사고",
    "대학": "정보대학",
    "학과": "컴퓨터학과",
    "개설학과": "데이터과학과",
    "내용": null,
    "메모": null,
    "개설횟수": 0,
    "syllabus_kr": "본 과목은 강화학습 이론과 실제에 대해 학습하며 딥러닝 기술을 활용한 심층 강화학습 방법을 배운다. 게임 AI, 컴퓨터 비전, 로보틱스, 광고, 자율주행 등 다양한 강화학습 알고리즘의 응용 사례를 학습한다.",
    "syllabus_en": "This course introduces the theories, practices, and various techniques in reinforcement learning as well as deep reinforcement learning, which is a promising area that combines deep learning with reinforcement learning. In addition, this course studies va"
  }
]
